{"tree_id": "https://infinite-story.com/story/room.php?id=96691", "context": "", "first_story_block": "Isaac awoke with a sudden jolt. It wasn't the smell of the coffee that had been timed to start brewing at 7:55, or the three course breakfast that appeared on the table at 8:00. He woke up at 8:00 because that was what he had told his body to do. Sitting up in bed, he tried shake away the groggy feeling clouding his head. As always, it never quite worked.\n\n\"Computer, set!#Isaac==Casual_3\" Moments later, Isaac was awake and alert, fully dressed in his one of his favorite outfits. He hopped out of bed, habitually adjusting his collar as he walked over to the breakfast table. \"Display!#Mission_Objectives,\" he said, sitting down at the table.\n\n\"No important daily tasks,\" announced a voice. \"User #67037-1492 has scheduled a server transfer to visit you. User #67037-1492 will visit from Server Yggdrasil in 0.422 hours. It is recommended that you wait at Hub Central to greet him.\"\n\n\"Oh, good, I was hoping I'd have the day free to spend with Vince,\" he said, skimming through the newspaper. None of the hyperlinks seemed interesting, so he scrolled down until he could see the comic images. His breakfast went unnoticed; he didn't actually need to eat, of course, but he had been raised by traditional, humanist parents, and having the smell of bacon and eggs had become something of a morning ritual. If nothing else, quaint reconstructionist habits of the old ways helped past the time. It certainly didn't hurt anything- the food would be deleted as soon as he walked out the door.\n\nHe took one last look at his reflection before heading out the door. Medieval fashion was the current trend, but he hated the restriction of armor and the idiotic dress-like appearance of robes. 19xx history might not be fun to simulate... but at least they wore pants like decent human beings.", "action_results": [{"action": "Head over to Hub Central to greet Vince.", "result": "Hub Central was an impossibly large complex- it was coded that way. Hub Central was a critical background program, and it had enough issues without having to worry about things like Euclidean Geometry.\n\nHe approached the desk, greeting the worker with a friendly wave. Civil Service jobs were usually relegated to recent files, but it hadn't been long enough from his creation date that he had forgotten how irritating rude people could be.\n\n\"Welcome to Hub Central,\" she said, not bothering to look up from the computer monitor. \"Where may I take you today?\"\n\n\"Ah, I'm here to greet a friend from another server. Vince, from Yggdrasil.\"\n\n\"Very good, sir,\" she replied, continuing her bored monotone. \"If user==#Isaac.0630 Then door==#pod_0147. There you go.\"\n\n\"Thanks,\" he said, walking over to the door. There was only one interior door, of course- why bother having more? If you're going to break the laws of geometry, you might as well break them big. That was the first rule of creating a digital space, after all. Isaac stepped through the door, which had been programmed to take him to the right pod.\n\nIt was a small chamber, with little more than a large transparent tube and a few monitors. Of course, file transfers didn't really work like that- but then, he didn't really have a physical form, either. Sometimes, it was best not to think about things like that. Each successive generation grew more and more comforatble being nothing more than a pattern of code saved as a file in a server, but a lot of the physical interface was still comforting to interact with. To the first generation of digital humans, it had been a necessity. Maintaining the illusion of the real world had kept them sane.\n\n\"Took you long enough,\" said Vince. He was leaning against the corner of the room near the door, doing his best to look suave and sophisticated. He was wearing a full three-piece suit, but between the sunglasses and the impossibly styled hair, he looked more cartoonish than professional.\n\n\"Oh, fuck off,\" said Isaac, punching him in the arm. \"How the hell are you? You look like cliched spy movies have thrown up all over you.\"\n\n\"I'm doing fine, dickface, how about you? You're one to talk, Mr. Gen X. Millions of possibilities, and you pick plain Vanilla.\"\n\n\"It's functional,\" said Isaac, defending himself with a shrug of the shoulders. \"Trends can come and go, but some things are classic. Anyway, my request finally went through- I got a house.\"\n\n\"No shit?\" said Vince, giving him a surprised look through his shades.\n\n\"I mean, it's too small to run simulations on... but I figured I'd rather get a space of my own, first. I can always trade it in. I'm tired of living with people.\"\n\n\"I hear that. You know, space is a lot cheaper on my server... you could have an entire realm...\"\n\n\"Yeah, and your server is also a lot less humanist,\" replied Isaac, cutting their usual argument short. \"A lot more people live without any physical form, and the simulations are a lot more cerebral. That's why you're here, after all.\"\n\n\"Fine, fine,\" said Vince, with a laugh. \"We'll start at your house, and head out from there. Lead the way.\"", "action_results": [{"action": "Leave the pod.", "result": "Isaac made a beeline for the door, but Vince was taking in the sights. \"I still can't believe your Hub Central is a physical location...\" he said, watching the receptionist assign door variables. \"It's so... inefficient.\"\n\n\"Yeah, well... what's the harm? What else are we going to do with our time? Currency is earned by serving people- does it matter if it's the private or public sector?\"\n\n\"I... guess not,\" said Vince, stroking his chin. \"What about those people over there?\" Vince pointed at a group of people, staging a protest in an area specially cordoned off from the rest of Hub Central.\n\n\"Oh, those guys,\" said Isaac, rolling his eyes. \"They're militant humanists. They believe that the Post-Humanist revolution never happened.\"\n\n\"I... what?\"\n\n\"Exactly,\" said Isaac, nodding his head in agreement. \"The fact that we can shape reality around us is just proof of... umm, something about actualizing the world we want to see around us.\"\n\n\"But... we have written history of the great digitalization. There are debug and setup files dated before the earliest person was made. How can you deny that evidence?\"\n\n\"The same way you can argue that fossils are tricks made by the devil,\" said Isaac, with a shrug. \"Variables and simple data manipulation is fine, because that's just a manifestation of our inherent magical powers. But anyone who has been compressed into a stream of data can't be trusted anymore, because they've proven that they're not real people, just illusions and simulations.\"\n\n\"So... it's like Humanism and Solipsism had a retarded crack child together?\"\n\n\"That about sums it up,\" said Isaac, with a laugh. \"C'mon, lemme show you my house. Then we can use it as a base of operations to decide what simulations to participate in.\"\n\n\"Sounds good. Lead the way!\"\n\nIsaac approached one of the exterior doors, and waited his turn to approach the console. Door==#Isaac's_Bitchin_Sweet_House_Hell_Yeah, he typed into the monitor.\n\n\"Nice name,\" said Vince, looking over his shoulder.\n\n\"Yeah, well... shut up,\" replied Isaac, gesturing him through the door.", "action_results": [{"action": "Return home, and make plans for the next few hours.", "result": "\"Seriously, though, Isaac's Bitchin' Sweet House Hell Yeah?\"\n\n\"Shut up,\" repeated Isaac. \"It had to be a unique variable name, and it was the first one I could think of which hadn't been used before.\"\n\n\"I can't imagine why,\" said Vince, taking the recliner closest to the door. \"It's very professional.\"\n\n\"Oh, like it matters,\" said Isaac, rolling his eyes. \"Besides, it's only temporary. In a year or two, I'll upgrade my space, and some other guy will come along and rename it after it's been reformatted.\"\n\n\"Fair enough,\" said Vince. He sat twiddling his thumbs while Isaac scrolled through the listings of available simulations. \"So, do you have a boner for the Silicon Valley era, or what?\"\n\n\"Oh, for fuck's sake,\" muttered Isaac, putting his head in his hands.\n\n\"Seriously!\" said Vince, looking around. \"It's like a historical reenactment of one of the most boring periods of history, ever. Technology has made the physical space irrelevant, but everything still has to exist in tangible form. There's a reason history classes gloss over everything after World War II, maybe the Cold War.\"\n\n\"You just cannot stop poking at that dildo up your ass, can you?\" replied Isaac, glaring over at him.\n\n\"I'm sorry, I didn't know you were such an old man! Seriously, is this even your house? It's boring! Where are the swords? Where are the pillars of fire? Where are the lusty big-breasted women? Is this really your house, or did you just tell your parents to go out shopping for the day?\"\n\n\"You want proof this is my house? Fine. Computer...\"", "action_results": [{"action": "set!#Vince==Embarrass_1", "result": "Vince yelped in surprise as his suit was suddenly replaced with a full ballerina costume. \"Is this really necessary?\" he asked, struggling with the frilled layers of tutu.\n\n\"No, but it's funny as hell,\" replied Isaac.\n\n\"You're an ass.\"\n\n\"You deserved it. Anyway, I figure for our first simulation, we should go for a hardcore battle sim, since Yggdrasil doesn't have many of those. I'm assuming you don't want to wait in an upload line for very long, which leaves us with two choices.\n\n\"The first one is 'The Throne of Dagmar'. It's a bit cheesy, but I know the guy, so we can get priority entrance. He's taking his own spin on the current Medieval trend by having the PCs as barbarians fighting againsts wizards, knights, and dragons. It's pretty fun, even if it does usually devolve into a massive PvP gorefest where no one wins.\n\n\"The second one is 'Assault on Sector Nine'. It's set in one of those imaginary futures where humanity went into space instead of inside its own technology. An inept space captain and his trusty crew stumble upon a damaged freighter sending out a distress signal. Will they be able to defeat the unknown danger and save the day? It's fairly old, so there's not much wait.\n\n\"What do you think?\"\n\n\"I think you should get this damn thing off of me,\" said Vince, sulking.\n\n\"Why bother?\" replied Isaac, with a devious grin. \"It'll just get overriden when we start the simulation, anyway.\"\n\n\"You're an ass,\" muttered Vince. \"Fine, let's go to...\"", "action_results": [{"action": "The Throne of Dagmar", "result": "\"This isn't awkward at all,\" muttered Vince. With the exception of their faces, everyone playing the simulation looked exactly the same; scantily clad barbarians with comically oversized muscles. The females seemed to be wearing more furs, but just barely.\n\n\"All barbarians look like He-Man. Didn't you know that?\" said Isaac, laughing.\n\n\"I must have missed that memo,\" replied Vince, rolling his eyes. \"Should we be listening to him?\" he asked, jabbing his thumb at the wizened old man addressing the crowd.\n\n\"Only if you care about the plot,\" said a nearby barbarian, with a shrug. \"I'm just here to shank some bitches.\"\n\n\"Truer words have never been spoken,\" said Isaac, tightening his grip on the hilt of his sword. \"Everyone is invulnerable for the first few minutes. Use that to get used to the weight and balance of your sword. There'll be some dragon cubs you can fight. After that, it usually becomes a massive free-for-all.\"\n\n\"Well, then, I'd better apologize in advance for beheading you a few minutes from now,\" said Vince, with a smirk.\n\n\"Like hell you will,\" replied Isaac, returning the grin.", "action_results": [{"action": "Suddenly, the graphics become blocky and clustered.", "result": "\"Wh-h@w/s Hqpp3 n1n@?\" stuttered Isaac, as both the visual and audial aspects of reality began to fail around them. For one sickening moment, all of time and space was frozen around them in a blur of graphical smears and awkward colors. Then, with a snap, Isaac found himself standing in a small grey room, with an upload pod and a simple computer display.\n\n\"Does that happen often?\" asked Vince. Isaac spun around to find Vince standing behind him, near the room's only door.\n\n\"That doesn't happen at all,\" said Isaac, shaking his head. \"In fact, I bet we'll be getting a server-wide announcement about the ordeal in a few-\"\n\nA fatal exception 05 has occured at 0028:c001e36.\nA full reset has been deemed unnecessary.\nAll users have been returned to #$home while the problem is being resolved.\nPlease refrain from folder movement until the issue has been satisfactorily resolved.\n\n\"Well, that sucks,\" said Vince, scuffing his foot against the ground. \"I wonder how long that will take.\"\n\n\"I'd like to know why we weren't sent to my house,\" said Isaac, slightly worried. \"We should have gone straight to #Isaac's_Bitchin_Sweet_House_Hell_Yeah... I wonder what happened?\"\n\n\"Well, we were grouped together to run sims, right? If I was set to be the leader, then I bet the failsafes would have tried to take both of us to my home.\"\n\n\"Which doesn't exist in this server,\" realized Isaac, following his train of thought. \"But it had to send you somewhere, so it defaulted to one of the Hub Central pods! Oh, man, I wonder how long we're going to be stuck here...\"\n\n\"Hey, Isaac, look at this!\" Vince was examining the monitor near the upload pod. \"This should be displaying a list of all of the servers, but none of them are shown!\"\n\n\"Well, that makes sense. If the server is undergoing repairs, they're going to take it offline until the repairs are complete.\"\n\n\"But we're not offline!\" said Vince, pointing at the monitor. \"All of the servers are gone, but there's a name on the screen!\"\n\nIsaac looked for himself. Sure enough, there was a single filename on the screen: User #55814-0000. \"I didn't think it was even possible to have a quad-zero designation,\" he said, staring at the screen in wonder.\n\n\"I'm more curious to see what it means to transfer into a person, not a server. Dude, Isaac, we've got to try this out. Get into the upload pod.\"\n\n\"What? Why me?\"\n\n\"Because I thought of it, duh,\" said Vince. \"Besides, you're a native here. If we get caught, we can pretend you were just being dumb and trying to get home.\"\n\n\"Hang on, that makes no sense,\" said Isaac, holding up his hand. \"You're the foreigner, wouldn't you be the one who would try and use the upload pod to go home?\"\n\n\"Yeah... except I'm highly knowledgeable in server transfers, and you're not. It's still less suspicious this way. Besides, Hub Central is closed off to everyone, even the authorities- you heard the announcement. Who's going to stop us? Besides, what's the worst that could happen?\"\n\n\"They could delete us,\" spat Isaac, trying to discourage Vince's enthusiasm with skeptic glares.\n\n\"Oh, please,\" replied Vince, with a laugh. \"Now you're just being ridiculous. At worst, they would just roll back our memories to this morning. Stop being such a baby. This is a once in a lifetime opportunity here! You said so yourself that you've never seen anything like this before. If you don't get in this pod, you're going to regret it for the rest of your life.\"\n\nIsaac let out an exasperated sigh.", "action_results": [{"action": "\"Fine. I'll do it.\"", "result": "\"I'll admit, I'm curious too,\" said Isaac. \"But if I get in trouble for this, I'm taking you down with me, got it?\"\n\n\"Yeah, whatever, just get in the pod. Whenever this gets fixed, I'll just stay in your house, okay? That way you can find me, whoever you become.\"\n\nIsaac nodded in agreement as Vince set up the transfer. \"By the way,\" said Vince, \"if I don't hear from you in 24 hours, I'll just assume that your file has been hopelessly corrupted, and I'll file a report with #support to get you restored as of the you from this morning.\"\n\n\"Wait, what? Corrupted? I don't- get me the hell out of here!\"\n\n\"Too late,\" said Vince, with a smug grin.", "action_results": [{"action": "With the press of a button, Isaac was gone.", "result": "Isaac jolted awake; the transfer was sudden and jarring, as if he had been drifting off to sleep only to have his body shock itself back into a state of alertness. He found himself sitting in a chair, across from a mirror, with a few wires connected to his temples. The effect was not unlike something from a B-rated horror film, although the chair was a plastic office chair, and the wires were connected instead to a sleek, professional looking machine.\n\n\"Weird...\" said Isaac, standing up to stare at himself in front of the mirror. \"I'm actually using this guy's avatar now. This is so weird. Did I stumble inside one of those awkward body switching sims? They're always so badly written...\" Isaac started poking at his new face in the mirror. \"And yet, I feel so... I dunno, heavy.\"\n\n\"Hey, Vince, are you... oh, right,\" said Isaac, realizing Vince was still in the pod room. \"Message Exclamation Point Pound Sign Vince.\" Isaac waited patiently, but nothing happened. \"Hey, computer, are you there? Message Exclamation Point Pound Sign Vince!\"\n\n\"This is ridiculous,\" he muttered to himself. \"Computer, Set Exclamation Point Pound Sign Computer Double Equals Debug Underscore Mode.\"\n\nIsaac began to pace nervously around the room. \"This can't be good. I've never run into a situation where the computer has been completely-\" He stopped midsentence, when something on the room's computer monitor caught his eye. It looked like a screenshot of an MMO; Isaac had seen a few recreations in his day, although most video games existed as little more than background details in simulations that strived for historical accuracy. There was a chat bar along the bottom, a map at the top right, and a bunch of menu buttons assigned to hotkeys. That wasn't the part that had caught his eye, though. The screen showed Vince, standing in the pod room.\n\n\"Oh my God,\" breathed Isaac, hit with the sudden realization, \"I'm outside of the server. I'm in the real world.\" He looked over at the computer screen, to see how the controls were set up. It seemed less like a game and more like a viewing window because of the way there was no character to control, but the chat bar history still displayed the conversation he and Vince had just had. The cursor was hovering over the chat bar, waiting for input.\n\n\"Vince, prepare for deletion,\" he typed. Isaac laughed as Vince frantically looked around the room, trying to find the source of the voice. \"Nah, I'm just kidding,\" he typed. \"It's just me, Isaac. You'll never believe what just happened. I think I'm outside of the server, in some guy's body.\"\n\n\"What? No way!\" Although Isaac couldn't hear Vince speak, he could read what he was saying by reading the chat log. \"I didn't think anyone existed outside of the servers! What's it like?\"\n\n\"It's... a lot like the reality simulations that old people like to host,\" admitted Isaac. \"Other than a few out of place pieces of technology, it looks like an office room from the nineties. I... actually, I don't know what my name is.\" Isaac patted his pants, finding a leather wallet in his back pocket. \"I guess my name is Trent Summers,\" he typed, reading what appeared to be a driver's license. \"The guy can't be too bad off, if this is his office.\"\n\n\"Unless he was summoned there to be a guinea pig,\" countered Vince. \"It's not like we can find him and ask him. I wonder why he was hooked up, anyway. Are they, like, spying on us? Except, if you're talking into my head, you can probably see me, too...\"\n\n\"Come to think of it... how they managed to hook him up is probably a better question.\"\n\n\"I agree,\" said Vince. \"What happens now? Maybe when the servers are back online I can try to find him? I feel kinda bad that you're taking control of his life like this... although if he does have power, we're in a lot of trouble if he finds out who took his body out for a spin. Maybe I shouldn't find him...\"\n\nA knock at the door broke Isaac's concentration. \"Hang on,\" he typed. \"Someone's coming. We'll talk later.\"\n\n\"Hello? Is someone in here?\" asked a female voice, through the door. \"Oh, hello there,\" she said, opening the door and finding him sitting at the desk. \"Are... are you Trent?\"", "action_results": [{"action": "Pretend to be Trent.", "result": "\"Yeah, I'm Trent,\" lied Isaac. Hopefully she would leave soon, before things devolved into some sort of Freaky Friday script. If she started pressing him for information he didn't know, this could get really awkward, really fast. Still, it'd be easier in the long run if she believed him to be Trent, instead of trying to explain that he was really someone else in Trent's body.\n\n\"Oh, I was so worried,\" she said, with a sigh of relief. \"I thought we'd lost you when the server went down. You... don't know anything about that, do you?\" she asked, eyeing him quizzically.\n\n\"No, I have no idea what happened,\" Isaac said, with complete honesty. \"Do you?\"\n\n\"Not even remotely,\" she said, shaking her head. \"Looks like it'll be awhile before the server is back online again. So, what do we do now?\"\n\n\"Uhhh,\" said Isaac, stalling for time as fear gripped his stomach. \"Why don't we, uhh... well, so why did you come looking for me?\"\n\n\"To make sure you were okay, Trent. It looks like someone messed with the Array index. When you and Alistair downloaded yourselves into the server, the whole thing went down. We were barely able to prevent it from shutting down entirely.\"\n\n\"Dang... So, uhh, is Alistair okay?\" asked Isaac, fishing for information.\n\n\"Yeah, he's fine,\" she replied, nodding her head. \"He's a bit shaken up, but other than that, he's perfectly fine. I have to admit, when IT wanted you guys to perform a security check from the inside, I didn't think it would be so dangerous.\"\n\n\"Yeah,\" agreed Isaac, parroting her emotions. \"So, uhh... are we done for the day?\"\n\n\"What a silly question,\" she said, with a laugh. \"You know that they'd never let you go home early, even if an accident did happen. Sit back down, and I'll connect you to the next server.\"\n\n\"I... umm, okay,\" said Isaac, darting his eyes around the room. It wasn't what he wanted to do, but he'd pretty much trapped himself into this situation. Of course, he was only trapped in the sense that doing anything else would be suspicious...", "action_results": [{"action": "Sit down in the chair.", "result": "Isaac decided not to make a huge scene, for Isaac's sake. It was bad enough that he'd stolen his body. How would he like it if someone were to take over his life for a day?\n\nThe woman hummed to herself as she reapplied the wiring to his temples. Isaac drummed his fingers as the woman began to make adjustments to the screen. The pod room with Vince disappeared, and was replaced by a similar room with an old man in it. \"Alistair is already in the other server, waiting for you,\" she explained, when she noticed that Isaac was watching her.\n\n\"By the way...\" she said, turning to face him with a smile. \"I know you're not really Trent.\" Isaac tried to jump out of the chair, but a jolt of electricity raced across his body. A blinding whiteness burned his senses as he screamed in pain. When the feeling subsided, he found himself laying on the floor, curled in the fetal position.\n\n\"I wouldn't recommend doing that,\" she said, laughing at him. \"I really do owe you thanks. Alistair and I had no idea that Trent suspected anything. But it looks like Trent's distraction was too flashy. He couldn't slip away fast enough, and you took his getaway vehicle out from under him. Don't worry, kid. We'll restore you from your last backup point. I mean, sure, I have to delete this instance of you... but in a way, it's like you never really died.\n\nIsaac cringed, bracing himself for another wave of sharp, piercing pain. Instead, he felt nothing but a relaxing calm. As the darkness enveloped reality, he oddly felt at peace with the world. With one last sigh, Isaac drifted off into oblivion.", "action_results": []}, {"action": "Run out into the hallway.", "result": "\"Well, are you going to sit down?\" she asked, raising an eyebrow.\n\n\"I...no,\" said Isaac, backing away slowly. \"I don't want to go back so soon. I just got here!\"\n\n\"Trent, don't be stupid,\" she said, in a soothing voice. \"Just a few more servers, and then we can both go home for the day. The longer you stall, the worse things are going to get.\"\n\n\"I don't care!\" Isaac yelled. He ran out of the room, throwing the door shut behind him. To his surprise, the door latched shut with a click. Did they have locks on the other side? Had he been trapped inside that room this whole time?\n\nIsaac took off at a dead sprint, thankful that the hallway was mostly empty. There were few people in his way; most of them were still seated in their cubicles. He scanned the large open room, looking for an exit. Instead, he noticed a squadron of what looked like security guards trying to intercept his position.\n\nTaking a sharp right around the corner, Isaac stayed close to the outer walls, his best bet for an exit. He looked around for any signs that might help- emergency exit signs, or directions to an elevator.\n\n\"Trent! In here!\" shouted a voice to his left.", "action_results": [{"action": "Obey the voice!", "result": "Isaac ducked into the door on his left, and shut it behind him.\n\n\"I don't think they saw you. They'll have to check the building room by room. That should buy us enough time to sort out this mess,\" said the voice, with relief. \"With the evidence that you sent me, we should be able to put away Alistair and Lacy for a long time.\"\n\n\"You... are Trent, aren't you?\" he added, giving Isaac a confused look.\n\n\"Oh, umm, yeah, absolutely. Who else could it be?\" bumbled Isaac, wondering how much the stranger knew.\n\n\"Wrong answer,\" he replied, pulling out a gun. \"That's not the code phrase we agreed on. Nice try, but you are not Trent.\"\n\n\"Oh God, don't shoot me!\" yelled Isaac, flinching away from the revolver. \"I'm not Trent! I'm not Trent! I don't know what's going on! When the server went offline, we found a username connected to the system, and so Vince uploaded me to see what would happen and now I'm in Trent's body, but I am more than willing to leave, just don't shoot me!\"\n\n\"You're... not Alistair, either, are you?\" he said, lowering the gun. \"You... you're from the server. Oh man, this is perfect! Trent's attack wasn't enough to crash the servers, but it still bought us enough time to take his body away from Alistair! Alright, so we just have to... what's your name?\"\n\n\"I'm Isaac.\"\n\n\"Hi, Isaac, I'm Evan. I'm a programmer. Do you have a house? I'm totally increasing your allotted server space. Do you know how to hook yourself up to one of these things?\" he asked, pointing at a machine similar to the one he'd first found himself wearing. Isaac shook his head no. \"Alright, I'll hook you up, you type the address for pod 0001 of Hub Central into the command bar there, the one below the chat bar. We don't have much time if security manages to get lucky. They're probably checking the main exits and large hallways, but it's only a manner of time before they sweep the building.\"\n\nIsaac nodded, still very confused but glad to have found someone who would issue him orders. He typed in the address, and hit enter. The screen shifted to show yet another pod room, although the occupant of this room looked a lot like Trent's body.\n\n\"Evan says he's glad you made it to the rendezvous point,\" typed Isaac, as Evan applied wiring to his temples.\n\n\"Evan says? Then who are you?\" asked Trent.\n\n\"I'm the guy who took your body,\" typed Isaac. \"I'd say I'm sorry, but it somehow turned out better this way. Evan says I was able to prevent Alistair from taking it when your attack failed, and... ummm, something about how he and Lacy will be arrested soon. He's talking faster than I can type.\"", "action_results": [{"action": "\"Just tell him to get into the damn pod,\" muttered Evan.", "result": "\"There you are!\" said Vince. He had been standing in Hub Central for the past twenty minutes, trying to look like he meant to be there. \"I was hoping you'd find me here! Your house is password protected. No one can enter if you're not around.\"\n\nIsaac had been downloaded back into the server, so that Trent could be uploaded back into his body. He still had little idea what had actually transpired, although Evan promised to create a book explaining everything inside his house. Apparently, the Post-Humanist revolution hadn't uploaded all of humanity into digital form, like the history files had led them to believe. Evan, Trent, and the others were responsible for server maintenance, among other things.\n\nWell, that made more sense than technology that could repair itself from any outside interference. Still, it made one wonder about the nature of reality. Was life as a file inside the server real? Was the real world yet another server, only the inhabitants had no admin privleges? It made Isaac's head hurt.\n\n\"Dude, you would never believe what just happened,\" said Isaac, shaking his head.\n\n\"Uh, I bet I would,\" Vince replied. \"All I know is that you uploaded into a username, and then a Godlike voice that claimed to be you started talking inside my head. I think that I would believe pretty much anything you tell me.\"\n\n\"I... okay, that's fair,\" conceded Isaac. \"Anyway, let's head back to my house, first.\" Isaac typed Door==#Isaac's_Bitchin_Sweet_House_Hell_Yeah into the monitor, and headed home.\n\n\"Whoa, dude, what the hell?\" Vince's jaw dropped as he looked around. What had once been a reasonably-sized living space now had vast amounts of white space attached. \"When the hell did you get all of this server space?\"\n\n\"It's my reward,\" said Isaac, laughing at his surprise. \"I'll tell you everything that happened. And then you and I are going to turn it into a simulation. Dude, we are going to be famous.\"", "action_results": []}]}, {"action": "Keep running!", "result": "Isaac ignored the voice, which was obviously a trap. Isaac found a set of double doors with an exit sign overhead, against the far wall. Isaac ducked into the cubicle farm, taking a shortcut through the rows of confused desk workers.\n\nIsaac reached the doors, and shoved them open. They lead into a stairwell; Isaac headed downward without hesitation. He froze, as the sound of stiff shoes hitting linoleum echoed from below. The guards were in the stairwell. Isaac tried to turn around, but it was too late. He had been trapped.\n\n\"End of the line, kid.\" They handcuffed Isaac, and escorted him back into the room with the woman from before. She started putting the wires onto his temples as one of the officers cuffed his leg to the chair.\n\n\"I really must thank you, kid,\" she said, once the officers had left. \"I know you're not really Trent.\" Isaac tried to jump out of the chair, but a jolt of electricity raced across his body. A blinding whiteness burned his senses as he screamed in pain. When the feeling subsided, he found himself laying on the floor, curled in the fetal position.\n\n\"I wouldn't recommend doing that,\" she said, laughing at him. \"I really do owe you thanks. Alistair and I had no idea that Trent suspected anything. But it looks like Trent's distraction was too flashy. He couldn't slip away fast enough, and you took his getaway vehicle out from under him. Don't worry, kid. We'll restore you from your last backup point. I mean, sure, I have to delete this instance of you... but in a way, it's like you never really died.\n\nIsaac cringed, bracing himself for another wave of sharp, piercing pain. Instead, he felt nothing but a relaxing calm. As the darkness enveloped reality, he oddly felt at peace with the world. With one last sigh, Isaac drifted off into oblivion.", "action_results": []}]}]}, {"action": "Admit that you are not Trent.", "result": "\"Oh, good,\" she said, breathing a sigh of relief. She dropped her friendly smile, and the syrupy kindness vanished from her voice. \"I though we were in trouble when Trent managed to glitch the server like that, but we were able to prevent a complete crash. It'll be back online in a few minutes, and then we'll be able to erase the last evidence of Trent's existence.\n\n\"But you already know that,\" she said, stopping herself. \"Sorry, I tend to talk out loud when I'm nervous. Anyway, Al, I have to get back to work. I'll be at my desk if you need me. I left your office door open, since... well, since your new body doesn't have clearance anymore.\"\n\nThe woman left the room, leaving Isaac alone. He ran back over to the computer, and started talking to Vince again. \"Oh, crap, Vince... that woman thinks I'm someone else!\"\n\n\"Who? I can't see what's going on, you know. Besides... of course she thinks you're someone else. How would she know who you are?\"\n\n\"No, dipshit,\" typed Isaac, \"she doesn't think I'm Trent, either. She thinks I'm some guy named Al. The server glitch was Trent's fault, apparently. Except, I think he was trying to use it to attack back, because Al and this chick had already planned to take his body.\"\n\n\"Okay... so, did she say anything else?\"\n\n\"Not really,\" he typed. \"She's going back to her desk, and I'm supposed to go to my office.\"\n\n\"So... go to your office.\"\n\n\"And where is my office, Vince?\"\n\n\"Hey, I don't know either,\" said Vince. \"But aren't those things usually marked? Just walk around until you find the sign on the door.\"\n\n\"Won't that look suspicious?\" he asked.\n\n\"Why? I mean, it won't be any more suspicious than you walking straight to it. It's not Trent's office.\"\n\n\"That... you have a point,\" admitted Isaac.", "action_results": [{"action": "Try and find Al's office.", "result": "Isaac left the room, and started walking down the hallway, glancing at the nameplate by each door. He walked with his head held high, pretending that he was walking with purpose, as if he was supposed to be here. In reality, he had no idea where he was, let alone how valuable of an employee Trent was to this place. Still, no one was raising their eyebrows as he walked by, so he must be important enough that no one questioned it. Or maybe he was so unimportant that no one even cared what he looked like.\n\n\"I like the first one better,\" he muttered to himself.\n\nEventually, Isaac found the office that belonged to Al. Or, at least, he hoped. The nameplate read Alistair, but the door was cracked open, and the person behind the desk wasn't moving. Isaac shut the door behind him, and walked over to the body. The guy was pretty old; granted, he wasn't ancient looking, but he was bald, and he wore the signs of age poorly. If nothing else, he was definitely near retirement age. Isaac hesitantly extended his hand, and poked the guy's face. His head lolled downward, and, unbalanced, the whole body slumped forward. Isaac jumped back in shock as the body hit the desk. There was no doubt that the body was empty.\n\nConvinced that he was alone in the room, Isaac began to examine the room more closely. To his surprise, the monitor in the room was displaying the same pod room, just like that last one had. Even more surprising, there was someone else in there. It looked exactly like his current body- was that Trent? Isaac watched the chat bar as the two of them began to talk.\n\n\"Finally, I... who are you?\" asked Trent. \"The server's still offline. How'd you get here?\"\n\n\"I'm not from this server,\" answered Vince. \"The failsafes sent me here. I should ask you the same question.\"\n\n\"I'm a programmer,\" he answered. \"I have privleges to go anywhere. I'm supposed to use this pod to get back to my body. Would you like to tell me why it's not a transfer option?\"\n\n\"Oh, uhh...\" said Vince, rubbing the back of his neck, \"I think my friend might have accidentally, umm...\"\n\n\"How do you accidentally upload yourself into something that is clearly not a server, let alone a valid destination?\" asked Trent, getting angry.\n\n\"Good question,\" said a third. \"I hope you entered the wrong pod room by mistake, Alistair.\"", "action_results": [{"action": "Isaac blinked. The third person was also Trent.", "result": "The third person in the room looked exactly like Trent- even the chat log labelled him as Trent. But how was that possible? Was he a copy, or an impostor?\n\n\"Oh, don't try this with me!\" said the first Trent, shaking his fist. \"How dare you take my appearance, Alistair! I suppose you were going to take my body, too?\"\n\n\"Oh, shut up, Al,\" said the second Trent. \"Not this crap. You wanted to take my body, and you failed. You there, stranger,\" he said, turning to face Vince, \"My body is gone. Did you upload someone into it?\"\n\nVince turned red, and began to stare at the floor. \"Well, like I was saying, we just thought that...\"\n\n\"I don't care why,\" interrupted the second Trent. \"Is he watching us right now? Because if he is, he can just delete the impostor by right-clicking on him, and selecting the delete option.\"\n\n\"You've got some balls, telling someone how to kill you,\" said the first Trent. \"If you think that makes you trustworthy, think again. Why would you tell him that, unless you wanted me, the real Trent, dead?\"\n\n\"Why? Because I want him to know that there's a way to get rid of you. You're the one who's fake! You left the job site early- that's how you made it here so quickly. You wanted to make sure I didn't have time to get back into my body, because that would ruin your plan. Little did you know that these kids beat you to the punch. All they have to do is delete you, and then your little scheme will finally be over.\"\n\n\"What's so good about this body?\" typed Isaac. \"Umm, no offense.\"\n\nBoth Trents turned and faced an empty corner of the room, so that they were looking directly at Isaac. \"So you are watching,\" said the second Trent. \"Look, kid, the real world isn't fun and games like your world is. Physical space is at a premium, and overpopulation is a serious threat. If you can't keep up on existance payments, you get uploaded into the server. Alistair here got into some serious debt, and he's about to lose everything. He went to the criminal underworld, and hired some chick named Lacy to help him get a new identity- mine.\"\n\n\"May I just point out that sounds like something only the impostor would know?\" said the first Trent. \"He's right, though. If Alistair takes my body, not only does he get to skip out on his debt, he gets a new lease on life- with the added bonus of knocking 30-some years off of his age.\"\n\n\"But how am I supposed to tell you guys apart?\" asked Isaac.\n\n\"How about they tell you something that only the real Trent would know,\" said Vince. \"I mean, isn't that how this sort of thing goes?\"\n\n\"He's been in my body for twenty minutes, tops. What could I possibly say that would let him know I'm telling the truth?\" said the second Trent.\n\n\"Well, how about this,\" typed Isaac. \"Whose office computer am I using? Al's or Lacy's?\"\n\n\"How the hell should I know!?\" yelled the second Trent. \"I guess... I dunno, Lacy's computer.\"\n\n\"Wrong,\" said the first Trent. \"Trick question. Lacy can't have an office computer, because she works at a desk like I do. So, I guess he's using Al's computer.\"\n\n\"He's right,\" typed Isaac.", "action_results": [{"action": "Delete the first Trent.", "result": "\"And only someone who was working with Lacy would know that,\" he typed. Isaac moved his cursor over the fake Trent, whose attempt to run away had been foiled by Vince and the real Trent. They held him in place while Isaac right-clicked, and pressed delete.\n\n\"So... does that mean Alistair is dead?\" Vince asked. \"I mean, don't get me wrong, the guy deserves to be punished, but...\"\n\n\"No, he's not actually dead,\" said Trent. \"A backup copy of Alistair was made when we were both downloaded into the server. They'll upload that into Alistair's body, and arrest it. Well, they'll arrest it once my friend Evan submits the proof of the crime to the authorities. I'd like to be present for that, if you don't mind.\"\n\n\"Oh, umm, sure...\" typed Isaac. \"I'm sorry I took your body. When we saw a username on the server list, we just had to know what would happen when one of us tried to transfer into it.\"\n\n\"That's understandable,\" said Trent. \"And, honestly, I should probably be thanking you guys. I was hoping the server glitch would be enough to take down the server, so that our backups would have to be used. By the time that restoration would happen, Evan would have had enough time to turn over the evidence I sent him. But it wasn't, and Alistair beat me here. If my body had still been connected, it would have been his, and he and Lacy would have been able to escape.\"\n\n\"How does Alistair getting into your body ruin the incriminating evidence that you gave Evan?\" asked Vince.\n\n\"Lacy would have deleted the whole server,\" said Trent, shrugging his shoulders. \"The evidence is all digital, and once she knows Alistair isn't trapped there, she doesn't have to care about the rest of the data. The server would have needed to roll all the way back to this morning. Without Alistair in the physical world, she can't wipe the evidence from the server without killing Alistair too- and then who would pay her?\"\n\n\"So this Evan guy will be able to put me back in the server?\" typed Isaac.", "action_results": [{"action": "\"How do I find him?\"", "result": "\"I still can't believe there's a world outside of the server,\" said Isaac. He and Vince were sitting in his house, relaxing and taking in the events of the day. Evan had downloaded him back into the server with no difficulty, and Trent had been uploaded back into his body just as easily.\n\n\"I know what you mean,\" said Vince, nodding in agreement. \"I mean, obviously, the servers have to exist somewhere... but I always thought that they were, I dunno, self-sufficient. It never occured to me that when most of humanity uploaded itself during the Post-Humanism revolution, some people might actually want to stay behind. I bet the world outside of that office building was, like, a barren wasteland, you know?\"\n\n\"It makes you wonder what's real...\" said Isaac. \"Reality has always been the server. But, what if that world was a server too? And none of the coding worked because I didn't have any admin privleges?\"\n\n\"Ugh, too deep,\" said Vince, rubbing his forehead. \"I don't want to think about that. Let's just... I dunno, let's do something. I mean, what are we going to do with all of this space?\"\n\nVince gestured outside, where the edge of Isaac's old allotted space was now replaced with a huge, vast whiteness. It turned out that Trent and Evan really were programmers; since physical rewards were meaningless to Isaac and Vince, they decided to repay their gratitude by granting them ridiculous amounts of free server space. The size of Isaac's home had been increased tenfold, and Vince had a similar sized house waiting for him on Server Yggdrasil.\n\n\"Let's make something,\" said Isaac, with a grin. \"I bet the adventures we just had would make for a pretty awesome simulation.\"\n\n\"We are going to be famous,\" said Vince, nodding in agreement.", "action_results": []}]}, {"action": "Delete the second Trent.", "result": "Hi there, Usoki here. It's time for another quick word from the author. Perhaps you managed to make it this far without having the story interrupted by me? Or maybe this is already the fourth time you've seen me? I'm not really sure.\n\nLook, I'll be honest: you deleted the wrong Trent. I mean, sure, I could write about how Alistair will get uploaded into Trent's body, and live evilly ever after while Isaac returns to the server, having no idea that he messed up- until Alistair and Lacy decide to erase Isaac and Vince forever, to destroy all witnesses to their crime. But this is a CYOA story. There are only two options. In the event that you didn't pick the right one, all you have to do is click 'back' in your browser. You're probably just going to scroll down to the bottom of the page, and see whether or not there's a big flashy \"The End\" text anyway. So, yes. You lost. Go back, and delete the other Trent.", "action_results": []}]}]}]}]}]}, {"action": "\"I'm not doing it, Vince.\"", "result": "Have we met? Well, if not... I'm Usoki. It's time for another message from the author.\n\nMaybe you haven't noticed this... but this is a very interesting plot point that you're denying here. If Isaac lets Vince transfer him, all sorts of crazy and interesting things might happen. In fact, you might consider it one of the story's strongest rising incidents. First that strange glitch, then they find themselves in a Hub Central pod, and now there's a weird destination on the screen? I bet the climax of the story is approaching soon. If you turn away now, then what will happen to the story?\n\nLook, maybe you're a cautious person. If you were Isaac, no amount of persuation from Vince would convince you to go through with it. And that's admirable. Really, it is. But this is a story. You're not in any danger whatsoever. Isaac is; and he's just a fictional character. As long as you make the right choices, I'm sure he'll pull through okay.", "action_results": [null]}]}]}, {"action": "Assault on Sector Nine", "result": "\"I can't believe you ended up as the captain,\" muttered Isaac, sulking from his chair at Vince's right.\n\n\"Hey, it makes sense to me. You're the one who marked me as the session leader. Besides, I'm going to make a great captain. For great justice!\"\n\n\"You're an idiot,\" said Isaac, cradling his head in his hands.\n\n\"Somebody set up us the bomb! Main screen turn on!\"\n\n\"Y'know, for someone complaining about my tastes in historic trends, you're really not helping your case by quoting the 'All Your Base Are Belong to Us' script...\"\n\n\"Oh, whatever,\" said Vince, rolling his eyes. \"Some things never get old. Besides, it's a classic piece of Internet Lore. Memes are like that are classic pieces of culture, like Chaucer for Middle English.\"\n\n\"Did you seriously just compare the Canterbury Tales to Lolcats?\"\n\n\"Oh, look, a distress signal,\" said Vince, changing the topic. \"You're the one working all of the sensors and stuff. What does it say?\"\n\n“It doesn’t say anything,” said Isaac, with a shrug. “But the signal is being transmitted in rhythmic bursts that align with Morse Code. See for yourself.”\n\nVince walked over to Isaac's chair to get a better view of the screen, which automatically translated the feed into a short, repeating message: O.S.O. O.S.O. O.S.O.\n\n“Do they even understand English? Who manages to screw up an S.O.S. call? It's obviously a trap set by aliens.”\n\n“Do you know how to write in Morse Code?” asked Isaac, raising an eyebrow.\n\n“I…point taken,” admitted Vince. \"So, either it's a sincere, if not stupid, distress signal, or it's a trap made to look like a distress signal by aliens who don't actually know Morse Code. What do you think, Isaac?\"\n\n\"I think I suck at vehicle combat,\" said Isaac. \"Let's just beam aboard the ship and deal with what happens.\"\n\n\"I like the way you think,\" said Vince, grinning broadly.", "action_results": [null]}]}, {"action": "replace_dialog!#Vince==Gay", "result": "Vince lowered his shades to glare at Isaac. \"I love the cock,\" he said. Vince paused, thinking about what he just said as Isaac started to laugh uncontrollably. \"I need your throbbing member inside me,\" he said, realizing he no longer had any control over the words coming out of his mouth. Opting for sign language, Vince gave Isaac the middle finger.\n\n\"Yeah, well, I happen to find it funny,\" said Isaac, slowly reducing his laughter to a soft chuckle. \"Anyway, I figure for our first simulation, we should go for a hardcore battle sim, since Yggdrasil doesn't have many of those. I'm assuming you don't want to wait in an upload line for very long, which leaves us with two choices.\n\n\"The first one is 'The Throne of Dagmar'. It's a bit cheesy, but I know the guy, so we can get priority entrance. He's taking his own spin on the current Medieval trend by having the PCs as barbarians fighting againsts wizards, knights, and dragons. It's pretty fun, even if it does usually devolve into a massive PvP gorefest where no one wins.\n\n\"The second one is 'Assault on Sector Nine'. It's set in one of those imaginary futures where humanity went into space instead of inside its own technology. An inept space captain and his trusty crew stumble upon a damaged freighter sending out a distress signal. Will they be able to defeat the unknown danger and save the day? It's fairly old, so there's not much wait.\n\n\"So, which one do you think?\" said Isaac, looking over at his friend. \"Well?\"\n\n\"Gently fondle my balls,\" replied Vince, crossing his arms angrily.\n\n\"Oh, right,\" said Isaac, grinning from ear to ear. \"undo!#Vince.\"\n\n\"Thanks for that, dick.\"\n\n\"You deserved it. So, where are we going?\"", "action_results": [null, null]}, {"action": "delete!#Vince", "result": "Well, hello there. Have you met me before? I'm Usoki, the author of this work.\n\nSometimes it's hard to write for a character. Isaac may be a normal guy, but he has near-omnipotent powers regarding anyone and anything inside of his house. It's hard to think of a list of options, because the CYOA format demands that there be a set list, even though the actual possibilities are endless. I tried to give you a wide variety of choices, with the hope that you would understand that one of these choices is idiotic. But since I'm here talking to you, obviously I was wrong.\n\nVince is one of Isaac's close friends. Why on earth would Isaac chose to delete him on a whim? Isaac's tastes have been insulted with offhand comments, and now he must delete someone for it? Where the hell do you live? Why on earth would you think that it's okay to kill someone for being a jerk? I mean, convicted criminals are one thing, but... I mean, Jesus, dude! Deletion is forever!\n\nThere is no way that Isaac would decide to kill his close friend over something this trivial. This is a CYOA story. It is a pretend story. You are pretending to be someone other than you. Please pretend that you are Isaac, a person who would never delete his friend Vince.", "action_results": [null]}]}]}]}, {"action": "You've got the day off! Go do what you want!", "result": "Hey there. I'm Usoki, the author of this story. This is a story about the adventures of Isaac, and his friend Vince. You know, the person you were supposed to meet at Hub Central?\n\nLook, I know that this is a CYOA story. When you pretend to be the main character, you could do almost anything. Your imagination is limited only by the number of choices that the author gives you. So, yes, it's nice to have multiple options. But this is also a story. If you don't go and meet Vince, there will be no story. Who wants to read a story about a guy who has a lazy day off from work? No one! They want to read a story about a guy who has all sorts of interesting things happening to him! And since this is a CYOA story, you even get to choose what interesting things happen to him! Isn't that nifty?\n\nYou were not supposed to pick this option. This option is very boring. It exists only to demonstrate that you, the reader, will have multiple options throughout the story. Sure, Isaac could choose not to meet up with his friend Vince. But why would he do that? Exactly. He wouldn't.", "action_results": [{"action": "So how about you try again?", "result": "Isaac awoke with a sudden jolt. It wasn't the smell of the coffee that had been timed to start brewing at 7:55, or the three course breakfast that appeared on the table at 8:00. He woke up at 8:00 because that was what he had told his body to do. Sitting up in bed, he tried shake away the groggy feeling clouding his head. As always, it never quite worked.\n\n\"Computer, set!#Isaac==Casual_3\" Moments later, Isaac was awake and alert, fully dressed in his one of his favorite outfits. He hopped out of bed, habitually adjusting his collar as he walked over to the breakfast table. \"Display!#Mission_Objectives,\" he said, sitting down at the table.\n\n\"No important daily tasks,\" announced a voice. \"User #67037-1492 has scheduled a server transfer to visit you. User #67037-1492 will visit from Server Yggdrasil in 0.422 hours. It is recommended that you wait at Hub Central to greet him.\"\n\n\"Oh, good, I was hoping I'd have the day free to spend with Vince,\" he said, skimming through the newspaper. None of the hyperlinks seemed interesting, so he scrolled down until he could see the comic images. His breakfast went unnoticed; he didn't actually need to eat, of course, but he had been raised by traditional, humanist parents, and having the smell of bacon and eggs had become something of a morning ritual. If nothing else, quaint reconstructionist habits of the old ways helped past the time. It certainly didn't hurt anything- the food would be deleted as soon as he walked out the door.\n\nHe took one last look at his reflection before heading out the door. Medieval fashion was the current trend, but he hated the restriction of armor and the idiotic dress-like appearance of robes. 19xx history might not be fun to simulate... but at least they wore pants like decent human beings.", "action_results": [null, {"action": "You've got the day off! Go do what you want!", "result": "Seriously? We just talked about this. If you don't go out there and meet Vince at Hub Central, nothing will happen. This story will be very boring, and it will be all your fault.", "action_results": [null]}]}]}]}