{"tree_id": "https://infinite-story.com/story/room.php?id=58387", "context": "", "first_story_block": "The purplish rays of sunlight have just barely made it over the windowsill when the ringing phone cuts into your nondescript dreams. Your room looks like a still frame from a black-and-white movie with only the tiniest fragrant trace of last night's escapade continuing to linger in the air. You are so tired, beyond tired.\n\nThe usual thoughts run through your mind as you pull yourself heavily from bed. Who would be stupid enough to call you so early in the morning? Is it something as mundane as the wrong number? Is everyone ok? You feel ready for anything and nothing as you pick up the receiver and press it hard against your cheek, bullying the arm that is still mostly unwilling to work.\n\n\"Hello?\" you mumble groggily into the receiver.\n\n\"Anna, this is John!\" your brother nearly screams into your ear.\n\n\"What do you want?\" emphasis on \"want\", though you could have put it on \"you\" to just as much effect since you and your brother hardly ever speak anymore, haven't since\u0085\n\n\"Anna\u0085oh god, Anna. Mom is\u0085mom had\u0085Anna, our mother is dead.\"\n\n\"Fuck you,\" you growl, slamming down the phone. You crawl back into bed, trying to resume the exact position you were in before the importunate phone call. You close your eyes, trying to recall his image to your mind. But the sunlight is bright now and shining through your eyelids and somehow or another, you have to face the day. You yank open your top drawer, grabbing the first pair of panties you find. Those striped ones you bought with the gift certificate Mom got you at Victoria's Secret. Mom\u0085what strange dreams you've been having lately.\n\nIn a few minutes, you have maybe half of what you need stuffed into your school bag. You keep forgetting what you are doing as soon as you begin it, or maybe\u0085were your sunglasses on the dresser after all? No, they're tucked away in the bag where they should be. It's your keys that are missing. There they are, hiding under the neck of the whiskey bottle. Mom was the one who introduced you to the drink, in the proud Irish tradition of\u0085books! Books! You're about to go to class without books. You laugh out loud at yourself. You throw every book that is on the desk into the bag because you know it is hopeless that you could actually remember what day it is, therefore which classes you have today. What a logical mind! It's no wonder you're studying to be a professional philosopher, useless profession that it is. That's what everyone said. Everyone but Mom. John said it was a waste\u0085John is a waste. What does he want? Emphasis on \"he\" because he has been no one to you for years now, especially not since\u0085What an odd dream. You step out the door, forgetting to lock it behind you.\n\n**********************************\n\n\n\"And so, we turn to our friends in the psychoanalytic field for a little enlightenment on this particular point. Uh\u0085let's see, Mr. Peck, would you perhaps care to expand, seeing as you are our resident psychology major?\"\n\n\"I don't know, it's been a few years since my misspent undergraduate days,\" he answers. Emphasis \"he\". He is him. He is he. Your personal alpha and omega and phi beta kappa. What would he say if he knew the\u0085remarkable thing you did to yourself last night while fantasizing about him? On the psychological level, he'd be sure to understand, but how would he react before he had time to rationalize it all? You can smell his intelligence from across the room, the real animal odor that the geniuses give off so they can be detected without ever having to brag.\n\n\"Give it a shot,\" the professor encourages him. \"for the first time in my life, I've run out of things to say about the philosophy of ethics.\"\n\n\"It's called the Todestrieb, translated into English as the 'death drive'. I don't really remember much beyond the fact that it stands out as a facet of human behavior that is readily apparent but which seems to fly in the face of the idea that we always do what's pleasurable. It's possible that the pleasure principle is not the only thing that governs decisions. It's also possible that we as a species have a unique ability to transform pain into a form of pleasure. I think they saw a lot of this in action in cases where there was a high degree of trauma caused by abuse or\u0085\"\n\n\"Excuse me, I'm terribly sorry to interrupt,\" a meek woman pokes her head into the classroom door she has just opened. You recognize the department secretary. To your surprise, she looks right at you, smiling benignly, if maybe also a little nervously. \"Anna, would you mind coming to the office for a moment? Actually, why don't you bring your things with you?\"\n\nYou feel like the kid who gets to leave school early. A little shiver of excitement runs down your spine as you gather up your things and coyly say, \"thanks for the analysis, Sigmund\" to the object of your desire as you leave the room. You had rehearsed the line while stuffing books into your bag and you think it went rather well\u0085what does she want? No emphasis anywhere because you don't particularly care or even want to know. You want to freeze this moment, not-knowing and him, not-knowing and him. He is\u0085suddenly, you're in the small department office.\n\n\"Anna, I have just received a call from health services. They need you to go right away to the infirmary.\"\n\n\"Why?\"\n\n\"I don't know, hon, but it sounds important.\" She smiles blandly yet urgently at you. You shrug your shoulders.\n\n**********************************\n\nStepping through the infirmary doors, you realize with a touch of surprise that you remember absolutely nothing about your walk across the quad. You were just there, weren't you? You feel a gentle dragging, like the pressure from a cat's paws on a ball of yarn.\n\n\"Anna, are you Anna O'Hagerty?\" a pretty young nurse asks you, seeming to materialize out of thin air.\n\n\"Yeah, that's me.\"\n\n\"Would you come with me, please?\"\n\nShe's too young to be a nurse. Shouldn't she be a student, like you? The whole place looks cartoony as you follow her up a flight of stairs to what you already know is the psych wing. She's simple, with simple language, a simple smile. She exists in only two dimensions, as do you at the moment.\n\n\"Dr. Fay,\" you smile blandly as the nurse opens the door to an office where you have been before. For a few months, Dr. Fay has been treating you for depression and \"unspecified other disorders\", without much success. You have prided yourself on being a difficult patient, and attend therapy sessions more to feed your sense of the absurd than to get any real assistance. Dr. Fay is bland. It is out of character for her to call you without you calling her first. It doesn't match. The world pops back into three dimensions and you sit down, instinctively. You hear the door shut behind you.\n\n\"Anna,\" says Dr. Fay.\n\nYes, that is your name.\n\n\"Anna, I got a call from your brother John this morning. He was very worried. He said he had spoken briefly with you earlier, but that you had been disconnected.\"\n\n\"That's one way of putting it.\"\n\n\"Anna, I'm afraid this is something that you must know. Your mother, Mary, was in a very serious car accident last night, and lost her life. Oh Anna, I am so sorry.\"\n\nDr. Fay looks pale and confused.\n\n\"My mother is dead?\"\n\n\"Yes, Anna. Your family has arranged for you to travel back home. You leave tomorrow morning. The philosophy department has been notified and you have been granted leave. Anna, I scarcely know what to say. I would just encourage you to stay here on the ward overnight so that you can have help nearby, should you need it.\"\n\nYou barely hear the latter part of her sentence, because you are overcome with a sudden, indomitable exhaustion. However, you are alert enough to recognize the acute irrelevance of the choice you have just been offered.", "action_results": [{"action": "Stay in the psych ward", "result": "\"Um, I guess I'd like to stay here,\" you sort of mumble, wondering just as soon as the words are out, why you've decided to stay here.\n\n\"Good, I think that's a good decision. Come on, I'll walk you there.\"\n\nYou follow Dr. Fay down a back staircase you'd never noticed before. It opens up onto a very institutional-looking white corridor with heavy wooden doors on both sides. Dr. Fay checks with a nurse standing at the entrance to an office, then leads you to a door at the end of the hallway. Opening the door, she reveals a pleasant enough room, with a hospital bed, a desk, a chair and a large window with thick blinds.\n\n\"I didn't even know this was here,\" you say.\n\n\"Well, this school is very well known for its psychiatry program. I'm glad we can have this available for you tonight. This envelope is for you. In it are your plane tickets and a receipt from the cab company that will be picking you up tomorrow morning. It's all arranged already. Someone here will wake you up in time to go back and pack some things in your apartment, unless you'd like for someone here to do that for you?\"\n\n\"No. I'll manage in the morning.\"\n\n\"Anna, is there anything else I can do for you? Anything at all?\"\n\n\"No, thank you, Dr. Fay, you've been more than kind.\"\n\n\"All right. Godspeed, my dear, and if you do find that you need someone to talk to, there is a full staff working here around the clock.\"\n\n\"Okay.\"\n\nThe door closes and suddenly you are alone. Your exhaustion wins over and you doze off, your chin drooping onto your chest.\n\nThe door opens.\n\nThat same nurse from earlier comes in, smiling too broadly.\n\n\"Hey,\" she says. \"I brought you some dinner.\"\n\nShe is in the process of wheeling the little hospital tray over to your bed when a piercing scream fills the air all around you. You instinctively press your forearms against your ears. The little cartoon nurse dashes out of the room. Slowly letting your arms down, you are surprised to find yourself on your feet, following her to the bathroom, where the horrible sound seems to be coming from.\n\nA girl about your age is lying on the floor, hitting her head repeatedly against the toilet bowl, crying out with the repetitive bleating of a baby animal. She struggles to squeeze tears out of her eyes as she arches herself this way and that in a demonstration of the utmost pain.\n\n\"He doesn't love me!\" she wails. \"He doesn't love me anymore! There's another girl, I'm sure of it!\"\n\nYour first impulse is to laugh, which you do.\n\nBut then something else fills you: a cold, brutal anger demanding immediate expression.\n\n\"You little brat,\" you hiss. Something in your voice instantly silences her. \"Do you know why I'm here? I'm here because my mother died yesterday. That's right, my mother. You waste the school's funds on your fucking highschool problems. Do you even know what a real problem is, you ridiculous little cunt?\" Your voice begins to break. The nurse looks up at you with a mixture of shock and disapproval. You continue. \"They just told me this morning. They just called me to tell me this. I don't have anyone now. No one who matters. A child without a mother is basically an orphan. And here you are with your stupid theatrics cracking your head against a toilet bowl? Do you have any idea how stupid you look!\"\n\n\"Okay, Anna, that's enough\u0085\" begins the nurse.\n\n\"Your whole discipline is horseshit. Your whitewashed little corridors, your pandering to any asshole with any joke for a problem! Is this really what modern psychology is all about? Do you think that chilling out in your clean little room and eating institutional shit has really made me feel better? Do you think it does jack shit to erase the cold, hard facts? Is this really all you people have to offer, pussyfooting around and pretending like real life isn't a fucking tragedy? Fuck you!\"\n\nYour eyes have filled with tears, you barely know what you're saying, but you are aware that you've gathered up your few belongings from your room at the end of the hall in preparation to return to your apartment.\n\n\"Anna, I respect what has happened to you, but you can't just do this to another patient.\"\n\n\"The only reason I ever came here in the past was to feed my sense of humor. But that has run out now. The only way to ever get me back in one of these pointless dumps would be to drag me in kicking and screaming!\"\n\n\"Oh, that often happens,\" the nurse says quietly, her face obscured in the shade of the dark corridor. You storm out into the night and back to your small apartment.\n\nYour few angry tears have not yet dried on your face as you collapse onto your bed, falling instantly asleep.", "action_results": [{"action": "Dream", "result": "There's a warm sunlight, a sunlight warm like summer sun. When your life was quiet sunlight, when you were there, a thin white blanket. Slowly breathing morning, quietly the door opens. Quiet, quietly now. Close your eyes, little one. I'm just here to\u0085sunrays were only soft then, quiet the morning in summer. Many mornings in summer. Outside, life awaking, you in the warm cocoon, the thin blanket soft, under the blanket\u0085Anna, oh Anna, you angel. Smells like ladybugs and flowers, the door opens softly in the breathing morning. Anna, are you awake? No, don't wake up. Stay as you are, my angel. Little creaks below, under the blanket, under and up, the sunlight warm right through the thin blanket. My god, you are perfect. You are a gift from God. I don't want anything but to bask in your perfection. You are so beautiful\u0085the garden flowers swayed a little in an early morning breeze, then they were still. The sun that summer, soft. Your hair is so soft. Hidden hiding places in the forest. He whispered in the early morning\u0085\n\nThere's nothing wrong with feeling good. This could make you feel good too. Let it make you feel good. Let me make you feel good\u0085\n\nYour father is a cop, a good man with a good family. What a pity it would be if they thought you weren't good anymore\u0085\n\nSomeone is coming up creaking stairs.\n\nIs that John? John!\n\nBe quiet, little Anna, your hair is too soft for words.\n\nDon't ruin the moment. Don't ruin it all.\n\nThere's nothing wrong with feeling good\u0085\n\n**********************************\n\nWhen your eyes open, it is still dark outside. Is it morning or night? Cold, not like the sunlight that was so unusually soft that summer. You shiver in the morning cold. What was? What?...It all comes back down in small flurries, back into memory.\n\n\"Mom,\" you say dully up to the ceiling. \"I have to go home for my mother's funeral. I have to get ready to go home. I have to get ready right now.\"\n\nYou turn on the bedside lamp, which casts a dim thoughtful light over the piles of books all over. You're not planning on bringing a single one of them back with you. Rummaging through your closet, you pull out your battered old suitcase, which you absentmindedly begin to stuff with various articles of clothing from the closet, from the bureau, from the floor. You don't want to think of which particular events you will need which items for. The beauty of the early morning is that it is the time before anything has become real. There's nothing wrong with feeling good. You discover another old bottle in the back of your closet, this one still containing the remains of some flavored vodka from an early semester party. You open your throat gratefully to what's inside, letting it all in, not flinching. You had been feeling sick upon waking up, now you feel all right, and that is all right.\n\nEssentials, you need the essentials. Sunglasses, wallet, keys, phone, ticket. A card inside is from a local cab company. Someone wrote a time on it. It's coming in half an hour, right to your door. You put your headphones into your ears and walk out the door, forgetting to lock it behind you.\n\nThe fascination of transit. Buses connecting to trains, connecting to planes. All around the world, from any one point to any other point, there is a way to get there, there are people going that way. What kind of lonely thoughts do the early-morning travelers have as they drift down the empty highways?", "action_results": [{"action": "Go home", "result": "\"I'm glad the priest is gone. He tried to touch me.\"\n\nYou turn angrily on your younger cousin, who mumbles these words through a mouthful of cheese puffs.\n\n\"You little shit. Can't you have any respect?\"\n\nNormally he would shoot something back at you, but even in his puerile adolescent mind he realizes there are certain boundaries that cannot be crossed. He disappears into the living room, passing old Aunt Fiona on his way out. She is sitting alone in an upright chair, her head bent over some dull old rosary beads that click incessantly in the silence. Sensing you looking at her, she meets your gaze with her evil black crow eyes.\n\n\"There should have been a wake!\"\n\n\"I told you before. No one fucking does that anymore. It's grotesque.\" You are not normally rude to elderly family members, but you know that there aren't any boundaries you must respect today. The whole world must pity you and offer up an infinite berth for bad behavior. \"Stupid old bitch,\" you mumble for good measure as you turn towards the staircase, the same staircase down which you used to race your brother on Christmas mornings. A few people are still here in your old house, but most of them are gone. That was the last earthly event dedicated to your mother, and it was over so soon. Now begins the likewise short process of forgetting.\n\nYou trudge up the stairs, paying inordinately close attention to the faux Oriental runner. You have almost crashed into him when you notice his black-polished shoes right in front of you. You stop abruptly, gazing up to meet the eyes of \"the guy\". None of you could remember his name; he was just \"the guy\" or \"the boy\", the one who served your drinks on a faux silver platter and then took them away when you had finished. His blue eyes blink guiltily at you.\n\n\"Oh, I'm sorry. I didn't mean to intrude up here. It's just that the downstairs toilet is clogged.\" He smiles sweetly at you. He must be about your age, probably a little younger. He has a thick Boston accent.\n\n\"It's claahged, eh?\" you parrot back to him. No one in your family could ever stand the idea of joining ranks with the stuffy bourgeoisie, so you call him \"the guy\" rather than \"the server\" and you sometimes mimic his vernacular. Your mind slides with alcoholically polished ease from the intricate patterns on your floor to the friendly simplicity of your new acquaintance. \"Come on in,\" you say, not lowering your voice at all, nodding towards your bedroom.\n\n\"Ok,\" he answers after a brief pause, taking one quick glance down the stairwell before following you in. You shut the door and lock it.\n\n\"I need to relax,\" you sigh, removing your velour cardigan and placing it carefully over your desk chair. You feel as though you've just come home from a good long jog. \"Want a light?\" you ask him, pulling a box of cigarettes out of the sweater pocket. \"Go on. It's not a problem here.\"\n\n\"Thanks,\" he says as you flick the lighter on, holding it steady for him. For a few moments, the only movement in the room is the slow wafting of smoke up to the ceiling. He looks around your room, smiling a little at your dusty old collection of Barbie dolls, the peeling lavender wall paper, the Sesame Street pennant hanging over the door. You stare with impatience at his crotch. If you don't intervene soon, his friendly curiosity will turn into friendly questions and you'll have to tell him that it's your mother's funeral where he has been serving, not the final farewell after-party for some useless great uncle.\n\nYou don't let him finish the cigarette. Pulling it from between his fingers, you put it out on the back of your left hand. You feel a sharp sting which instantly subsides. Throwing the butt onto the floor, you slowly pull your own cigarette from between your lips, stubbing it out on your right hand. The same sensation, but slightly decreased\u0085He stares at you for a moment, then cracks a wide smile. You could tell from the way he spilled drinks that he was the easygoing type.\n\n\"Hardcore,\" he says.\n\n\"They're my stigmata,\" you reply, turning your back to him. You quickly remove your camisole and unhook your bra, letting it fall to the floor. You turn abruptly back towards him. His eyes have already assessed the height and are right where they should be to take in the thrill of your firm upturned breasts. He opens his mouth as you slowly lean over him, allowing him to partake of a still-soft nipple between his chapped lips. The chafing turns your nipples instantly hard, and you encourage him with a gentle rubbing behind his ears. He responds in kind, softly wrapping two warm arms around your waist.\n\nAs he keeps busy with your breasts, your attention has begun to wander. You are filled with a great restlessness and you stare expectantly at the door, like maybe the next time you open it you will find yourself in a far more interesting and meaningful place.\n\nTo hurry things along, you kneel down in front of \"the guy\", pushing his legs apart like a loose-swinging gate and picking impatiently at his buttons. Not wasting a moment, you pull his eager penis out from under his boxers, running one hand roughly up and down the shaft. He grips nervously at the back of the chair. You don't bother to look up at him before diving down to take him hungrily in your mouth. His whole body is stiff and nervous and it occurs to you that he is quite inexperienced. This shouldn't take long. Up and down and up and down, your head bobs in a decisive motion. Not even a minute has passed before you hear a pathetic whimper from above, and then it is all over.\n\nSwallowing the new contents of your mouth, you stand up, turn around, and put your bra and shirt back on. You pop a stick of gum and make for the door.\n\n\"You're still on for another half an hour,\" you say as you open the door wide, smiling as you hear the guy scrambling to hide his parts back in the safety of his plaid boxer shorts.\n\n\"My name's Tom\u0085\" he begins, but you are already halfway down the hallway.", "action_results": [{"action": "Continue Downstairs", "result": "Back downstairs, you make a beeline for the diminishing drink table. Not seeing a garbage anywhere, you stick your chewed gum on the window sill.\n\n\"Disgustin' girl,\" you hear in that unmistakable, thick Irish accent.\n\n\"What was that, Aunt Fiona?\" you demand angrily, spinning around to face her. She pretends not to have heard. In fact, she begins to sing.\n\n\"Last night she came to me\nMy dead love came in\nSo softly she came\nThat her feet made no din\nThen she put her hand on me\nAnd this she did say\nIt will not be long, love\nTill our wedding day\u0085\"\n\nYou shake your head and continue your business of pouring yourself a stiff drink. You stand staring out the window, at the little enclosed backyard and the house next door. The whole scene lies dim and undefined in the dusk. You tilt your head back to let the last golden drop trickle its way down your throat. You begin to pour another when that same evil voice interrupts you.\n\n\"The drink is the devil's invitation to spend all eternity with him in Hell.\"\n\n\"You fucking bitch! This is my mother's funeral, goddamit! I can do whatever the fuck I want! Get the fuck out of here, you miserable old cunt!\"\n\n\"The guy\" glances furtively at you as he scurries into the kitchen.\n\n\"What the hell is going on here?\" your red-cheeked father comes bumbling into the room, expressing all his confusion at the various walls and the ceiling.\n\n\"The girl has evil in her eyes! The devil I tell ya!\" Her obsidian skull holes have locked onto you, holding shark-fast.\n\n\"All right, Fiona, I think it's time you went back to the home,\" your father says. \"It's been a long day for all of us.\" Obviously quite drunk, but too whatever he is to care, he escorts her out the door.\n\nFinally released from those witch eyes, you race up the stairs and back into your room, slamming the door shut. How dare that bitch talk to you like that? Mom would never have allowed her to abuse you so blatantly. Mom!\n\n\"You want evil! I'll show you evil!\" Suddenly you find yourself grasping at everything that isn't nailed down and hurling it across the room. The computer keyboard crashes into the wall, falling down onto your bed. The table lamp seems to smash to pieces almost before it hits the closet door, which swings open to reveal a space full of clothes and shoes that likewise find new places on shelves, in corners, hanging upside-down from curtains. You are heading for your old cross-country running trophy when your eye catches sight of a skimpy purple tank top and suddenly a new idea fills your head.\n\n\"I'll show you evil,\" you smile to yourself, grabbing the shirt up from the floor. Before you know quite what you're doing, you are dressed in tight satin on top of a miniskirt on top of long bare legs and heels. You dig out some old makeup from your dresser drawer, smearing it on with almost clownish heaviness. You smile at your trashy reflection in the mirror.\n\n\"If I stay in this house for one more second, I will kill someone.\"\n\nWith that, you grab your purse and leave your room. You slip on the faux Oriental runner, steadying yourself on the banister, then leave the house without meeting a single person. You forget to lock the door behind you.\n\nThe night is black and uninviting. Where do you go?", "action_results": [{"action": "Go to the neighborhood bar", "result": "Making your way along the dark, crooked streets, you feel the cold stiffening your bare legs. Dante's, your favorite neighborhood dive bar, is just around the corner.\n\nPushing open the heavy glass door, you look around at the familiar setting: the glass brick windows, the tattered old stools, the counter slicked smooth through years of spilled drinks and half-hearted cleaning. The usual clientele is there, wearing their backwards Boston caps and kicking back Guinness number six while watching whatever sport is on TV. You get a few looks and a whistle as you saunter up to the counter in your skimpy little outfit.\n\nYou smile at the bartender, who is also the owner. He was there at your Confirmation because his daughter is your age. Last you heard, she was living somewhere on the North Shore, pregnant for the third time by the third guy.\n\n\"Hey, Pudgy,\" you greet him, smiling genuinely. Pudgy had a real name once, but the entire neighborhood knows him by this much more accurate moniker.\n\nHe gives you a look of confusion, followed by a frown. He must know.\n\n\"Anna,\" is all the usually jovial butterball can manage to say to you. \"What can I get for you, dear?\"\n\n\"Guinness. No, make that two.\"\n\n\"Sure thing. It's on the house.\"\n\nYour drinks in hand, you scan the bar hopefully for someone who either hasn't heard about your tragedy or who is simply too drunk to care. As though God were listening to these thoughts, you immediately lock eyes with Bob Brunswick, your childhood sweetheart. After openly gaping at you and your figure for a few seconds, he looks abruptly away to stare at the wall. His head hangs vulture-like between two tense shoulders. Undeterred, you walk straight to his otherwise empty table and sit down.\n\n\"Hey, I remember you!\" he says a little too happily as he is again forced to look at you. \"How are you, Anna? I'm drunk!\"\n\n\"It's nice to see you again, Bob. How long has it been? Since I left for college?\"\n\n\"Well actually I saw you once last summer but you must not have noticed me.\"\n\nActually, you had.\n\n\"Still working for the construction company?\"\n\n\"Yep.\"\n\nSilence falls over your rickety little table as you pour the two Guinnesses down your throat. Bob smiles hopefully at you. \"Can I get you another one?\"\n\n\"You know, I don't think I'd mind that. Thank you.\"\n\n\n**********************************\n\n\n\"So, college girl,\" he asks as you put down your fourth empty beer. \"Why have you been gone from my life for so long?\"\n\n\"Remember my 8th birthday party when you drenched my uncle with the Super Soaker?\"\n\n\"Oh yeaaah! You told me he was a bad man, so I told you I'd kill him, right?\"\n\n\"That's right.\"\n\n\"So is he still a bad man?\"\n\n\"Bob, you got a girlfriend?\"\n\n\"Sorta. No. I dunno.\"\n\n\"You wanna come hang out at my place?\"\n\n\"Of course. By the way, Anna, you look really great.\"", "action_results": [{"action": "Take him home", "result": "\"Come on, baby, let's bag the vid and just get busy.\"\n\nBob's overactive hands are all over your body, up and down and around and pulling at the clothing that seems glued to your skin. You do your best to ignore him as you adjust the volume of the old home video that you have started playing in your room.\n\n\"Look! There you are loading the Super Soaker in the kiddie pool! You look so mad!\"\n\n\"Heh. Yeah. How the fuck does this bra work? Dammit I'm drunk.\"\n\n\"I'm gonna get him! He's gonna die! Like this! Badda-badda-badda-badda-nnneehhhBOOOM!\"\n\n\"I'll get it. Just lie down on the bed.\"\n\n\"Hurry up, Bob! He's about to leave! Hey John, is the camera working?\"\n\n\"I think so!\"\n\n\"Well make sure, dummy!\"\n\n\"Anna, you're killing me. You can see I'm ready over here!\"\n\n\"Just a minute. This is the part where you start stalking him!\"\n\n\"This is Agent Bob Brunswick. I am on a mission to kill Uncle Frank because he is a bad man. Anna said so. I love Anna!\"\n\n\"Oh Christ, yeah! Yeah, girl, fuck me!\"\n\nYou are doing the best you can with Bob's semi-soft cock as you ride him with a quick thumping motion. You don't really take any notice of Bob, of his considerable paunch or his amusing squinty-eyed expression. You watch the video closely.\n\n\"Target has been visionized!\"\n\nYour pussy is so wet, you begin to slide around on top of old pal Bob. You look down for a moment to steady yourself, making sure he doesn't slip out of you.\n\n\"Die, you big mean man! Die! Diiieee!\"\n\n\"What the\u0085You little brat! Just what the hell do you think you're doing?\"\n\n\"I am making you pay!\"\n\n\"Agggh, I'm coming, baby!\" Bob looks a little quizzically at you as you press yourself closer against him, arching your head back in ecstasy as you feel the alien new wetness add to the deluge down below. Then he glances at the television and begins to laugh. \"Heh, I remember that now. I had to pay out of my allowance to get his stupid shirt dry-cleaned, and then deliver it to his house. No wonder you thought he was an ass.\"\n\n\"You have no idea.\" You flop down next to Bob, utterly unsatisfied. He begins to doze off, but you prod him impatiently. The screen turns to snow and a loud static sound fills the room. \"Come on, get going. You can't stay here.\"\n\n\"All right.\" He rolls lazily off the bed and puts his pants back on. \"Thanks. That was fun. Next time without the movie though, ok? There's something wrong about hearing our 8-year-old voices while we're\u0085you know.\"\n\n\"Heh. Some people might find that exciting.\"\n\n\"Right-o. G'night, Anna. Thanks again.\"\n\n\"Bye.\"\n\nYou barely take notice of him putting on his coat and walking out the door because you have rewound the tape to that spot again.\n\n\"Target has been visionized!\"\n\n\"Yeah, Bob, be my fucking hero and nail that fuck.\" Your hand reaches down to your drenched pussy, stroking lightly under the lips, then a little more urgently as Bob makes his brave ascent up the grassy summer hill. Seeing Frank, you begin to furiously rub at yourself, as though you were attacking an impossible stain. \"Get him! Get that fucker!\" The water gun shoots off a long stream at the American Poet's pretentious suit jacket. \"If only those were real bullets! If only\u0085\" Your vocal chords constrict into silence as you arch your back up in an ecstatic agony that seems to erase time and place, suspending you in that one crucial Truth. Feeling under you, your hands wipe at your soaked down comforter.\n\nUtterly spent, you fall asleep to the sounds of snow and static as the tape again reaches its conclusion.", "action_results": [{"action": "Dream", "result": "At dawn he came in. The sun that summer, he sat down on the edge of the bed. He stroked your hair down to your shoulders and your warm little body, warm in that early summer sun. Your stuffed animals sat around at all corners, watching impassive as the sun was eclipsed by a shadow. A hand clasped over your mouth, it smelled like, it smelled\u0085\n\n\"Anna, open up the door! Open up!\"\n\nThe gentle snapping of the old door lock in your old house that was a hundred years old.\n\nStillness, his hand was still there. The pattern of your ceiling was irregular like a sandy beach, a shell here a shell there, scattered all around it swirled in circles whenever he\u0085\n\n\"What's going on in here? What are you doing to Anna?\"\n\nThe pavement outside, the averted eyes, the swirling ceiling that stayed the same through all of it. Mom's eyes were the only ones that didn't turn themselves away from you, Mom's brown eyes, Mom standing at the corner waiting for you on your tricycle, a summer before that summer when the sun was eclipsed by\u0085\n\nAnd then he was gone. And so was he. And so was he. They were all gone. Sitting in the empty kitchen, on a summer day during a summer after that summer when John came in. The first time you, well no, not the first time. The swirling sand was the same on that day too, it never paid attention to you, you could dive into it all those times when the eyes were turned away from you and then\u0085\n\nMom waking you up in the morning. It's time to go to school. The coffee wafted its way up but you couldn't smell it, on the beach alone with the wind blowing and the emptiness of the sea before you...\n\nStirring in bed, you find your eyes are already open. A shadowy moonlight makes the crevices of your old ceiling look deep and cutting. You want to avert your eyes, but you can't move your body. An oppressive heaviness stamps itself slowly into your chest. You wait. You move your hand up towards your throat. You've been released. As though to escape the demon that has been holding you down, you defiantly swing your legs over the side of the bed and stand up, thinking about the empty beach that never changed, the cracks in the ceiling that are deep and cutting\u0085\n\nYour Swiss Army knife is sitting on the edge of your desk. Flipping the blade up, you stand in front of your full-length mirror. You gaze at your beautiful face, at the smooth softness of your skin, at the long catlike eyes whose green shines iridescent in the early dawn light, at the full lips. Did those same lips actually do that yesterday? Beauty seems strange and unreal.\n\nWithout further ado, you bring the blade just under your cheek bone, trying hard to remember this image that will never again appear on Earth. You force the knife deep into your skin, and sensing that your trembling hand will soon betray you, you rip it downwards in a single, strong motion. Something stings at the edge of your lip. The knife drops out of sight. A single red dot expands to fill your vision as you fall to the floor.", "action_results": [{"action": "Enter the good doctor stage left", "result": "Anna O.\n24 yrs, female\n5'5\", 123 lb\nStudent\n\nPatient transferred directly via ambulance from Massachusetts General Hospital. Presented with self-inflicted laceration wound to the right cheek and upper lip following apparent psychotic breakdown. All decisions for further care to be made by Proxy (biological father) until further evaluation can be made. Referred to Dr. Douglas Morton for further\u0085\n\nThat's me, Doug Morton. I still get a little kick out of seeing my big important doctor title because medical school was something like an accident. I got married too young, I had kids too young, and then when the shit was hitting the fan at 26 and I was sitting there with my dad's Colt pointed at my temple, I figured, well hell, why not go to med school? So that's what I did. I got accepted into a barely accredited chopshop and only scored a decent job later because I was still young and I knew how to work people long before I got my useless psychiatric degree. I found my niche, I divorced the dog I had married, and left my kids in Indiana to return to my hometown of Boston. Back on the Charles, I was hoping to find some peace of mind, but that became impossible the second I laid eyes on Anna O.\n\nShe has a great body by anyone's measurements, but I've seen lots of girls with great bodies (and fucked a few of them too!). It wasn't her body that put the clipboard in front of my pants. It was her inner woman thing. She smells like a wild animal. I can tell already I'm in for a lot of pain treating her. But I can't resist her. If any other doctor tried to take over her case, I already know I'd chop off his nuts and feed them to him on a bed tray.\n\nBut back to business. We weren't able to get much relevant information out of Anna's unimpressive father. All we know is that Anna was a standout student and was studying philosophy at a prestigious graduate program out of state when she received the news a few days ago from her brother, John O'Hagerty, that their mother had been killed in a motor vehicle accident on the VFW Highway in West Roxbury. Anna and her mother seem to have been very close, unlike the chilly vibes I get from Daddy Dearest concerning his daughter. When probed further about O'Hagerty family ghosts, we were told to \"mind our own business\". Seems the bastard's got something to hide. The brother was even less helpful. I am confident that I'll eventually find out everything I need to know from Anna herself.\n\nAnna O. has a large gash on her cheek, stitched up tight. The swelling on her lip has gone down, but she will always have a scar from this incident. I can't look at her and not see the scar. It stares me right in the face. It demands to be seen. It keeps her there in my head when I leave the office, drive home, eat dinner, jerk off and dream of nothing but seeing her and her exquisitely damaged face again tomorrow\u0085", "action_results": [{"action": "Tomorrow", "result": "\"So, Ms. O'Hagerty,\" Dr. Morton begins, raising one amused eyebrow at you, \"What can I do for you today?\"\n\n\"You can go fuck yourself, for starters.\" The steady stream of painkillers is beginning to wear off.\n\n\"Okay,\" he says, sitting back in his chair and zipping down his fly. \"Remind me,\" he says grinning.\n\nYour jaw drops in disbelief. You look away, wondering if anyone would believe you if you told them what just happened. You turn back to him. Dr. Morton isn't a young man, but he's not old either. There's something vaguely wolf-like about him, yet his eyes seem to be two endless wells of amusement.\n\n\"Okay, you have my attention. What do you want?\"\n\n\"Well, I'm a psychiatrist and someone seemed to think it unusual that a beautiful young woman would want to cut her own face off.\"\n\n\"And what do you think?\"\n\n\"I'd have to know her story. All I know about you is that you're from an old Irish-American Boston family, you're gorgeous, you're smart, and something has gone really wrong in your life. Your dad and your brother wouldn't talk much, so I'm going to go out on a limb here and postulate that there are some issues in your family.\"\n\n\"Figured that out all by yourself, did you, Sherlock?\"\n\n\"Yes I did.\" He leers close to you with a stethoscope. Before you can object, he has reached one hand around your back, resting the other near his still-open pants. Having completed this dubious examination, he gives you a barely perceptible squeeze, then pushes away from you abruptly, zipping up his fly and looking distractedly at his watch.\n\n\"That's all there's time for today. It was nice meeting you, Ms. O'Hagerty.\"\n\n\"What sort of\u0085\" The smile on your face is composed half of amusement and half of irritated confusion.\n\n\"Ah, my methods, you mean. I'll confess they're a little unorthodox, but then again I never did buy into that psychobabble bullshit. You and I are going to have fun together, and I guarantee you, you will feel better by the time I'm done with you.\"\n\nHe extends a hand to you, crushing your bones in his shake. You wonder what it would be like to have him on top of you. Would he be just as rough then? You rather hope so.\n\n\"If you pull another stunt like that one,\" you say steadily, indicating toward his crotch, \"my face won't be the only thing sliced to shit.\"\n\nHe raises two amused eyebrows at you, pulling out his clipboard. \"Duly noted,\" he says. \"Until next time, Femme Nikita.\"\n\nThe smell of coffee lingers after him. You brush your hand down to rest over your lower abdomen. Your whole body feels nervous and alive. His hands alone seem capable of obliterating everything: the wanting and tingling, the pain, the thoughts, the past, all of it. You are surprised to feel an enormous sadness come over you, even as you are indulging in racy thoughts about Dr. Morton. You feel as though he has penetrated to something vulnerable in you. You feel angry that he has immediately established a sexually tense relationship with you. Isn't he supposed to be your defender? Isn't he supposed to be helping you, not just repeating what happened when\u0085It's wrong, it's just wrong. He should be fired for this. And yet, you know it's probably right. You don't know how or why, but you decide in an instant to go along with whatever it is he has planned for you. His unusualness attracts you, and certainly all the tried and true paths have failed you miserably.\n\nAnd he called you gorgeous. He saw you for the damaged thing you are, yet he thinks you're beautiful. Despite all your capacity for higher functioning, you find this to be the most pleasant thought you have had in months. Giving into it, playing along its edges, you let it lead you into a heavy sleep.\n\n**********************************\n\nCompleted initial interview with Anna O. Patient is stable and coherent. Patient is young and supple. Patient needs a thick piece of\u0085\n\nIt's getting late. I need to go home soon. But Jane is at home. She is such a kind woman. She is everything my ex wasn't. But I can't get Anna's threat out of my head. When she told me she'd cut my balls off, I think I believed her. She's fierce, yet injured. She's hardly original in the psychological world. Promiscuous and chaotic, bravely determined, she's an upscale case of the aftermath of real trauma. No, she's not new to the psychological world-but she's new to my world. And I mean to keep her there for awhile. There's something about her\u0085she inspires the basest of reactions. You want to fuck her or kill her or both. I know enough about myself to be fairly certain that I will do neither. However, I can see already that she will need a violent sort of therapy if there's to be any hope of recovering her mental health. I don't think I could live with myself if I destroyed her in the process. But I want to break her. I want to fuck her so hard, she splits in two. I want to dash her brains out on a rock so those terrible eyes can't keep challenging me, can't keep seeing me for what I really am.\n\nI'm a repulsive man.\n\nGet back to work, you dirty old Humbert\u0085\n\n**********************************\n\nStatus report: much has been illuminated in the case of Anna O.\nThe following are a series of interviews held with Anna at this inpatient facility between October and December of the current year.\n\nCase Notes:", "action_results": [{"action": "Anna's Psychological History", "result": "\"We had your medical records transferred from the person you had been seeing at school, a Doctor, uh\u0085\"\n\n\"Fay. Doctor Fay.\"\n\n\"Yes, Dr. Fay. Man or woman?\"\n\n\"Woman.\"\n\n\"Is it true what they say? Did you feel better understood by a woman than you would by a man?\"\n\n\"No, not at all. In fact, sometimes I think I'm too masculine for a mere woman to handle.\"\n\n\"That's very interesting,\" Dr. Morton says with a half-laugh, noting something down on his blank pad. \"So what was she treating you for?\"\n\n\"She didn't know exactly.\"\n\n\"Also very interesting. If you could diagnose yourself, what would you say you had?\"\n\n\"I'm a megalomaniacal sex addict with violent tendencies.\"\n\n\"Ok, I'm beginning to see why she mentioned that you, how did she say it\u0085'dodges serious discussion with witty banter'.\"\n\nYou make a display of yawning.\n\n\"I thought you said that we were going to do something different than the usual shrink crap.\" Saying this out loud makes you taste the real disappointment that you have been feeling since he walked in the door. Dr. Morton hesitates for a moment.\n\n\"Get up,\" he commands.\n\nYou do as he tells you.\n\n\"Stand here.\"\n\nAgain, you follow his orders.\n\nHe grips you by the chin, pressing his thumb hard into your stitches. You wince and try to free yourself, but he has you in another bone-splitting bind with his other arm. He brings his face very close to yours, smiling triumphantly. The pain in your face fills up your entire head, making thoughts feel blurry and words turn in circles.\n\n\"I'm going to ask you some very direct and uncomfortable questions, and you are going to answer them. The more honest you are, the quicker this will be over. Ready?\"\n\nYou nod. He relaxes his hand slightly, enough to allow you to speak but also enough to make him impossible to ignore.\n\n\"Did you love your mother?\"\n\n\"Very much.\"\n\n\"Do you love your father too?\"\n\n\"Not really.\"\n\n\"Why not?\"\n\n\"Because he wasn't there for me.\"\n\n\"When wasn't he there for you?\"\n\n\"When..during the\u0085when Uncle Frank...\" You can't continue.\n\n\"Who's Uncle Frank?\" Your eyes tear as you revive your efforts to get away from Dr. Morton. He holds you fast. \"We'll come back to that later. How about your brother John? What do you think of him?\"\n\n\"He betrayed me too,\" you whimper, letting your tears fall freely from your eyes, onto Dr. Morton's hand, down to the floor. \"He\u0085he saw it all, but now he barely talks to me.\" The grip on your face relaxes. You close your eyes as the warm back of a moistened hand strokes your cheek.\n\n\"Where is your family from originally?\"\n\n\"Ireland.\"\n\n\"When did they come to Boston?\"\n\n\"At different times. On my mom's side when they ran out of potatoes.\"\n\nHe laughs gently, running his fingers up the length of your scar. You gasp slightly as an unexpected contraction tightens deep inside your body.\n\n\"Are you attracted to me?\"\n\n\"Yes.\"\n\n\"Why did you hurt yourself?\"\n\n\"I thought my body was too perfect. It didn't reflect what was inside.\"\n\n\"Did doing what you did make you feel better?\"\n\n\"No, not really.\"\n\n\"Did you ever do anything like this before?\"\n\n\"No.\"\n\n\"But haven't you slept with lots of men?\"\n\n\"How would you know?\"\n\n\"Because I've seen your type before.\"\n\n\"My type? What the fuck are you talking about?\" You stare angrily at him, and he responds in kind by reinstating his death grip on your waist and your face. You cry out in pain.\n\n\"Do you think you sleep around for the same reason that you cut yourself?\"\n\n\"No, that has nothing to do with it! I fuck people for revenge, you stupid asshole.\"\n\n\"Revenge for what, my dear? For what Uncle Frank did to you?\"\n\nUnable to control yourself any longer, you twist out of Morton's grasp, pushing him away from you with all your might. He stumbles backward a couple of feet, his lower back crashing into the edge of the examination table. His face twists in pain, an expression that changes imperceptibly over the next few seconds until you realize with a shock that it has transformed into a look of utter exultation. He breathes heavily, staring at you with fever-wet eyes.\n\n\"Thank you,\" he says, gripping the table for balance. \"Was that as good for you as it was for me?\"\n\nYou just stare back at him dumbfounded.\n\n\"And now I know where we stand. Next time will be quite different, I assure you. Hope that wasn't just more boring shrink crap.\"\n\nWithout another word, Dr. Morton leaves the room.\n\n**********************************\n\nHad a most illuminating conversation with Anna O. today. Her history is almost certainly one of serious abuse. She exhibits signs of PTSD and also seems to suffer from dissociative episodes. There is a possibility for a further diagnosis of Borderline Personality, but this and her dissociative symptoms are understood as secondary effects of her trauma, which I believe is the result not of her mother's death but of the abuse she has suffered at a presently unknown time in her life\u0085\n\nSpeaking of abuse, I need to go home and severely abuse myself or I am gonna fucking explode.", "action_results": [null, {"action": "Proceed to the Final Act", "result": "You open the office door cautiously. You knew there had to be more, yet you had found yourself hoping that Dr. Morton would cap it at your last meeting. Hadn't progress been made? Certainly there was progress, by anyone's modern standards. For the first time in your life, you fully confided in someone. You had never been able to trust your family, your friends, or even your priest, not with the whole story. The thing was partial and scattered, manifesting as nothing more than a vague shadow hanging over you, illusory enough to be attributed to mere imagination. But Dr. Morton knows everything now. Isn't that enough? Isn't that what people are expected to content themselves with? Isn't it greedy, or even dangerous, to ask for more?\n\nLavender curtains hung from four moveable frames form a loose rectangle around the hospital bed that now sits in the center of the room. It is made up as though it were a real bed, with striped sheets and a white summer blanket.\n\nUnder the thin white blanket...\n\nThen he appears from behind the furthest curtain. He is wearing small metal spectacles and has shaved clean the face that he normally allows to be speckled with gray-brown stubble. His head is likewise bare, his unaccustomed baldness shining too brightly under the garish fluorescents. He is wearing a loose vest over a plain white tee-shirt that he has tucked into an old pair of khaki pants. He is barefoot.\n\n\"You must know that you look a lot like...\"\n\n\"Anna, please get changed into these. Do not leave your underwear on.\"\n\nFrom behind the curtain he pulls a set of pink cotton pajamas. After handing them to you, he turns to face the wall.\n\n\"Ok,\" you say when you are wearing your new outfit. You know better than to ask questions.\n\n\"Lie down on your back under the covers,\" he commands.\n\nYou do as you are told. He turns on the lamp on top of a little makeshift nightstand next to the bed, and also a torchiere looming out of sight behind one of the curtains. Then he shuts off the overhead lights, casting the room into a natural glow that immediately relaxes you as you rest under the covers. You could almost fall asleep.\n\n\"Anna, listen very carefully to me,\" he says. His voice sounds strange and distant. \"My name is Frank O'Hagerty. I am forty-two years old and I am a writer. You are Anna O'Hagerty, my niece. You are seven years old and you are asleep in your bedroom. It is early in the morning on a summer day. You are dreaming. Think now of your dreams.\"\n\nThe sun that summer, soft like ladybugs and flowers, the door opens softly in the breathing morning\u0085\n\nYou hear the door opening, quiet footsteps to your bed.\n\nThe sun that summer, he sat down on the edge of the bed\u0085\n\nA pair of rough masculine lips comes down clumsily on you. Opening wide, they take in your face hungrily, his mouth breathing into yours. Sourness injects into your nose, mouth and throat making you gasp. You open your eyes to stare directly into the eyes of Uncle Frank. He smiles at you, stroking your hair gently.\n\n\"You're my beautiful angel, so perfect in every way. All I want is to worship your perfection.\"\n\nHe stands back from the bed, never breaking his eyes from yours as he pulls off first his glasses, then his vest and his shirt. From within the loose folds of his pants pocket, he pulls out an immaculate black hunting knife, placing it carefully on the table before removing the last of his clothing. He stands still for a few seconds, becoming somehow larger in his nakedness. He strokes his penis gently.\n\n\"Did you know, Anna, that being touched here feels as good for me as it feels for you when I touch you? I'm touching myself because it feels good, and there's nothing wrong with feeling good, don't you think?\"\n\n\"Uh huh.\" The voice escaping your throat presents itself in an unknown key. You look around the room as though to ascertain where it came from. You see nothing but the light shining through your lavender walls. Uncle Frank's shadow moves into the light, hunching low as he sits down very near you. Your shadows mix into a single strange form as he takes your hand and draws it slowly towards his erect penis.\n\n\"I want you to touch me, Anna.\" Your hand locked in his, you try to pull away, but he grips you tighter, swallowing hard as he says, \"Be a good girl now. It would be very selfish of you not to make me feel good when I have made you feel so good. Don't you think that would be unfair? Yes, Anna, that's a good girl. Just like that, oh just like that, my little angel. You're so special, you can do it so much better than I can. Oh god, Anna! I want to make you so happy. I want to do something even better for you. Are you ready for the best thing in the world?\"\n\nHis eyes turn glassy, his sour breath stinging your face as he leans closer to you. He gets up abruptly, ripping two towels out of his bag on the floor. He stuffs them roughly under your hips. He silences your quiet whimper with a hard hand over your mouth.\n\n\"Shut up or we won't be able to feel good. I thought you were a good girl.\"\n\nHe pulls your body up towards him, lifting you off the bed as he yanks at your pajama bottoms. His monstrous hands glowing hot and sweat-streaked, he tears your shirt off in a single sharp motion. He pushes you roughly back down, pinning your shoulders to the bed with all his strength. You try to shake yourself free, but his arms are like two great columns pressing you further and further down into the rigid earth. The next moment he is on top of you. His bruising penis bumps clumsily against your legs, traveling up, up\u0085\n\nThe pattern of your ceiling was irregular like a sandy beach, a shell here a shell there, scattered all around it swirled in circles whenever he\u0085\n\nBut wait, it's not like that here. The ceiling here is flat and white. Just as the windswept beach opens its alluring vista to you, it shuts suddenly, abandoning you to the reality of that enveloping rancid breath and all around the emptiness. Nowhere, no one to save you, in all corners nothing, no one who will\u0085\n\nYou turn your head away, instantly seeing the knife lying on your nightstand. You immediately reach out for it.\n\nHis face is buried deep in your chest. He doesn't see what you're doing. You reach again. He grips you tighter, crushing your ribs in his claws.\n\nAnd then you have it in your hand.\n\nYou bring the knife down in a wide blind arc, not seeing where or how but just knowing that you are. A shrill scream rips through the early morning. Feeling the free air rush up to greet your bruised skin, you scramble quickly to your feet. Looking down, you see Uncle Frank writhing on the bed, the blood running copiously from his shoulder, marring the soft white summer sheets. He cries out in pain and confusion, looking for something\u0085\n\nBut it is in your hand again. Hoisting the knife high in the air, you scan his body. You notice that his penis is still hard.\n\n\"You fucking pervert. I'm about to fucking kill you and all you can think about is your sorry little prick. I will take that off first so you're forced to think of something else when you finally die, you fucking animal!\"\n\n\"You're right, Anna. I deserve it.\" His eyes are filled with tears that turn bloody as they run down the length of his slumped chest. He makes no effort to resist you.\n\nYou hesitate for a moment, bringing the knife very close to the tip of his penis. You look up expectantly at him.\n\n\"Aren't you going to beg or something, you pathetic piece of shit?\" His silence angers you and your knuckles whiten as you easily split open a little line of flesh on the edge of your blade. His cry is sharp and sudden, but he covers his mouth with his hand, letting the tears fall silently all around him.\n\n\"I'm sorry. Oh God, Anna, I'm so sorry!\"\n\nThe knife trembles in your hand as you stare at the transformed creature before you. Never in your life have you heard an apology as genuine as the one that has just been spoken.", "action_results": [{"action": "It's too late for apologies", "result": "\"Killing you makes me feel good, and there's nothing wrong with that, right?\"\n\nIt's almost too easy burying your knife up to its hilt in the spongy flesh of his testicles. He lets out a wild scream on top of a strange variety of other noises, but you have ceased paying any attention to him. You are fascinated by the smooth river of blood that zigzags across the sheet as he tries desperately to pull himself away. You cup your hand under his balls until your fingers are soaked in blood. You rub your hands all over your face, letting the blood drip into your eyes and down into your mouth. The taste makes you crazy for more. You begin to stab a little here, a little there, until there are several small fountains all over his chest and abdomen. He tries his best to push you away, but you knock him easily to the floor. Landing hard on his back, you pounce on him immediately, hungrily lapping up the shining candy drops all over his body.\n\nLooking down at his cock, you are amazed to see that it is still half hard. The fast jerking motion of your hand on his bleeding member renews his screams, which fill the room so fully, you can barely perceive them. Deftly wielding the knife, you make little cuts all around the length of it until the blood runs freely. You smile in triumph as you prepare for your crowning moment of achievement.\n\n\"Are you ready for the best thing in the world?\" you taunt him.\n\nYou imagine all that blood filling up your pussy, hot and wet and sticky just like that nasty fuck wants it. You see the blood filling up your pussy, filling up your whole being.\n\nYou hear the snapping of a lock and suddenly the door flies open. A rush of cold air stabs you in the back as several strong hands pull you away from your prize. You howl with rage as you watch Dr. Morton crawl into a corner, leaving a wide slimy trail in his wake. You manage to free one stained hand, thrusting it deep into your cunt. The blood is almost dry. You need more! You struggle again toward that glistening heap on the floor, but your efforts are cut short when you feel the sharp sting of a bee on your neck and the world rapidly fades, passing through white on its way into black.\n\n**********************************\n\n\"Hi, Anna. I brought you your favorite smoothie.\"\n\n\"Cherry. That's my favorite.\"\n\n\"Yes. I can't stay long, but I wanted to tell you that I got engaged to be married.\"\n\n\"Really, John? Is she pretty?\"\n\n\"You know her, Anna. She's been here before.\"\n\n\"I know that.\"\n\n\"And, uh, we'll come around for Christmas again this year.\"\n\n\"You're crying.\"\n\n\"It's just that\u0085she's pregnant. She's going to have a baby and that's going to make me a father.\"\n\n\"But aren't babies supposed to be nice?\" You stare placidly sideways, through the very thick windows, out into the courtyard where there is lots of snow. You like the snow, but they never let you stay in it for long.\n\nJohn answers your question, but you've stopped listening to him. You are enjoying your smoothie too much to care. You're not sure exactly what it is, but there's something about the deep red color that you find incredibly appealing.", "action_results": []}, {"action": "Put the knife down", "result": "The knife clatters to the floor as you try desperately to make sense of what is going on. The cut on his shoulder looks deep and painful and you can see the struggle in his face as he attempts to smile at you. Somehow, he manages to stand up. Bending over very carefully, he steps into his pants. He ties one of the towels around his shoulder before shakily replacing his shirt. He hands your clothing back to you, calmly waiting for you to get dressed. He motions for you to take a seat next to him.\n\n\"Anna, I have hurt you and there is nothing I can ever do to take that away. But today you have done something very important that you will carry with you for the rest of your life. Now go. You're already free.\"\n\nYou stand up on shaky legs, making your way slowly to the door. You pause with your hand around the doorknob. You turn back to him.\n\n\"I forgive you,\" you say, and leave the room.\n\n**********************************\n\n\"Can you believe what happened to poor Dr. Morton? It's just lucky he was near a hospital when it happened. Imagine getting attacked in broad daylight like that!\"\n\nYou shake your head sympathetically, biting at your cheeks to suppress your smile. The wide-faced young nurse looks to be about your age. You think you could have become friends if you were staying in Boston. But San Francisco calls.\n\n\"Just sign there and you're all set to go,\" she instructs you, diverting her eyes to the soap opera on the TV above you. You sign your name, smudging the last letter a little. You thank her and walk out the door without looking back.\n\n**********************************\n\nMy Dearest Anna,\n\nThis is a letter that I will never be able to send. But that's all right, because I think you already know everything that I want to say to you. So I will keep it very simple.\n\nFirst of all, I love you. I love you and I will always love you.\n\nI stayed for a long time in the room after you had gone. I could imagine myself as you, lying in your bed on that warm summer morning. You sacrificed your innocence so I could reclaim my own. I don't deserve this gift, Anna, but I humbly accept it.\n\nI never believed in anything until you. I still can't put it into proper words. I have it all in my heart, but when I try to put it to paper, it sort of dries out and changes into something much smaller than what it really is. Perhaps this is as it should be. The real truth, and the real mystery, can never be expressed in mere words. I love you. That is the only phrase that even comes close.\n\nI'm a different man now, living a different life. I look at everyone around me, and they're different too. The shadows are gone from my eyes and for the first time, I can see people clearly.\n\nThank you, Anna, for everything.\n\nYours forever,\n\nDoug Morton", "action_results": []}]}]}, {"action": "Anna's Sexual History", "result": "Anna O. and I have something very interesting in common.\n\nWe both love to masturbate.\n\nFor as long as I can remember, I have started every morning with a good wank. I used to do it in bed because it's more comfortable there, but Jane found that objectionable so I took refuge in the shower. I have a great cock, longer than average and super thick. I just turned 45, but thanks to a flawless diet and a shitload of yoga and cycling, I stay rock-hard for as long as it takes to make her scream\u0085or make me scream. I love watching how the veins get all stressed and tense, just like my face when I'm angry. Sex is an angry act, and anyone who says otherwise is deceiving themselves. It's certainly an angry thing in the morning, standing there in the shower, ready to put my fucking fist through the wall as all those memories come flooding in, back in Indiana that cheating two-timing bitch and\u0085I spray the shower low and high with my seed. I watch as it mixes with the water, washes down the drain, reassures me that I am in fact nothing and therefore don't need to be troubled.\n\nAnna brought up the subject before I did. She saw how my hand kept resting on my crotch and made some crack that my doing that reminded her of her father, whom she of course hates.\n\n\"Actually, it was just there because it was there. Nothing sexual intended.\" Liar. I am a liar. But I wanted to draw her out. \"I see there's something in it for you, though. Did you want to talk about it?\"\n\n\"What is there to say?\"\n\n\"Don't say anything.\"\n\nAnd with that, I unzipped my fly for the second time in our professional collaboration. Feeling the cool office air and seeing Anna there in all her pale splendor, my Little Bighorn stood right to attention. She couldn't do anything but stare at it. I swear I saw her hands twitching. She wanted to reach out and grab hold, stick it in her mouth and thank me profusely when I slapped her across the face with it. She sat in all her moving stillness, staring, just staring down in a state like physical suspension. As much as I wanted to fly across the room and nail her to the spot, I exercised my amazing self-control. I channeled all that sex fever into my shaking right hand, which I began to run very gently up and down my shaft. Speech was next to impossible, but I did manage to say,\n\n\"Get going on yourself and we'll continue our conversation.\"\n\nShe licked her chops once more at the sight of my cock, but since she is likewise a creature of amazing self-control, she managed to shimmy her way down to her back, dropping her pants off the side of the examination table. She turned her face toward me once, as though to make sure that the whole thing were not an illusion that would soon prove embarrassing for her. Seeing that I had not changed that gradual stoking, she reached down under her panties to do likewise. I was amazed at how gently she touched herself, this girl so filled with violence. Another Anna revealed itself as her fingers seemed to write a secret message in her flesh. A soft Anna, an Anna that would kiss rather than bite, an Anna that might even be capable of trust. Reassured in my methods and inflamed by that heavenly vision, I began to pull harder at myself.\n\n\"Tell me, Anna\" I said, \"How long have you known how to pleasure yourself?\"\n\n\"Since I was three or four,\" came her quiet answer.\n\n\"And what did you first imagine while you were doing it?\"\n\n\"That I was a deer being hunted, like Bambi.\"\n\n\"And did you ever get shot?\"\n\n\"Always, that was always how it ended.\"\n\n\"Interesting. Did anyone ever see you while you did this?\"\n\n\"I often touched myself in public. I thought it was natural.\"\n\n\"It is natural.\" Looking at her, I could see Anna's cheeks were bright red, her back arched, her eyes shut tight and straining bravely towards recollection.\n\n\"Do you like to get fucked, Anna?\"\n\n\"Oh God yeah.\" The speed of her hand increased, a change that I gladly matched in my own efforts. I wondered how much longer I could last. I wasn't in control anymore; it was all Anna. Everything is all Anna.\n\n\"Tell me how you like to get fucked.\"\n\n\"I like it hard and rough and impersonal.\"\n\n\"Yeah? Do you like the sight of a big hard cock?\"\n\n\"Fuck yeah.\"\n\nI could tell from her voice she was almost there, but there was still something missing from the equation. I hadn't found what I was looking for yet. We were both about to run out of time, so I asked her the following question:\n\n\"When was the first time you laid eyes on a man's hard cock?\"\n\nAt this her hand froze suddenly, paralyzed within her delicate sex. I waited breathless for her response.\n\n\"When I was seven years old,\" she murmured, staring up at the ceiling.\n\n\"Did it hurt?\"\n\n\"Yes.\"\n\n\"Did it hurt a lot?\"\n\n\"Yes!\" To my surprise, she began clawing at herself with both hands, twisting in all directions as she screamed, \"It hurt worse than anything you could ever imagine! It hurt! It hurt! It hurts!\"\n\nMy hand hesitated to take up the battle again, but I needed to stay on Anna's otherworldly level. I began furiously jacking off, seeing visions of violent assaults and everywhere, everything devastated by fire. Hot and heat, I could feel my shirt soaked through with sweat. As I imagined her getting raped, I again had to hold back from tackling her there on the bed, from proving that I could do it better than he did, harder than he did, crueler than he did.\n\n\"Pain, Anna. Fuck the pain! Fuck it hard!\"\n\nAn inhuman sound filled the room as we both disappeared into our own worlds to finally reach that lonely summit. I fixed my eyes on her, on the thought of her little cunt pounded into a bloody mush. I choked silently on my breath, quickly pulling out the Kleenex that I keep in my pocket for just such occasions. I had achieved my goal.\n\nAnna lay curled up tight on the bed, facing the wall with both hands covering herself protectively. She was crying audibly and I could feel my heart breaking as I looked upon her. I wanted to stroke her hair lightly as I had so often done for my own daughter, whispering my love into her ear. But Pandora's Box stood open in all its cruelty and would have to remain that way until a resolution could be\u0085yes, at any cost, a resolution. I quietly fastened my pants, wiped my brow and covered my guilty body with my lab coat.\n\n\"Ok, Anna,\" I said coolly. \"That's all the time we have for today.\"\n\nAnd I left the room.", "action_results": [null, null]}, {"action": "Anna's Uncle Frank-Part 1", "result": "Her face was paper-white and haggard when I came in to see her today. She sat huddled deep in a chair, looking at me with the round eyes of a frightened animal. But wonderful, brave thing that she is, she still managed to tell me off with the last of her defiance,\n\n\"If we repeat what happened last time, I won't survive. You can't do that to me again.\"\n\n\"I wouldn't dream of it. Today will be much easier for you.\"\n\n\"It will?\"\n\n\"Tell me, Anna, have you ever been hypnotized?\"\n\n**********************************\n\nYou don't exist except in the question. You contemplate the question and all the things that the question touches. That is all there is. It's effortless, really, answering a question to which you know the answer. Your voice is strong, even, easily telling the truth that you know so well.\n\nA voice has just asked you to describe what happened the first time Uncle Frank snuck into your bedroom.\n\n\"It was summer. I was seven years old. Uncle Frank was staying with us because he was writing a book that took place in Boston. He liked me a lot. He always told me I was pretty and brought me my favorite candy, even though Mom didn't want me to have it. He came into my room. I was sleeping. He woke me up by touching my face. He told me I was pretty. He also said I was an angel. He stroked my hair and it felt good. He said that there was nothing wrong with feeling good. Then he pulled back the covers and started to rub my tummy, which made me giggle. He giggled too. Then he put his hand down lower and he asked me if I ever touched myself there. I told him that Aunt Fiona got real mad at me once when she caught me doing that on her living room couch. He laughed again and said she was stupid, which made me happy because I hated her. Then he started rubbing me down there and asking how it felt. At first I couldn't answer him because no one had ever asked me that before. Then I said that I thought it was nice. He agreed that it was nice. He kept rubbing and rubbing until I had an orgasm. I had had them before, but never in front of anyone. I felt embarrassed, but he said there was nothing wrong with that either. He said it was the most beautiful thing in the world, but that we were the only people who knew it, so we couldn't tell anyone our secret.\"\n\n\"When did he come again?\"\n\n\"A few days later. He shook me awake and his face was all puffy. He asked me if I wanted to have fun again and I said yes I did. He said he had something new to show me. He pulled back the covers like he did the first time. But this time he pulled my pants all the way off. He touched my vagina again. He rubbed it and tickled his fingers around inside a little. Then he pushed me up toward the head of the bed. He was excited and kind of rough. He didn't seem to notice when I hit my head against the bedpost. He lay down on his stomach and he pulled the cover up over him and over me. He pulled it back for just a second to make his silly monster face at me. I giggled, but he said I couldn't giggle or we wouldn't be having any more fun. I wanted to have fun. When I first felt that he was licking my vagina, I couldn't believe it. I told him that my vagina was dirty. He said that it wasn't dirty, that it was the most beautiful thing in the world and that it tasted good too. He reached his hand up and told me to taste it. I did and I thought it wasn't that bad, but I couldn't understand why he liked it so much. He kept licking me and licking me. It felt so good, like nothing I had ever felt before. This time when I came, he bit down on me. I screamed and he slapped me in the face. He told me that I had just ruined everything and that next time, no matter what happened, I would have to be absolutely silent. If I wasn't silent, then I would be very sorry.\"\n\n\"Did your parents suspect anything at this time?\"\n\n\"No, but I remember I started acting up a lot. I thought then that I hated them because they didn't want me to feel good. I wished that Uncle Frank would take me away so we could just feel good all the time.\"\n\n\"What happened the third time?\"\n\n\"He came in like he had the first two times. He woke me up by kissing my mouth and I remember thinking that his breath smelled bad. He stroked my hair a lot and said all the usual things about how pretty I was and how I was an angel and he wanted to make me feel good because I was so perfect. This time he took his own pants off first. He wasn't wearing any underwear. I had seen my brother's penis before, but Uncle Frank's was different because it was pointing up toward the ceiling and he was touching it a lot. I asked him if touching himself like that felt the same as when he touched me. He said I was such a smart girl. Then he sat down and told me I should touch it too. I thought it was sort of weird and funny-looking so at first I didn't want to touch it. But then he told me that this made him sad because he wouldn't feel good if I didn't touch it. He said it wouldn't be fair if I was the only one who got to feel good and that I was being selfish. I didn't want him to think I was bad, so I started rubbing it the same way he was rubbing it. He started moaning and telling me what a good girl I was and that I deserved to have even more than I had gotten before. He asked me if I was ready for the best thing ever and I said yes I was. He said ok, but I couldn't make any noise or it would stop feeling good and he wanted to feel good. I wanted him to feel good too because he had been so nice to me. He took off all my clothes and got into bed with me. He pulled up the covers and started rubbing me again and told me I should rub him at the same time. We did this for awhile. Then he rolled on top of me. He held himself up with one arm and started moving his penis with his other hand so it hit up against my vagina. Then he said a bad word and got up and opened up a bag he had brought with him. He took out a couple towels which he put underneath me. I wanted to ask him why he did that, but he put his finger to his lips and got back in bed. Then he took his penis and\u0085\"\n\n\"Stop.\"\n**********************************\n\nYou shake your head, looking around the familiar office, wondering what has just been going on. You feel that something strange is happening. Then you see him.\n\nDr. Morton is doubled over the trashcan in the corner vomiting violently. His face is red and though you can't quite see it clearly, you think he is crying. A lot. He moans, clutching his stomach as the sickness rolls over him again and again.\n\nFinally, there is silence in the office. The air feels stale and heavy, and when Dr. Morton finally turns around to face you again, you have a strange sensation\u0085like decades have passed, his eyes are so haggard and his face paper-white\u0085\n\n\"If that happens again,\" he tries to say, but it comes out as only a whisper, \"I won't survive. You can't do that to me again.\"", "action_results": [null, null]}, {"action": "Anna's Uncle Frank-Part 2", "result": "\"Was your uncle arrested for what he did to you?\"\n\n\"No.\"\n\n\"But you were raped. Wasn't there evidence?\"\n\n\"No.\"\n\n\"Why not?\"\n\n\"Because John came in before he had a chance to do it. When I figured out what Uncle Frank's intentions were, I just screamed and screamed until John came running in. My parents were on Martha's Vineyard that weekend.\"\n\n\"But everything else you told me yesterday! That still counts as rape!\"\n\n\"Yes, but it's the invisible kind. It could never be proven with a kit. Of course we told our parents, and there was a lot of drama in the house, but it never left our four walls. We had so much to lose if we went public and actually tried to prosecute him. My dad's reputation as a cop would be ruined forever. My uncle's career as a famous writer would probably also be ruined. And since I wasn't really raped,\" you say, smiling with a familiar irony, \"then there was no need to take me to a hospital or let anyone outside the family know. It was made clear to Uncle Frank that we never wanted to see him ever again, even though the bastard never had the balls to confess to anything. My brother and I weren't able to talk to each other anymore, and over the years we just found all sorts of excuses for mutual hatred so we never had to break that silence. No one in the family ever talked about it and no one offered me any help. They just assumed I was still young enough to forget about it. They bought me some toys and a new canopy for my bed, and that was that. Mom hugged me a lot, but even she could never talk about it. It never happened.\"\n\n\"But it did happen.\"\n\n\"Yes, well, here I am.\" You smile sadly at Dr. Morton, thinking for the first time that you really do like him as a person. You are seated at opposite ends of the room, an air of sterility limiting your movements, freezing the waves of speech that wash unevenly back and forth. Though you can't remember anything from yesterday, you can see easily enough that you must have told Dr. Morton everything. He will never touch you now.\n\n**********************************\n\n\"Sweetheart, this is Dad. Are you okay?\"\n\n\"Uh, yeah\u0085why are you calling?\"\n\n\"Your mom told me that you were dating a boy in school.\"\n\n\"Jesus, lighten up, Dad. I really don't need one of your lectures right now.\"\n\n\"I'm not going to lecture you. I just need to know one thing.\"\n\n\"What?\"\n\n\"Has he ever done anything to hurt you? Anything at all?\"\n\n\"No\u0085\"\n\n\"Honey, I don't want you to feel ashamed if something has happened to you. You can tell me anything. You know that, right? If he ever does anything at all to you, you need to tell me so I can stop it. I can't bear the thought of anyone hurting you.\"\n\n\"What the hell is wrong with you? Is everything okay?\"\n\n\"Yep. Perfectly fine. Just checking.\"\n\n**********************************\n\n\"There's one thing I still don't understand here, Anna. Why do you take all of your pain out on yourself? Don't you ever fantasize about getting even with this bastard?\"\n\n\"Sure, I used to. All the time.\"\n\n\"What do you mean you 'used to'?\"\n\n\"Well, thinking like that wouldn't do me much good anymore.\"\n\n\"And why is that?\"\n\n\"Because Uncle Frank died of cancer three years ago.\"\n\n**********************************\n\nI can't sleep, I can't eat, I can't look in the mirror. No one is a good judge of his own neuroses, but I don't need my bogus medical degree to see just how deeply affected I am by this case, just how personally responsible I feel for all of it. She has been cheated on so many levels. She's been cheated of recognition for what happened, cheated of her family's support, cheated of any sense of closure or vindication. How can I live in this same world with her and yet fail to fight against such staggering injustices? It is a grave sin of omission and I am one hundred percent guilty. We are all guilty. I actually spat at myself in the mirror this morning. I had never done that before. I had always been rather pleased with myself, or at the very least unmoved by my place in the world. But just look at what horrors men are capable of! I have always known this, yet I never understood it till now. I love her ardently. All I want is to be able to sacrifice my miserable life for her, to be redeemed by her. Frank was a very sick man, but he spoke the truth when he said that she was an angel\u0085\n\nI will be attempting a very risky method to heal Anna O. of her tremendous psychological injuries. This is something that has some indirect precedent in the literature, but is by no means standard procedure. I do not wish to think of the consequences if I should fail. I resort to these essentially desperate measures only because my experience treating this patient has led me to firmly believe that this is the only avenue left to us. Talk therapy is limited by the patient's inability to consistently access extremely painful memories without severe emotional backlash. Drug treatment seems like a likewise myopic approach. (Sorry, Celexa, but this is one instance where I will not be working as your pimp. Keep the commission; I don't want it.)\n\nI have the plan almost finalized in my mind. I can see it already, each detail. It helps to focus on these details because doing so distracts me from the repercussions. I had to ask a few innocent questions here and there, do a little internet research, obtain a photograph or two. However, no one is aware of my larger plan. I am keeping these notes as a testament to everything that I have thought and done, in case...\n\nI am almost ready now to do it. I may refer back to my notes for a few last details, but I know what it is I have to do now. I will do what I have to do. The rest is in God's hands.", "action_results": [null, null]}]}]}]}]}]}, {"action": "Go further afield, to a club", "result": "Lansdowne Street always looks like a ghost town at night, even when it is full of college students and other young people waiting nearly naked in the cold to get into one of several clubs that populate the area. Fenway Park looms huge over the jostling crowds, capping the noise on the street within its limits, leaving the sky above dark and impenetrable.\n\nIt's Ladies' Night at your favorite club. After showing your ID and having your hand stamped, you are ushered into the dark, sweaty space shaking with sound. You eye the dance floor for a moment, then make your way towards the bar at the side of the room.\n\nA group of very drunk frat boys is seated at the bar. They are goosing one another and laughing hysterically. There is not a single girl sitting anywhere near them. They must be from MIT.\n\n\"Hey guys,\" you say, walking boldly up to the group as though you knew them already.\n\n\"Heeeyyy!\" they great you in chorus, one of them harmonizing a melodic wolf whistle into the sound.\n\n\"I'm new in town,\" you lie. \"Will one of you get me a drink?\"\n\nThey all look at one another for a moment, then the one sitting closest to you nods, swinging around unsteadily on his stool to hail the bartender.\n\n\"So\u0085uh\u0085you like dancing?\" the youngest of the bunch asks you, stifling a giggle as he finishes his question, looking you brazenly up and down.\n\n\"Not as much as I like fucking.\" It's out of your mouth before you know what you've said. Appalled at yourself, you smile seductively and shimmy up to the little one, running your hand up his pant leg. His smile melts into a grimace of abject terror.\n\n\"Uh\u0085great,\" he manages, looking to his buddies for help. But they all laugh at him.\n\n\"Don't waste your time on him. He's a virgin,\" says the leader of the group, handing you your drink. Downing it in a single gulp, you come to the conclusion that it is in fact cheap beer.\n\n\"Listen, guys,\" you say. \"I'm looking to have fun tonight. I also need a place to stay.\"\n\n\"We live in a big house!\" the little one declares, having recovered himself. \"But you have to promise us you don't have any uh\u0085pathogenic, carcinogenic, uh\u0085diseases!\" He breaks out into more uncontrollable laughter.\n\n\"Come on, guys,\" you command, nodding your head towards the door. Dumbfounded, they all sit rigid for a moment. Then the group's leader gets up and follows you. Another follows him. Then all four are following at your heels like puppies as you walk out of the club and turn towards the river. They are too drunk to realize that you know your way around too well for someone new in town.\n\n**********************************\n\n\"This is just like that vid on YouPorn!\" the young one squeals.\n\nNot at all unsteady on your feet, you are slowly swaying your hips from side to side. You have already removed most of your clothing and you struggle not to shiver as you move in circles along the inner circumference of the group. Their initial disbelief has given way to sheer excitement. Their logical minds have been sufficiently derailed by alcohol. This is your show now.\n\n\"Wow! Look at those tits!\" one of them gasps.\n\n\"Come on, take it all off!\"\n\nTaking your time, you shake your breasts directly in the young one's face. Bending over in front of another boy, you ask him to slide your panties down your legs.\n\n\"Thank you,\" you whisper, stroking your hand lightly over the seams of his crotch.\n\nYou move to the center of the circle, where there is an old coffee table. Resting on your hands and knees, you gaze back over your shoulder at the leader of the group.\n\n\"Are you serious? Do you? Are you\u0085\"\n\nYou nod in assent. Like most frat boys, especially the ones from MIT, he has an entire drawer full of condoms with potentially expired use-by dates. The other boys watch speechless as he pulls down his pants a bit, easily sliding a lubricated red condom onto his hard member.\n\nThere is a fluttering, breathless silence.\n\nThen you feel it, that first indescribable invasion that feels so good, you spend the rest of the time wondering what you have to do to achieve that same sensation again. The boy has a clue as to what he's doing, and soon he has established a solid rhythm as his pelvis smacks against your ass. He is bigger than you would have thought, and you gasp a little, arching your back like a cat. The rhythm becomes faster, until finally he emits a loud groan, squeezing your ribs tight with his hand, and finally drooping forward on top of your glistening back. Looking around, you see three jaws on the floor, each of them trying furiously to process what has just happened, finding no good explanation for it, trying again to understand\u0085There are three more rock-hard penises that need your attention.\n\nTo your surprise, the little one stands up abruptly as though a geyser had just gone off under his seat. His face is red, almost angry in appearance as he stumbles his way towards you.\n\n\"Okay. Let's just get this over with.\"\n\nA loud applause erupts in the room. His eyes are filled with terror and also something darker that you instantly recognize. You take him gently by the hand.\n\n\"Pull your pants down,\" you whisper. \"Then lie down here.\" You get up, feeling the cold air soothe your sweaty back. Obediently, resignedly, he does as he is told. He looks miserable as you begin to pull at his nervous softness with both hands. Your pussy is full of a syrupy sweetness which hastens your efforts along.\n\n\"There's nothing wrong with feeling good,\" you say more loudly than you need to, beginning to handle him more roughly than you need to. Under your hands, he is trapped. His friends won't help him; you certainly won't help him. He is going to get fucked by you whether he likes it or not. There's nothing wrong with your feeling good. He whimpers a little as you slowly roll a condom down his pencil of a prick.\n\n\"No, wait, stop. I'm a virgin. This is wrong.\"\n\n\"I'm a Catholic too,\" you smirk at him, and again the room explodes with far-away laughter. He is actually beginning to cry as you finally manage to mount him. \"Remember this moment,\" you whisper, lowering yourself carefully over him. He gasps, twisting his face this way and that. You can feel him shaking underneath you as you establish a slow rhythm. Why is he acting like this? Aren't guys supposed to like it hard and brutal? Your cheeks flush with rage as you begin to pound down on him harder. You continue hammering him into the table even when you feel that it is already over, has been over since...\n\n\"That's enough!\" the leader finally interjects, his pants back on as he appears out of nowhere to pull you away from his friend. The little one's face is now streaked with tears and snot. When did that happen? You have to stifle a giggle. There is a suspended silence in the room.\n\n\"What the fuck was that?!\" the boy screams, bludgeoning his way out of the stillness. He seemed to have been struggling against his shock, starting the scream minutes ago that only now has surfaced to the level of your ears. He is standing before you, naked and humiliated. Together you look like a perverse Adam and Eve. Looking furiously around him, he manages to locate his pants. He scoops them up in his arms, struggling with the lock on the door before bolting out into the hallway.\n\n\"Well,\" you manage to say, \"It can only get better for him.\" But the remaining two seem to have lost their excitement. They cower and shrink into their chairs, glancing nervously at one another.\n\n\"Maybe you should leave,\" one of them suggests.\n\n\"Fine,\" you snap back at them. \"What fine specimens of masculinity you all are, you fucking wimps.\"\n\n\"Get out of here, you crazy bitch!\"\n\n\"Fuck you all!\" You roughly pull your pants back up and throw your shirt on. Your hair is stuck across your sweaty face. You deserved to have this moment, but they took it away from you. You are furious as you struggle to maintain enough presence of mind to locate your purse and your keys.\n\nAs you are being escorted out the door, you suddenly feel a frigid and sticky wetness run down your head, onto your neck and down into your pants. Tasting a drop from your neck, you detect the same cheap beer that just a few minutes ago they had so eagerly bought for you. An ironic thought, that at least the alcohol can't really freeze in the cold, fills your head as they push you to the doorstep, shouting \"Nasty skank!\" and a few other choice things before finally slamming the door behind you.\n\nYou deserved to triumph. If there's nothing wrong with feeling good, then why aren't you allowed to feel good? The anger seething in you is so great, so far above and beyond you, you can hardly even see it. Its diffused rays burn you at first contact. Its shadow appears sparkling on every grain of concrete as you continue your aimless wanderings through the early-dawn city.", "action_results": [null]}, {"action": "Wander the streets", "result": "You don't know where you're going. You don't care where you're going. All you know is that you're going. Going away. From your house, from that evil old bitch, from yourself\u0085\n\n\"Anna!\" you hear a familiar voice call out to you in the darkness. Jerked out of your reverie, you gaze around at the equally familiar surroundings. You have unwittingly walked straight to St. Jerome Catholic Church, your family's parish. Across the street in front of the rectory, waving at you in his old woolen mittens, is Father Carl. He rushes across the street to you.\n\n\"My dear!\" he says breathlessly, covering your bare shoulders with his coat. \"What are you doing out in this dreadful cold?\"\n\nHe peers meaningfully into your eyes. Only a few hours have passed since you last saw him at the funeral. Looking at him makes you feel like you never left your house at all, like you are still there in that stuffy living room surrounded by all of those family and friends, by everyone who didn't know what in the world they could possibly say to you. By those few who, though they stood just a few feet away from you, might as well have been in a different world\u0085 You find yourself short of breath and overheated under his heavy coat. The cold felt good. It was unpleasant, but for that reason it felt good, it felt\u0085He's expecting an answer.\n\n\"I'm just going for a walk,\" you say unconvincingly. At this point he has looked you up and down and his eyes have taken on a look of urgency.\n\n\"My child,\" he coaxes you, \"Come inside. It's too cold out here for you. You've been through too much to be wandering all around Boston at this hour. Please come inside, my dear.\"\n\nHis kind words have overpowered you. You find yourself moving with him up the little walkway towards the front door of the rectory, when suddenly he says,\n\n\"You know, your aunt Fiona is such a lovely woman. And so pious. It was lovely getting to see her today, despite such terrible circumstances.\"\n\nIt is at this moment that you remember why you never go to church anymore. Because church is filled with the Aunt Fionas of the world. You stiffen under Fr. Carl's guiding hand, stopping dead at the base of the rectory steps.\n\n\"My Aunt Fiona is a callous, bigoted bitch who covers up her many shortcomings by making a big show of holiness! Now if you'll excuse me, Father, I was in the middle of a walk.\"\n\nYou spin around on your high heel, making quick progress back towards the street.\n\n\"Anna!\" Fr. Carl calls after you. \"Anna! Please come back! I'm sorry I made you angry. Come inside, my dear, for God's sake, it's such a cold night! Anna!\"\n\nYou hear the worry in his voice, but he respectfully holds back from following you. In the corner of your eye, you glimpse the warm light in the windows. A wind has begun to swirl on the street, picking up dead leaves and dirt which further blacken the night. Your angry heart beats furiously in your chest and you have that same feeling you had when you left your house earlier in the evening: if you don't keep moving, something is going to break.", "action_results": [null, {"action": "Join Fr. Carl inside", "result": "Watching Fr. Carl's back as he busies himself with the tea kettle, you muse that he would have made an excellent housewife. Fastidiously, he pours steaming water into two plain mugs.\n\n\"What kind of tea did you say you wanted, Anna?\"\n\n\"Anything is fine. Herbal, I guess.\"\n\n\"Chamomile all right?\"\n\n\"Sure.\"\n\nHe sits down across from you. The little rectory kitchen is not much bigger than a confessional, has the same feeling of entrapment. Fr. Carl smiles benignly at you.\n\n\"I can't begin to imagine how today must have been for you. Please know that I am always here for you. Always.\"\n\nHe takes your hand in his. You feel a shock of warmth shoot through your body, followed by an equal measure of guilt. You want to cover your bare legs.\n\n\"I wasn't really going anywhere specific\u0085\" you begin.\n\n\"I know. That's why I wanted you to come inside. You are very fragile. Extremely fragile.\" He grips your hand suddenly and you could swear you see tears in his eyes. \"You know, I have always known that there was something special about you. You are so beautiful inside and out. I know the Lord has chosen you for great things, and He makes you suffer now because He wants to purify you, to bring you even closer to Him.\"\n\n\"Uh huh.\" Your vision is beginning to blur over your tea. You want to go home, but Father Carl continues unhindered.\n\n\"Going through a dark night as you are now is a perfect time for discernment. I just know that you will discover something amazing. I feel the Holy Spirit move so strongly in me whenever I see you. I would like to be be your guide if you would allow me. I want to be here to serve you and to bring you closer to Christ.\"\n\n\"I was going out to sin,\" you blurt out, staring down at your hint of a midriff.\n\n\"To sin? I can't believe that. I put you on a pedestal, Anna. I know I shouldn't, but I do. I know you have come to me for confession before, but they were venial little things. I don't believe there is any bad in your heart at all.\"\n\nHe reaches his other hand across the table, sandwiching your now sweaty hand between his two.\n\nYou have the impression that a decision is being made for you. Why does he think you're a saint? Does he have any idea of the evil in the family you come from? Why is he putting all of this on you, on this day of all days? Gazing measuredly into his eyes, you wonder what he looks like naked. You feel both uneasy and excited, and very, very confused.", "action_results": [null, {"action": "Intrigued and pulled in by something irresistible, you stay.", "result": "You close your eyes, breathing in fully as you concentrate on the incredible warmth you and Father Carl have generated with your hands. You think of a dozen different things to say, but none of them escapes your lips. You just sit there, breathing steadily, giving in to a force that seems to flow freely through and around you. Slowly opening your eyes, you meet his unwavering gaze with a smile.\n\n\"Ok, I think I'm here now,\" you say. You take a sip of your tea, wiggling the heavy coat off your bare shoulders. Father Carl swallows audibly, though he doesn't appear to be drinking his tea just yet.\n\n\"How has school been for you, Anna? You know many of the great Catholic writers were also great philosophers.\"\n\n\"Well,\" you say with a rueful smile, \"it's not quite the Continental tradition that I'm studying. Modern philosophy has been broken into very small and disconnected fragments which are scrutinized to death without any sense of the larger whole. It's actually been a bit disappointing.\"\n\n\"Do you long for something that speaks to your heart as well as to your mind?\"\n\n\"I guess so. I have always been taught to disregard anything that I cannot readily understand, to do away with mystery, but I have found that even at the end of the greatest and most sophisticated efforts, the mystery is still there. And then what? Everyone has to decide how they will handle the unknown in their own life. Pretending it's not there or that we know more than we actually do is just as misguided as taking too much on faith.\"\n\n\"You are such a brilliant girl, Anna. Remember what a standout you were in your Confirmation class? \" He chuckles joyfully at the memory. \"It was like making a Doctor of the Church sit through kindergarten class. I felt so guilty and I was worried that you would lose interest.\"\n\n\"In many ways, I did.\"\n\n\"But you're here now, Anna. That is all that matters. My prayers have been answered tonight. Maybe I shouldn't be telling you all this, but I want you to know how much I adore you. I have prayed ardently for you every night, you have always been in my thoughts. I can still see you, the way you glowed in your Confirmation dress, and my heart was glowing too. It was one of the happiest days of my life.\" He reaches a hand up to pick at a small tear welling up under his eye. Not wanting to stare at him, you get up quietly to refill your mug.\n\nYou are surprised to hear the scraping of his chair behind you.\n\nYou set your mug down slowly, feeling his presence behind you, the hot exhalations stinging your neck in quick little bursts. You stand breathless, feeling once again that paralyzing warmth which melts your limbs into prone inertia.\n\n\"Anna, I love you so much,\" he whispers in your ear, resting one hand gently on your waist. \"I just want to hold you and protect you from all the evil in this world. I want to adorn you with my love.\"\n\nHis lips brush gently against the nape of your neck. They sweep gently down to your shoulder. He inhales deeply. You can feel him closing his eyes as he takes in your scent. Unable to think, unable to run away, you tilt your head back deep into the sensation. His lips reach around to consume your exposed throat, kissing and pressing in an increasingly needful frenzy. Thus excited, his lips find yours, his hands gripping tightly at your waist as though to forcefully hold themselves away from any other part of your body. His kiss is closed and desperate. You can do nothing but steady yourself against the counter to prevent the both of you from tumbling to the floor.\n\nSuddenly, the loud chiming of the church bells next door shakes the little room, the sound bursting forth stridently into the delicate solitude. You both turn instinctively to the window. Across the driveway, two stained-glass windows burn with fury. You feel that the ceiling might fall in, or the walls crumble suddenly to dust. Those warm hands at your waist turn cold. Father Carl's illuminated eyes stare emptily at you as he pushes you roughly away from him.\n\n\"Get out,\" he hisses. \"Get out! Get out! Get out!\" He collapses weakly back into his chair, his eyes shut tight against the world. He crosses himself with a wild motion and begins to pray out loud. \"Oh God, I'm sorry! I'm so sorry. We're no good. We're no good!\" The tears are now running freely down his face..\n\nWithout another word, without another thought, your legs carry you to the door. The last thing you hear as you shut the door behind you are the agonizing words cried out into the emptiness, \"Can you ever forgive me?\".\n\nThe blackness around you is absolute, your neighborhood transformed into an absolutely unknown landscape as you make your weary way back home.", "action_results": [null]}]}]}]}]}]}]}, {"action": "Go back to your apartment", "result": "\"I should probably pack,\" you manage to say. You even smile as you add, \"I can't wear the same pair of panties every day, can I?\" Those striped ones, with your mom's\u0085it's like a bad movie. How does one end such an abnormal conversation? With normalcy, you suppose.\n\n\"Thank you for your help, Dr. Fay. I'll schedule an appointment when I'm back.\"\n\nIt's almost like leaving for Christmas break.\n\n\"Anna,\" she says very quietly. You turn around. \"Your tickets, sweetheart.\" She said \"sweetheart\" like she meant it. You bite your lip as you take the small envelope from her hand. \"Your flight is at 9:30 in the morning. We've arranged for a taxi to take you to the airport so you don't have to\u0085worry any more than you have to. Godspeed, Anna. I look forward to seeing you again.\"\n\n\"Thank you, Dr. Fay.\"\n\nCrossing the windswept quad, your tiredness melts slowly into a strange sort of anxiety. What you feel is an acute sense of emptiness, something that must be filled immediately. You must be filled. You close your eyes for a moment. Opening them again, you are at the street corner. So is he.\n\n\"Anna!\" he proclaims. \"You deserted me during my dissertation today!\" When you don't immediately respond, his manner turns on a dime. \"Everything okay?\" he almost whispers.\n\n\"Would Sigmund like to take a study break in my apartment? I'm afraid I don't have any coke, but there is a coffee machine.\"\n\nYou barely hear his answer when you start walking again towards your apartment. He is coming home with you and you are going to sleep together. Not even 24 hours ago, you were fantasizing, wondering what would happen if the air above your groping hands suddenly became his back. Now it really will be his back, and you will scratch your nails down it until he howls. He must fill you; he has no other option. The air between you is electric, and he knows that you know that he knows that something is wrong, but you have tacitly agreed not to mention it. You are at the door to your studio. He smiles a little nervously, saying stupidly,\n\n\"I hope I'm not imposing on your plans.\"\n\n\"What plans? I'm going home tomorrow for awhile.\"\n\n\"You are?\" Again, a silence. You shut and lock the door behind you. He trips over your whiskey bottle on his way into the room.\n\n\"You can put that in your coffee if you can scrape any off the sides.\" He laughs, shaking his head at you and taking a seat on the edge of your bed. You turn away from him, shakily pouring some coffee grounds into a filter, turning on the machine. Your face is on fire. The empty feeling has spread its way up through your body, into your head. The pressure of the air threatens to crush you at any second if you don't fill up the void immediately. Some time passes vaguely, silently.\n\n\"That took forever, didn't it?\" you say, handing him a shaking cup and taking a seat on a chair after kicking off the pile of pants on top of it. You pull it close, across from him. He's on your bed. He is sitting there on your bed, putting that precise weight on it for which it has been calibrated, expectantly. You gaze boldly at him. Straight black hair, green eyes, a square, firm build. He smiles, at first nervously. Then he seems to remember that he has green eyes and a firm build, and he says with a sly smile,\n\n\"Ja, und Frau O'Hagerty, was do you come here for on zees kalt day?\"\n\n\"Frau O'Hagerty!\" you exclaim hysterically, a gunshot going off in your ear. That's the ancient sound, the horn at the beginning of the fox hunt, the start of the race. With a mechanical motion, you tip your coffee cup directly over your lap.\n\nThere is that thrilling moment of expectation that has always entranced you. Like in the movies, just after the person has been shot, but before the blood appears. The damage is done, but they are still alive, standing just as they were before. But time is running out very, very quickly. You breathe in sharply, and then it is there, a merciless stinging all over your legs, and between your legs. Steam rises from your lap as you gasp through the agony. You look over at him. His eyes are saucerwide staring at your smoking crotch.\n\nYou stand up, taking a little step forward so that your knees are almost touching. You quickly remove your jeans, revealing your scalded red legs.\n\n\"Kiss it and make it better,\" you whisper through tears, pressing your legs against his, moving your hands through that crowlike black hair. He looks up at you with a steady gaze, his green eyes scrutinizing you. Then, slowly, he touches his lips gingerly to the angry red blemish on the front of your right thigh. His burning lips make you shiver, and you grasp onto his shoulder with the other hand, attempting to steady yourself. Gently, he runs his tongue up and up until it hits against the seam of your coffee-soaked striped panties. You grip him more tightly, whimpering a little with the pain of the heat on top of heat. The green eyes look up at you again, but you look away, pushing his face towards your dripping center. The carpet below you is badly stained. He breathes in deeply, lightly hitting against your mound with his nose. Then he begins to suck from underneath, hungrily pulling out all of the coffee and everything else that begins to pool between your legs. One hand grips clawlike at your backside while the other begins to pull at the seams of your striped panties. You arch your head back, letting out a long, low moan. Suddenly, he has wrapped the elastic of your underwear around his fingers and with a deft, harsh movement, he rips them from your body. You stare down in shock as they lie there on the floor, your torn coffee-stained striped panties, mom's gift to you. Your eyes flood suddenly with tears. You stare him fiercely in the eyes. Then you turn your hand sideways and slap him hard across the cheek.\n\n\"That was my favorite pair of panties,\" you cry out at him, feeling suddenly like a child who has just had her blue balloon wrested from her hands, watching in desperation as it drifts away into the heavens.\n\nHe looks up at you with genuine confusion, his moist lips hung in suspension.\n\n\"I don't know what's happened to you today,\" he manages after a moment. \"Perhaps we shouldn't be doing this. I feel like I'm hurting you.\"\n\nYour lips tremble and for a moment you think you might faint.", "action_results": [{"action": "Tell him to leave", "result": "\"Yes, maybe,\" you begin awkwardly, backing away from him, picking up your jeans, then putting them back down. \"I'm sorry. I've had a really upsetting day. I'm really sorry.\" You fumble around until you find a pair of sweatpants, which you quickly pull up all the way to your ribs. They scratch against your burned thighs and again your eyes fill with tears. You look away.\n\n\"Don't be ashamed, Anna. I really like you. But I'm worried about you. Are you sure you don't want to talk some more?\"\n\n\"I'm sure,\" you cry, still staring at your torn underwear on the floor.\n\n\"I'd like to give you my number, if you want to talk later.\"\n\n\"No, I don't want to talk. Not now anyway.\" You attempt a little smile. \"Please just leave.\"\n\n\"Okay.\" For a moment, he rests his palm on your cheek. Then he picks up his jacket, fumbles with the door and steps out, closing it behind him very gently, until his searching eyes are concealed on the other side. You sink down onto your hands and knees as the last of your energy is spent. The only thing in the room is the torn panties. They stand out in sharp relief as everything else fades into a nondescript gray.\n\nCould it really be true? Is she really gone? You paw gingerly at the wet cloth, following along a bright green stripe, still warm from your body. Is her body still warm? Or is she\u0085\n\n\"Mama,\" you gasp, turning towards the wall. You close your eyes tight, trying hard not to think of anything at all, not to remember anything at all. Slowly, the sounds and the smells drain out of you, leaving you gray and still on the floor. The only thing that remains is an innocuous little pulling in your stomach, that same void that you almost filled with him. The thought of him makes you even hungrier and suddenly you are sitting upright. \"I've eaten nothing all day,\" you say to yourself. Careful not to look at the floor, you grab your keys and abruptly leave your apartment, forgetting to lock the door behind you.\n\nYou walk aimlessly down the familiar hill. You already know where you are going. You don't have to walk as though you were trying to get somewhere. The air is fragrant with food. People pass you by on both sides. Cell phones ring. Dogs bark. It's an ordinary day, just an ordinary day. But what an extraordinary appetite!\n\nIn a moment or two, you are seated at Volpe's, your eyes devouring the menu. You order a large Caesar salad, chicken parmesan with a double side of fries. You order a large cola. Actually, why don't you add the soup of the day as well, since it's included in the salad special? You tap your fingers impatiently on the greasy tabletop. You're so hungry. You are so fucking hungry. If you don't have something to fill up your middle, you think you will break in half.\n\nThe next thing you know, you are halfway through your feast. You haven't tasted anything since the first few scintillating bites. All you feel is texture. The tenderness of the chicken, the crunch of the lettuce, the chill of the cola. You cover your mouth with a fist as you burp painfully, feeling the acid burning in your throat. You swallow it back down, tipping the soup bowl against your gaping mouth. More, more, you need more. By the time you are walking slowly back up your hill, you have a sticking pain in your gut. The emptiness is much worse than before and you look around desperately for a remedy, for anything\u0085\n\nSuddenly, there is a sweet acrid aching in your jaw and you double over someone's lawn, loudly throwing up the grotesque contents of your stomach. You start choking as a barely-chewed piece of lettuce catches in your throat. You collapse to your hands and knees, the sky spinning in circles above you. A grayness begins to creep in from the edges as you fall flat on your stomach. The impact sends a reflexive cough through your whole body, propelling the lettuce sideways from your mouth. You lie gasping on the ground, your whole body abuzz with the thrill of death. You get to your wobbly feet as quickly as you can, brushing yourself off dismissively as you half-run, half-stagger back to your apartment. You close your eyes, desperate not to lose that feeling.\n\nYou bolt the door. You grab the torn pair of panties. You claw your pants off. You throw yourself onto the bed. Your chest rises and falls in quick succession. You open your mouth wide, slowly feeding the wet cloth down into your throat. You push it down further and further. You start to gag. With both hands, you grab furiously at yourself, rubbing and pulling and thrusting with your fingers. The same grayness begins to seep in from the sides of your vision. You thrust your hips up and up with the last of your life force.\n\nA burning lightening rips its way through you and you scream with all your might, dislodging the panties into a thick dripping pile on the floor as the last of your cries subside unheard. Occasional spasmodic shivers continue to shake you as you fall vacantly asleep.", "action_results": [{"action": "Dream", "result": "There's a warm sunlight, a sunlight warm like summer sun. When your life was quiet sunlight, when you were there, a thin white blanket. Slowly breathing morning, quietly the door opens. Quiet, quietly now. Close your eyes, little one. I'm just here to\u0085sunrays were only soft then, quiet the morning in summer. Many mornings in summer. Outside, life awaking, you in the warm cocoon, the thin blanket soft, under the blanket\u0085Anna, oh Anna, you angel. Smells like ladybugs and flowers, the door opens softly in the breathing morning. Anna, are you awake? No, don't wake up. Stay as you are, my angel. Little creaks below, under the blanket, under and up, the sunlight warm right through the thin blanket. My god, you are perfect. You are a gift from God. I don't want anything but to bask in your perfection. You are so beautiful\u0085the garden flowers swayed a little in an early morning breeze, then they were still. The sun that summer, soft. Your hair is so soft. Hidden hiding places in the forest. He whispered in the early morning\u0085\n\nThere's nothing wrong with feeling good. This could make you feel good too. Let it make you feel good. Let me make you feel good\u0085\n\nYour father is a cop, a good man with a good family. What a pity it would be if they thought you weren't good anymore\u0085\n\nSomeone is coming up creaking stairs.\n\nIs that John? John!\n\nBe quiet, little Anna, your hair is too soft for words.\n\nDon't ruin the moment. Don't ruin it all.\n\nThere's nothing wrong with feeling good\u0085\n\n**********************************\n\nWhen your eyes open, it is still dark outside. Is it morning or night? Cold, not like the sunlight that was so unusually soft that summer. You shiver in the morning cold, reaching down to feel where your legs hurt. Why?...It all comes back down in small flurries, back into memory.\n\n\"Mom,\" you say dully up to the ceiling. \"I have to go home for my mother's funeral. I have to get ready to go home. I have to get ready right now.\"\n\nYou turn on the bedside lamp, which casts a dim thoughtful light over the piles of books all over. You're not planning on bringing a single one of them back with you. Rummaging through your closet, you pull out your battered old suitcase, which you absentmindedly begin to stuff with various articles of clothing from the closet, from the bureau, from the floor. You don't want to think of which particular events you will need which items for. The beauty of the early morning is that it is the time before anything has become real. There's nothing wrong with feeling good. You discover another old bottle in the back of your closet, this one still containing the remains of some flavored vodka from an early semester party. You open your throat gratefully to what's inside, letting it all in, not flinching. You had been feeling sick upon waking up, now you feel all right, and that is all right. You disregard all of the evidence of last night's adventure: the torn underwear, the coffee stains, the lingering smells. None of it matters. The morning has erased it all.\n\nEssentials, you need the essentials. Sunglasses, wallet, keys, phone, ticket. A card inside is from a local cab company. Someone wrote a time on it. It's coming in half an hour, right to your door. You put your headphones into your ears and walk out the door, forgetting to lock it behind you.\n\nThe fascination of transit. Buses connecting to trains, connecting to planes. All around the world, from any one point to any other point, there is a way to get there, there are people going that way. What kind of lonely thoughts do the early-morning travelers have as they drift down the empty highways?", "action_results": [null]}]}, {"action": "Keep him in your room", "result": "\"Can't you take a joke?\" you warble with all the levity you can push out of your throat. His look of confusion is now verging on fear. But you can also see that he has become highly excited.\n\n\"Yes, in fact. I think it's funny that your pussy has a hazelnut aftertaste.\"\n\nYou break into hysterical laughter, falling on top of him. His bulging denim pushes up against you and you just cannot wait another second. He has begun tenderly nibbling on your ear, but you cover his mouth with one hand, undoing his belt with the other. None of that. None of that bullshit. You need filling. You're dying of thirst and he's tormenting you with little raindrops! You start pulling angrily at his pants and his boxers, scratching him carelessly as you finally have them around his ankles. With a flick of your wrist, they are on the floor. Your body spasming with infinite energy, you rip off your own shirt and bra, as he mirrors your movements. Then you are both naked, kneeling face to face at the bottom of your bed. He doesn't appear to be breathing. Your tears have dried.\n\n\"Now, Doctor,\" you begin, finding his darting eyes and holding them fast with your gaze, \"You are going to fuck me as hard as you possibly can.\" With that, you grab him by the neck, pulling him down on top of you.\n\nThe air is his back. He is really here, that is really his weight, his breath, his dick. He is going to fuck you. In a matter of seconds, he will thrust himself into you. The moment when the shot has been fired, but the blood has not yet appeared\u0085just a few seconds. Three, two\u0085\n\n\"Ahh!\" you gasp sharply. He hesitates for a moment, but you say nothing more, so he continues. The bed creaks a hesitant lullaby.\n\n\"Who taught you how to fuck? Lambchops?\" you growl at him. He laughs out loud, but you dig your nails angrily into his shoulder blades. \"I told you to fuck me hard!\"\n\n\"Yes, Madam!\" he accedes breathlessly, looking away as he focuses all of his energy into his efforts. The lullaby gives way to a stormy percussion as the bed is lifted clear off the ground, then sent crashing back down. You arch your back up so he can slam in even deeper. It begins to hurt. Looking above you, you see the blue balloon float further and further away. Your eye begins to tear up again and you arch your hips higher so it will hurt even more. It has to hurt too much to cry. All your attention, at that point where your flesh is turning red, burned and bruised and\u0085\n\n\"I'm gonna come,\" he moans into your ear, pulling out just in time to shoot his load right onto the large red burn on the front of your right thigh. The thick milky liquid is like an instant balm after all the friction and abuse. It feels so good, so unexpectedly, that you find your muscles suddenly contracting in an agonizing orgasm that twists you from side to side, your right leg shaking helplessly. When you open your eyes, he is looking down at you with a look of pure melancholy.\n\n\"Was that really what you wanted, Anna?\" he asks breathlessly, too afraid to touch you.\n\n\"Precisely,\" you respond curtly. \"Thank you. Now you can leave. I won't be back for quite some time I imagine because, you see, my mother died last night.\"\n\n\"What?!\"\n\nBut you have already turned your back to him.", "action_results": [null]}]}]}