{"tree_id": "https://infinite-story.com/story/room.php?id=98844", "context": "", "first_story_block": "Jake came back from his lunch break to find a glass mason jar sitting on his desk. He frowned; there was absolutely no reason for it to be there. What good was an empty jar at a business which dealt strictly with numbers? He looked past his desk, down the row of cubicles occupied by the data crunchers who worked under him. Connor lives on a farm, Jake thought to himself. Maybe he’ll know why this jar is sitting on my desk.\n\n“Connor…” he began, walking over to stand behind his computer.\n\n“Almost done with the Tinasky report, boss!” he said, turning around in his chair to look up at Jake. “Once that’s done, I’ll move on to archiving-“\n\n“Yes, yes, I’m sure you’re doing great,” said Jake, cutting him off. Connor was the rare breed of High School Part-time employee who was actually excited to have a job over the summer. The work ethic was nice, but the chipper attitude was quite annoying. “What I really wanted to know was if you knew anything about the glass jar on my desk.”\n\n“Oh, sure,” said Connor, nodding his head. “Mr. Flint came by and put that on your desk. He said that you were supposed to use it to collect what is due. He also said that you’d know what that means,” he added, noticing Jake’s confused look. “Anyway, I think he’s still in his office.”\n\n“I should probably figure out what he wants, and why he thinks I need a jar for it,” said Jake, rubbing his chin as he mused it over. “Thank you, Connor. Keep up the good work.”\n\n“Dork,” he muttered under his breath. It was bad enough being the manager of a team of ‘Data Processing Advocates’, a fancy title for a grunt job that involved converting all of their paper documents into digital reports. Everyone knew it was a shit job that was one step away from being replaced by a digital scanner, which is why most of the positions were held by surly teenagers forced to get a job by their parents. The kids would work for a month or two before quitting or getting fired, at which point they’d be replaced by the next batch of surly teenagers. Years later, it would show up on their resume, and give them needed job experience so that they could get a slightly less shitty job elsewhere. It was the way of the world.\n\nBut, no. Six months and counting, Connor was still here, and just as happy and eager as he’d ever been. Didn’t the kid realize that he was just a cog in the machine? The only thing more offensive than his optimism was his attire. No matter how many times you told the kid that there wasn’t a dress code at his salary grade, he still showed up in khakis and a tucked, collared shirt.\n\nStop it, Jake, he thought to himself, grabbing the jar and walking across the building to Lucas Flint’s office. This is how you depress yourself. Not everyone gets to have their happy dream job, and there’s no shame in being a manager. He’ll figure out that the world sucks soon enough, and then you won’t have to feel that empty spot in your soul where your dreams used to be whenever you have to talk to him.", "action_results": [{"action": "Head to Lucas's office.", "result": "“You wanted to see me, sir?” said Jake, opening the door to Lucas’s office.\n\n“Why, yes… yes, I did,” he replied, looking up from a sheaf of papers at his desk. “It’s time for you to pay your debts, Mr. Cooper.”\n\n“I’m… afraid I don’t follow,” he said, placing the jar on his desk.\n\n“Well, it’s very simple, Jacob,” he said, standing up from his chair. “When I hired you as a manager here, one year ago, you promised me that you would put your soul, in its entirety, and invest it into this company, did you not?”\n\n“I…well, probably,” Jake replied, rubbing the back of his neck. Where was this going?\n\n“And yet, here we are, one year later, and your soul is still your own. It’s not that you’re doing a bad job, mind you… but you would be a lot more efficient if you would just hand your soul over to me. You’d finally favor cold, hard logic and the rules of business over vague ideas of human decency.\n\n“There would certainly be a lot less moping,” he added, picking up the jar and tracing the edge of the rim with his finger.\n\n“…sir?” Jake began to instinctively step backwards, toward the door. “I’m not sure I follow the joke. You’re freaking me out, here.”\n\n“That’s the beauty of the modern age,” he said, with a laugh. “You all think that Science has completely explained away the Supernatural, and so you all sign away your soul, not even considering the possibility that you’ve been dealing with demons. You sold your soul to me the moment I hired you as a manager- as if you had any other qualifications. And now that it’s no longer practical to allow you to keep borrowing it, I intend to collect your debt.”\n\nJake watched with a morbid curiosity as the mason jar flew straight at his heart, the rim of the jar passing through his clothes to sear straight into his flesh. He flinched at the sharp sensation of pain, although his limbs began to feel heavy. A stream of milky white, cloudy liquid was pouring forth in from the center of the wound, slowly filling the jar with what he could only assume was his soul. Jake raised a hand in hesitation, too afraid to pull the jar out of his chest.\n\n“Any last words before I take back what is mine?” asked Lucas, with a condescending chuckle.", "action_results": [{"action": "\"What if I gave you someone else's soul?\"", "result": "\"And what gives you the ability to speak for someone else's soul?\" Lucas asked, with a condescending smirk.\n\n\"Does it matter?\" Jake said, wringing his hands nervously. \"You're taking mine out of, what, a year old verbal contract? You're the demon, you figure it out. Just... bring someone on my team in here. These sort of debts transfer, don't they?\"\n\n\"I suppose they do,\" Lucas said, his smirk widening into a grin. \"I'll send a chat message to Connor. He's the most likely to respond quickly, don't you think?\" Jake merely nodded in reply; the jar in his chest was still slowly filling with liquid, and he was afraid to do anything too vigorous.\n\nJake stood there in awkward silence, waiting patiently by the door as his soul slowly poured out. Lucas had started ignoring Jake entirely, and was instead sorting papers on his desk and casually filing them away. It was Lucas's complete indifference to the whole situation which found to be the most unsettling. Finally, approaching footsteps broke the tense quiet.\n\n\"You... wanted to see me, sir?\" said Connor, nervously opening the door.\n\n\"Ahh, Mr. Wilkinson... thank you for coming...\" Lucas stood up from his seat, with a deceptively friendly smile on his face.\n\nJake had other plans. Before Lucas could finish whatever monologue he'd had prepared, Jake ripped the jar off of his body and shoved it straight into Connor's chest. \"You idiot!\" Lucas yelled, dropping the kind act and switching back to his demonic voice. \"Do you know what you've done!?\"\n\n\"No?\" Jake said, tilting his head in confusion as he stared at the jar on Connor's chest. Jake's soul had vanished; quickly absorbed into Connor's body as if it were a dry sponge. \"Why did it do that? I was just going to skip the contracts and pull out his soul like you did mine.\"\n\n\"Why is there are a jar on my chest?\" Connor asked, his voice shaking. Both of his hands were nervously resting on the jar, clearly too afraid to pull it out. \"And what happened to that white liquid?\"\n\n\"The jar only works if there's a corresponding contract,\" Lucas said, snatching the jar back in anger. \"You just gave Connor your soul, you foolish mortal! Now he has two of them, and I can't obtain either of them!\"\n\n\"I... I don't really understand what is going on here,\" Connor said, looking back and forth between the two men in confusion, \"but if it will help any, I can give him mine. I mean, I don't need two...\"\n\n\"You will?\" Lucas repeated. \"Why, that's... that's perfect!\" he said, his smile growing even larger than it had before. Lucas walked around to the front of his desk, and pressed his fingers firmly against Connor's forehead. Connor passed out, his body falling limply to the ground.\n\n\"The hell did you just do?\" Jake yelled, instinctively taking a step back in fear.\n\n\"Oh, relax,\" Lucas replied, with a sneer. \"You'll find out soon enough. Stop struggling and get it over with. This is all your fault, anyway,\" he added, tapping Jake on the forehead.", "action_results": [{"action": "Jake didn't even feel his body hit the ground.", "result": "Jake tried to open his eyes, shaking his head to try and clear the fog out of his mind with little success. His eyelids felt heavy, and his limbs felt like lead; completely unresponsive. He jerked at his arm, which flopped against a nearby desk. It was as if his body could only be controlled by puppet strings. Finally, his eyes were open enough to make out the form of Lucas, standing in front of him with a smug grin on his face.\n\n\"Oh, good, you're both finally awake,\" he said. \"I didn't want to alarm anyone, so I took the liberty of moving you both into one of the smaller conference rooms. Work ended about ten minutes ago, so I also went ahead and logged you both out. You're welcome.\"\n\nJake frowned. Lucas was far too happy, and it was making him nervous. Even before Jake knew that Lucas was some sort of demon, he had learned that Lucas was only ever truly happy if someone else was in utter misery.\n\nAs his limbs gained sensation, Jake felt an uncomfortable tightness around his neck. He instinctively unfastened the button at his collar, and then paused; today was casual Friday. He had worn a company t-shirt, like always. He looked down and saw a pair of pressed khaki slacks, and the textured weave of a collared polo shirt. His arms were no longer covered in hair, and his hands were all wrong. He jerked his head sideways, instintively knowing what he would see. There was his body, his own body of thirty years, sitting there next to him.\n\n\"It's that moment of dawning comprehension that I love the most,\" Lucas said, with a wide smile. \"Connor offered his soul to you, Jake. Not a soul, not your soul, but his soul. Of course, that meant you two had to switch bodies, but... well, I'm sure you'll both work it out. Call me if you need anything,\" he said, cackling to himself as he left the room.\n\n\"So... this is really happening, isn't it,\" Connor said, wringing his hands nervously.\n\n\"Yes. Yes it is,\" Jake replied, taking deep breaths. \"Lucas is some sort of demon. He tried to take my soul, failed, and now we've ended up in each other's bodies,\" Jake explained, omitting the part where this whole mess was his fault for trying make a deal. \"I vote we head back to my apartment to try and sort this whole mess out.\"\n\n\"Wait, no, we can't,\" Connor said, standing upright in a panic. \"My parents would freak! I mean, this is their date night, so Zoe, Tyler and I are on our own anyway, but... they at least need to know where I am!\"\n\nJake rolled his eyes. \"We are not splitting up. I don't want you alone in my apartment, and you sure as hell aren't going to leave me alone with your family.\"\n\n\"Okay...\" Connor said, biting his lip in thought. \"What if we say that your apartment... some pipes broke so, you have no water and I offered the couch to you since you have nowhere else to go?\"\n\nJake groaned. \"Did I just step in a steaming pile of sit-com plot cliches? We may as well just pretend you're coming with me on a business conference as a last minute replacement. At least that way I don't have to try and act like you around your family.\"", "action_results": [{"action": "\"Fine. We'll do it your way, and spend the night at your place.\"", "result": "By the time Jake and Connor made it to Connor's house, his parents had already left the building. Zoe and Tyler had already eaten, leaving the two of them to scrounge for food in the kitchen. Connor cooked himself a full spaghetti dinner, boiling the pasta and cooking some hamburger from the fridge. Jake, on the other hand, was content to microwave some frozen chicken strips.\n\nTyler was up in his room, but Zoe was still downstairs in the living room. She was watching cartoons in front of the TV, with her stuffed bear in her lap.\n\n\"I supppose this means channel 67 is out of the question,\" Jake said with a sigh.\n\n\"Do you think she'll let us watch something else if we ask?\" Connor asked, emphasizing his speech with his eyebrows to gesture that it wasn't actually a question.\n\n\"Hmmph. Hey, Zoe,\" Jake asked, walking over to crouch down next to her, \"Do you think Co- ahh, Jake and I could watch something else on the TV when you're done with this show?\"\n\n\"Sure thing Mr. Connor's Boss!\" she said, without looking away. Connor and Jake exchanged frantic looks with each other, while Zoe simply sat there, giving her bear an occasional hug.\n\n\"Ummm... Zoe... that's my boss,\" Jake said, pointing at Connor, who was still standing in the kitchen. \"I'm your brother. You know that.\"\n\n\"Nuh-uh!\" she said, standing up to walk into the kitchen. \"Connor always cooks a real dinner, and he always smiles when he walks around the house. So you must be Connor,\" she said pointing at the real Connor. \"You may have switched bodies, but you can't fool me!\"\n\nJake glanced between Connor and Zoe. He was standing there dumbfounded, with his mouth slightly open; she was returning his confusing with a wide smile, as she rocked back and forth in a swaying motion, hugging her bear.\n\n\"Umm, Zoe, about that...\"", "action_results": [{"action": "Tell Zoe the truth.", "result": "\"You're completely right, Zoe,\" Jake said, patting her on the head. \"Your brother and I have switched bodies. Magic is real.\"\n\n\"I knew it!\" she said, giving her toy a fierce hug, and scampering away.\n\n\"...was that really a good idea?\" Connor asked.\n\n\"No idea,\" Jake said, shrugging his shoulders. \"But I didn't want to try and convince her otherwise. Especially since she's right. And, well, if this causing any long-term trauma down the line, I won't have to be around for it.\"\n\n\"Thanks for that,\" Connor said, rolling his eyes. \"So, now what?\"\n\n\"Now you ruin everything, that's what,\" said a voice from the back door. Jake and Connor turned around to find Lucas, standing in the kitchen doorway.\n\n\"How did you...\"\n\n\"Oh, shut up,\" Lucas spat. \"I'm a supernatural being, I go wherever I damn well want to go. Granted, I normally try and maintain an aloof, sinister aura by using a lot of flashy magic, but... oh, fuck it. The point is, you told Zoe that you were in each other's bodies, and she actually believed you. You've complicated the contract, and now it's no longer worth the expended magical effort to collect either of your souls.\"\n\n\"Does that mean you'll switch us back?\" Connor asked, hesitantly.\n\n\"It does,\" Lucas said, snapping his fingers. There was a blurry rush of vision, and Jake suddenly found himself standing on the opposite side of the room, staring at Connor's body. Jake felt relief wash over his body as he quickly examined his hands- they were his own.\n\n\"Of course, it also means that there absolutely no reason not to endeavor to make your like a living Hell,\" Lucas said, staring straight into Jake's eyes. \"I consider this to be your fault. You agreed to the contract. You agreed to the deal. And somehow, you managed to luck your way out of it all. Consider your days numbered, Jacob Cooper. You have made a mortal enemy out of the demons of Hell.\" With that, Lucas disappeared in a puff of foul-smelling smoke.\n\nJake stood there in silence, trying to process what Lucas had just said. It was Connor who finally broke the tension in the room.\n\n\"Well... at least you've got your body back?\"", "action_results": []}, {"action": "Lie to Zoe.", "result": "\"Look, Zoe, I just had a long day, okay? I'm tired, and a bit cranky, and I just don't feel up to cooking right now, okay? You know there's no way that... that Jake and I could have switched bodies,\" Jake said.\n\n\"I know...\" Zoe said, with a frown that clearly portrayed her true feelings. \"I just wish magic was real.\" She left the room, dragging her stuffed bear on the ground behind her.\n\n\"Right now, I wish magic wasn't real,\" Connor said, chuckling to himself.\n\n\"That can be arranged, you know,\" said a voice from behind them. Jake and Connor spun around to find Lucas standing in the kitchen, a faint trace of foul-smelling smoke disappating at his feet.\n\n\"Oh, God, what now?\" Jake asked, as Connor began to unconsciously step back away from Lucas.\n\n\"You offend me,\" Lucas said, grasping his chest in mock horror. \"Connor voiced a preference for having a world without magic, and I thought I'd take him up on that offer.\"\n\n\"We're in each other's bodies, and you're some sort of demon who wants our souls. How would that work, exactly?\" Jake said, raising an eyebrow.\n\n\"Well, obviously I wouldn't get rid of all magic,\" Lucas explained, spreading his hands. \"But I would dispel everything which has affected you over the past few hours.\"\n\n\"Deal!\" Connor yelled, extending his hand.\n\n\"You idiot!\" Jake said, turning to yell at him. \"Why would you accept?\"\n\n\"Because I don't want to be in your body anymore!\" Connor yelled. \"I just want this whole mess to be over with!\"\n\n\"So it is done,\" Lucas said, snapping his fingers. Connor collapsed to the ground, unconscious. \"Of course, that also dispelled the magic I used to put Connor's soul into that body. And without any place for it to go, I now own it. But you probably guessed that,\" Lucas said, with a chuckle.\n\n\"Of course I did,\" Jake said, examining the husk of his former body on the ground. \"It had trap written all over it. But you have Connnor's soul now, right? So will you put me back?\"\n\n\"Why, I don't believe that was ever a part of the bargain...\" Lucas said, with a grin on his face. \"That means you're Connor Wilkinson now. Congratulations on your new life. Shame your current boss randomly succombed to a deep coma.\"\n\nJake narrowed his eyes. \"Alright, you bastard. You win. How do I get my life back?\"\n\n\"You don't,\" Lucas said, spreading his arms. \"But if you like, I can spare you the misery of trying to live out Connor's life. I don't think you'd last very long as a puritanical teenager, after all.\"\n\nJake sighed. \"Fine. You win. Take my soul.\"\n\n\"With pleasure,\" Lucas said, his smirk widening into an evil grin. Jake could feel Lucas's fingers press against his forehead. He was unconscious before he hit the ground.", "action_results": []}]}, {"action": "\"We're doing it my way. A quick stop at your parents and then over to my place.\"", "result": "\"I don't know about this...\" Connor said, visibly pouting as he drove them both to his house.\n\n\"You're just upset because it's not your idea,\" Jake said, waiving his hand dismissively. \"A last minute business trip makes just as much sense as me staying over at your place because of apartment issues. As if I would have to resort to staying with one of my employees over local family. Or a hotel. Or yelling at the office staff until they found me accommodations elsewhere. Besides, I already called them and told them about it. They were ecstatic that the company was giving you this opportunity. We have to go through with it, now.\"\n\n\"Yeah, yeah,\" Connor said, with a sigh. \"Anyway, we're here. My room's at the top of the stairs, on the left. Suitcase is under the bed. I'll wait here?\"\n\n\"Sounds fine,\" Jake said, shrugging his shoulders. He walked in, and rushed straight up to Connor's room without bothering to find Tyler or Zoe. The less he could interact with Connor's family, the better.\n\nConnor's room was about what he expected- spotless floor, a clean bed, and no laundry to be seen spilling from the closet or the dresser drawers. The walls were decorated with a few sports posters, but apart from that it was a very boring, sterile room. Figures.\n\nThere was an awkward stuffed bear sitting on the bed, though. Jake didn't recognize it from any cartoon, so it was probably some off-brand toy. Jake swept it onto the floor. \"Sharing is caring!\" it croaked. \"You have to put in effort to get good things back!\"\n\n\"Of course it's a talking toy,\" Jake muttered to himself. \"God forbid there be a children's toy that doesn't require batteries these days.\" He pulled the suitcase out from under the bed, and started filling it with clothes. After rummaging through several drawers, Jake was finally able to locate a few souvenir t-shirts he could wear instead of Connor's wardrobe. No such luck with underwear, though- it seemed Connor only wore briefs.\n\nAfter finding enough clothes for the weekend, Jake threw in the stick of deodorant from the nightstand, and called it good enough.\n\n\"Has Beary said goodbye to you?\" asked a shrill voice from downstairs.\n\n\"Yes, yes he did,\" Jake yelled, scooping up the bear from where it had fallen on the floor. Jake zipped up the suitcase, and dragged it down the stairs. \"Here he is back, ahh... Zoe,\" he said, handing it back to her. She replied with a giggle, giving the bear a fierce hug. \"Bye Zoe, bye Tyler,\" he said, nodding in their general direction as he walked out the door. The real Connor probably would have said a much lengthier farewell, but Jake was through caring.", "action_results": [{"action": "\"Let's get the hell out of here, already.\"", "result": "Following Jake's directions, Connor took the prime parking spot and walked up to the door while Jake grabbed the suitcase from the backseat. He turned around to find Connor still standing there. \"I know I gave you back your keys so that you could drive your car... but the keys to my apartment are in your pocket, you know,\" Jake said, with an exaggerated sigh.\n\n\"Oh, right,\" he said, blushing profusely as he entered the apartment.\n\n\"I knew we should have taken my car,\" Jake muttered. \"Whelp, my place is your place,\" he said, throwing the suitcase in the corner and flinging open the refrigerator doors. \"This is the kitchen and that's the living room slash bedroom, obviously,\" he said, pointing toward the back wall of the studio apartment. \"I still get my bed, so you're getting the couch tonight. Bathroom's around the corner. Make yourself at home.\"\n\n\"What are you doing?\" Connor asked, watching in horror as Jake pulled the stopper off of a bottle of scotch with his teeth.\n\n\"What? I'm getting a drink.\"\n\n\"I'm not 21 yet!\" Connor said, his face recoiling in disgust.\n\n\"Ask me if I care,\" he muttered. \"The soul is legal, so the body can go and suck it. I want a stiff drink, and I'll be damned if something as absurd as body switching is going to get in my way. You're over 18 though, right?\"\n\n\"...yes,\" Connor answered, eying him nervously.\n\n\"Good,\" Jake replied, gesturing with the glass he had just poured. \"Because I'm also going to be watching porn tonight.\"\n\n\"My body is a temple!\" Connor yelled, visibly shaking with rage.\n\n\"No, your body was a temple. Then I got inside of it, and now it's a convenience store. You'll live.\"\n\n\"I cannot believe you,\" he said, clenching his fists. \"I would do anything to end this whole mess right now!\"\n\nConnor's sudden rage was cut short by a flash of sulphur and red smoke from the front door. \"I believe that's my cue,\" Lucas said, walking in through the brimstone. He was carrying the mason jar in both hands. \"Well, then, gentlemen, what will it be?\"\n\nJake paused. The way Lucas was carrying that jar... it reminded him of a little kid clutching a toy. His mind briefly drifted to Zoe's stuffed toy.\n\nLucas scowled. \"I don't have time for this. Jake, what did you decide?\"", "action_results": [{"action": "Proceed with the plan.", "result": "\"Let's get this over with,\" Jake said, with a shrug. \"You win. Take his soul, I don't care. Just put me back in my body when this is all over.\"\n\n\"Wait, what? What do you mean 'take my soul'?\" Connor asked, looking nervously between Lucas and Jake.\n\n\"You said so yourself that you would do anything to end this current situation,\" Lucas said, with a smile. \"And, yes, the body switching does complicate the paperwork... but you said yes, the body you are inhabiting had already fulfilled a verbal contract, and the body you used to inhabit agrees to the deal. That's an open and close case in my book.\"\n\n\"But that's... you... I don't... Jake, tell me he's kidding. Is that really what this whole mess is about? You're in league with him just to get my soul.\"\n\n\"Well, kinda,\" Jake replied, scratching the back of his neck.\n\n\"I'm actually taking your soul instead of his,\" Lucas said with a smile. He walked over to Connor and shoved the jar into his chest. \"He struck a last minute deal, and I accepted.\"\n\n\"You damned me to Hell just to save your own soul!?\" Connor yelled.\n\nJake shrugged his shoulders. \"Welcome to the real world, kid,\" he said, avoiding eye contact.\n\n\"That's your reply? The world is corrupt so that's your excuse to be corrupt too? I cannot believe you! How can you possibly be this horrible of a person!?\" Connor probably would have continued his tirade, but Lucas knocked him unconscious.\n\n\"That's enough of that,\" Lucas said, dusting off his hands. He pulled the jar away, and sealed it with the lid. \"As agreed, I'll restore your body.\" Once again, Jake passed out the moment Lucas touched his forehead.\n\nWhen he awoke, he found himself sitting on the living room sofa, with his glass of scotch in his hands. On the table in front of him was a simple note.\n\nThanks for the assist. Your soul will be mine yet, tainted one. See you when you die.\n-Lucas Flint", "action_results": []}, {"action": "Do something noble.", "result": "Jake found his thoughts drifting back to Zoe's stupid toy. You have to put in effort to get good things back. This wasn't about his soul. His soul was worthless- anybody to see that. No, this was about Connor's soul. Someone as pure as that would never sell away their soul in a traditional deal. But this wasn't a traditional deal.\n\nLucas knew that Jake would do anything to save himself. That was why he was so agreeable to altering the deal, and that was why he called Connor into his office. Lucas wanted the chance to get Connor's soul. This whole situation was designed to torment Connor, and to trick him into giving up. No one else on Jake's team would have been as horrified by the thought of someone else drinking and masturbating in their body; hell, half of them probably would have done the same in his body. But not Connor.\n\n\"I'm not going to let you win,\" Jake said, staring Lucas right in the eyes. \"The deal is off. Take my soul, and put Connor back in his own body.\"\n\nLucas frowned. \"So be it,\" he said, walking forward to place the mason jar on his chest once more. \"I hadn't pegged you for the noble type.\"\n\n\"Yeah, I know,\" Jake said, trying to maintain his bravado. \"But you tried to use me to get to Connor, and that's where you lost. I may not be the world's most outstanding guy, but I'll be damned if I take anyone else down with me when I fall.\"\n\n\"Well, you certainly got the 'damned' part right,\" Lucas replied, with a sneer. Jake felt Lucas's fingertips press against his forehead, and the world went black once more.", "action_results": []}]}]}]}]}, {"action": "\"Can't we work something out?\"", "result": "\"Can't we work something out?\" Jake asked, his gaze switching nervously between Lucas and the jar. \"I mean... you don't really want my soul, do you? I'm a terrible person, there's no way my soul is any good.\"\n\n\"And just what are you proposing?\" Lucas asked, raising an eyebrow. \"You're just a human. Strictly speaking, there's nothing to be worked out, because you can't work with me. You'd have to be a demon before we could even consider making some sort of deal.\"\n\n\"So... wait, can you make me into a demon? We'd be able to work something out if I were a demon?\"\n\n\"Well, I suppose it's possible...\" Lucas said, pondering the request. \"Mind you, you'd have to make it worth my while. I've already got a bird in the hand, and I'm not about to lose it for two in the bush. Still, I think we could work something out. After all, your soul has finished draining. I will simply turn you into a demon. I'll weigh out your soul, and find out what it is worth. You will go back out on the floor, and try and get as many of the workers under you to sign their souls to you. If you can sign over a higher amount of worth, I'll let you take your soul back. If you can't, then I get to keep your soul. Does that sound like a deal?\"\n\n\"Well, a slim chance at keeping my soul is better than none,\" Jake said. \"It's a deal.\"\n\n\"Then it is done,\" Lucas said, his eyes flashing a sinister shade of crimson when he spoke. \"I'll be taking your soul from you. When you awake, you'll be a demon. Simple as that.\"\n\nLucas pulled the soul jar away, and Jake felt his vision blur. The world went black, and just as quickly snapped back into focus. \"Was... was that it?\" Jake asked, patting his chest where the jar had been.\n\n\"That was it,\" Lucas replied. \"It may feel like only a slight lapse of consciousness for you, but it's actually been over an hour. I've weighed out the purity of your soul, and it came out at 23 feather units. Which, given that you're not familiar with the purity system... anything above 20 makes for a decent person, so I'm impressed. Heaven isn't guaranteed until 30 units, but at least you're above 10.\"\n\n\"So... I don't feel any different at all,\" Jake said, examining his arms. \"Should I... be feeling something? Do I have any powers? How will I know which soul is good enough?\"\n\n\"You won't know a soul's worth until after it's already been signed away,\" Lucas said, with a shrug. \"But you've been their manager for a few weeks; you should have a rough idea of who is better than who. Although, I warn you, teenagers generally don't rate highly, as they haven't been out on their own to face temptation. Purity is nothing without a foil of perversion. As far as your powers go... as a low ranking repo-demon, you don't have any. But you can make offers. Get them to sign a contract on the cursed parchment, and then the terms will come to pass. The parchment has no limit, but try to sign away material things first- that sort of thing can come out of your paycheck. The purity of their soul, minus the cost of the wish needed to obtain the soul, will show up in the corner of the page so that you'll know how many souls you need to collect. Do whatever you need to do, but try not to blow your cover, hmm?\"", "action_results": [{"action": "Parchment in hand, Jake went back to his desk.", "result": "Jake looked at the people in his squad, trying to weigh the pros and cons of each. Connor was his first thought; the kid was likely to have purity through the roof. But on the other hand, he was also deeply religious, and there was no way he'd be able to get him to sign over his soul. He looked down the line of desks, and realized he simply didn't know enough about most of them in order to tempt them.\n\nAlice was probably a safe bet. Shy, homely girls being tempted by the promise of beauty was practically a sure bet. Although, depending on how much magic would be needed to make her beautiful, that might not give him much room for profit...\n\nPerhaps Tanner? The kid had a noticeable belly, and Jake had been noticing him bringing in HealthyFit trail mix to work instead of the potato chips that normally composed his mid-day snacks. Maybe a quick fix solution to get fit would be worth his soul?\n\nAnd then there was Kevin. Based on the state of clothes and his car, and the way he was constantly complaining about his bills, he could probably be tempted easily with money. He wasn't a good person in any sense of the word, but Lucas made it sound like gifts of money could be done for virtually no cost.\n\nJake shook his head. All of them seemed like long shots. Who would willingly sign away their soul? But then again, Jake was reminded of what Lucas had told him. In this day and age... who still takes that sort of thing seriously? Connor was the only religious person he had working for him- all the rest were surly teenagers still trying to find their place in the world. Jake shrugged. What did he have to lose? May as well pull one of them aside, and see if they'd take the bait.", "action_results": [{"action": "Start with Alice.", "result": "\"Alice, you could stop by my desk when you have a moment?\" Jake said, calling out over the row of cubicles.\n\n\"Is... is something wrong?\" she stuttered, approaching his desk a few minutes later. \"Is this about my productivity scores, or...?\"\n\n\"No, no, nothing like that,\" Jake said, with a friendly smile and a dismissive wave. \"You're not in trouble. Think of this as... an offer. Or an opportunity, if you will. There's no easy way for me to ask this, but... how would you like to be beautiful?\"\n\n\"Sir...?\"\n\n\"I know, I know, but hear me out. See this contract? Lucas provided these to me. It's... a sort of employee appreciation campaign. All you have to do is sign it, and we can give you a complete makeover.\"\n\n\"And it's... free?\" Alice asked, nervously wringing her hands.\n\n\"Well, we'll be collecting something from you later... but the reward comes first. Here, take a look.\" Jake placed the contract in front of her, which she examined with a puzzled stare.\n\n\"All I have to do is... give you my soul? What... Jake, what does that even mean?\"\n\n\"Oh, don't sweat it,\" Jake said, lying through his teeth. \"I signed one of these too. The idea is that you pour your heart and soul into the company. The specifics to be determined later, of course, but mostly we're just looking for a long term promise from you.\"\n\n\"Well, that's...\" Alice paused, looking at it nervously. \"And if I leave the company, I can pay that back in a different way?\"\n\n\"Of course you can,\" Jake said, with a warm smile. \"I understand you're just in high school right now, with no idea of where you're going to go in the world. Don't work about it. We can work out something else if need be.\"\n\n\"Then... then I'll do it,\" she said, taking a deep breath as she signed the contract. Alice gasped in shock as her body slowly adjusted itself. Her freckles vanished, her breasts expanded, and her modest clothing adjusted itself to better frame her now impressive figure. She wandered back to her desk in shock, letting the changes to her body sink in.\n\n\"And probably also the feeling of no longer having a soul,\" Jake said to himself. He took a look at the contract. Purity value of 30 feathers... minus 18 for the cost of beautification? \"Well, shit,\" he muttered to himself. \"I'd better get a good deal on the next one.\"", "action_results": [{"action": "Make a deal with Tanner next.", "result": "\"Tanner, would you come and see me when you're free?\" Jake said, yelling down the row of desks.\n\n\"Yeah, sure,\" he said, setting his trail mix aside and walking over to Jake's desk. \"What's up, boss?\"\n\n\"Oh, just... an offer. An opportunity, if you will. Lucas gave me a stack of contracts, and I was going to see if you wanted to accept one.\"\n\n\"A contract for what?\" he asked, raising an eyebrow.\n\n\"Well, anything,\" Jake said, with a shrug. \"They're... think of them as employee appreciate contracts.\"\n\n\"Really? And you're offering them to a part time worker like me? What are they for? Extra vacation time or something?\"\n\n\"Well, that's just it,\" Jake said. \"When I said they were for anything, I meant it. I'll just fill this one out like so... and I can guarantee you muscles.\"\n\n\"I... what?\" Tanner said, shaking his head in confusion. \"Did you just say muscles?\"\n\n\"I did,\" Jake said, offering him the contract with a smile. \"I can offer you muscular arms, fit legs, and a chest with ripped abs, instead of the beer belly you've currently got.\"\n\n\"How is that even possible? I mean, that's... forgive me for being skeptical, but I just don't believe you.\"\n\n\"Hey, I can't blame you. I was too. But that just means you have nothing to lose, right? Nothing to lose, and everything to gain if it works. We just ask that you put your heart and soul into the company.\"\n\nTanner rolled his eyes. \"Okay, yeah, that does sound like the hokey sort of crap that shows up in an employee appreciation gesture. What the hell, I'll sign it.\"\n\nHe no more than lifted up his pen before he let out a painful gasp- all of his muscles were twitching and spasming as his body quickly became a prime example of physical fitness. \"Holy crap... this... this is awesome! Best part time job ever!\" Tanner said, walking back to his desk with a huge grin on his face. It hadn't even occurred to him that he'd just sold his soul to the devil.\n\nJake took a look at the contract. Tanner's soul was ranked at 25 purity, minus 15 for the cost of sculpting his body, for a net profit of 10 feathers. \"Well, not bad,\" Jake muttered.\n\nCombined with Alice's contract, he was up to 22 feathers- one shy of tying for the value of his soul. \"Shit, I'm so close!\" he said, pounding his desk in anger. \"Well, if I can pick up Kevin's soul for cheap, I bet I can...\"\n\n\"...run out of time, I believe you were about to say.\" Jake looked up to find Lucas standing over him. \"You lost. Follow me, please.\"", "action_results": [{"action": "With a heavy sigh, Jake followed Lucas back to his office.", "result": "\"It is now the close of business, and you have not collected souls worth exchanging for your own. So, as we agreed, I get to keep your soul.\"\n\nJake let out a deep sigh. \"So... what happens now?\" he asked, trying not to think about the implications of what he had just done in an effort to save his own soul. Had he really just damned a few kids in a frantic attempt to save himself?\n\n\"Well, for starters, I'll just file these contracts of yours away,\" Lucas said, opening the bottom drawer of his obsidian filing cabinet. \"When it comes time for them to quit or leave the company, I'll be sure to collect on their promise. As far as what happens to you... well, I'll be taking back the gift of demonhood from you. It seems that you don't have what it takes to succeed. So, as a mortal without a soul... you'll feel nothing. Just like before, your consciousness will black out, leaving you with no memory of your time alive. Your body will be walking around, doing my bidding, serving the company as I see fit, until you eventually die. After that, your consciousness will awaken in Hell. For you, it will seem like an instant, but I assure you that your body will have been alive for at least forty more years, accruing even more sins that we'll be holding against you as we torture you for all eternity. How does that sound?\"\n\nJake clenched his fists in frustration. \"But I was so close!\"\n\n\"Yes, yes, you were,\" Lucas said, shrugging his shoulders. \"And if you hadn't wasted so much magic on granting Alice and Tanner's wishes, you would have succeeded. But you did not, and here we are. May we continue, or should I wait, and let you continue to feel sorry for yourself?\"\n\n\"I'm waiting on you, asshat,\" Jake said, with a grimace. His muscles tensed, as he tried to brace himself for the darkness which he knew would come. He felt a tap on his forehead, and an uneasy peace as his body fell away to the ground like discarded clothing. There was a brief glimpse of a wrinkled body in a hospital bed, presumably his own. Then there was nothing but deep, searing pain and the heat of the flames.", "action_results": []}]}, {"action": "Make a deal with Kevin next.", "result": "\"Kevin, can you come see me at my desk when you get a chance?\"\n\n\"Ah, come on man, I'm working, ain't I? Get off my back, I'm not slacking.\"\n\n\"That's... you're not in trouble, Kevin, I just want to talk to you.\"\n\n\"Oh, well, I guess that's fine, then,\" he said, walking over. \"So whaddya want?\"\n\n\"I just want to make you an offer,\" Jake said, gesturing to the pile of contract paper. \"Lucas gave these to me. Think of it as a sort of employee appreciation gesture.\"\n\n\"You're shitting me,\" Kevin said, raising an eyebrow. \"I'm just a part-time cog in the system. A pretty bad one, too, at that. There's no way in hell a company like this appreciates me.\"\n\n\"Nevertheless,\" Jake said, holding back his tongue. \"I'm prepared to offer you $5,000, and all you have to do is sign here.\"\n\n\"Is that all? Done!\" he said, grabbing the pen and signing.\n\n\"You... are not going to read the terms?\" Jake asked, slightly surprised.\n\n\"Pssh, why bother?\" he asked. \"My life is hell, anyway. Whatever longterm effects will come of this, I'll deal with 'em then. I've got bills to pay off, man. And games to buy. And I need new speakers for my car, maybe some sweet rims. I figure, whatever thing of value you think you can take from me, you're welcome to it. Because, frankly, I don't have anything of value.\" Kevin grabbed the stack of bills that had appeared on Jake's desk, either not noticing or not caring that they had appeared out of nowhere.\n\n\"Apparently you don't,\" Jake muttered to himself, looking at the contract as Kevin walked back to his desk. The cost of the deal had only cost him 1 feather, but Kevin's soul had only been worth 8 feathers in the first place.\n\nCombined with Alice's contract, he was up to 19 feathers- only four short. \"Well, I was hoping to be done by now, but at least once I get Tanner out of the way, I'll...\"\n\n\"...fall a bit short, I believe you were about to say.\" Jake looked up to find Lucas standing over him. \"You're out of time. Follow me, please.\"", "action_results": [{"action": "With a heavy sigh, Jake followed Lucas back to his office.", "result": "\"It is now the close of business, and you have not collected souls worth exchanging for your own. So, as we agreed, I get to keep your soul.\"\n\nJake let out a deep sigh. \"So... what happens now?\" he asked, trying not to think about the implications of what he had just done in an effort to save his own soul. Had he really just damned a few kids in a frantic attempt to save himself?\n\n\"Well, for starters, I'll just file these contracts of yours away,\" Lucas said, opening the bottom drawer of his obsidian filing cabinet. \"When it comes time for them to quit or leave the company, I'll be sure to collect on their promise. As far as what happens to you... well, I'll be taking back the gift of demonhood from you. It seems that you don't have what it takes to succeed. So, as a mortal without a soul... you'll feel nothing. Just like before, your consciousness will black out, leaving you with no memory of your time alive. Your body will be walking around, doing my bidding, serving the company as I see fit, until you eventually die. After that, your consciousness will awaken in Hell. For you, it will seem like an instant, but I assure you that your body will have been alive for at least forty more years, accruing even more sins that we'll be holding against you as we torture you for all eternity. How does that sound?\"\n\nJake shook his head. \"You know, the pessimist in me always assumed I was going to Hell. I just never thought it would be so soon or so literal.\"\n\n\"Oh, yes, hah hah. Brilliant quip. Very funny,\" Lucas replied, with a slow clap. \"Are you quite finished?\"\n\n\"I'm waiting on you, asshat,\" Jake said, with a grimace. His muscles tensed, as he tried to brace himself for the darkness which he knew would come. He felt a tap on his forehead, and an uneasy peace as his body fell away to the ground like discarded clothing. There was a brief glimpse of a wrinkled body in a hospital bed, presumably his own. Then there was nothing but deep, searing pain and the heat of the flames.", "action_results": []}]}]}, {"action": "Start with Tanner.", "result": "\"Tanner, would you come and see me when you're free?\" Jake said, yelling down the row of desks.\n\n\"Yeah, sure,\" he said, setting his trail mix aside and walking over to Jake's desk. \"What's up, boss?\"\n\n\"Oh, just... an offer. An opportunity, if you will. Lucas gave me a stack of contracts, and I was going to see if you wanted to accept one.\"\n\n\"A contract for what?\" he asked, raising an eyebrow.\n\n\"Well, anything,\" Jake said, with a shrug. \"They're... think of them as employee appreciate contracts.\"\n\n\"Really? And you're offering them to a part time worker like me? What are they for? Extra vacation time or something?\"\n\n\"Well, that's just it,\" Jake said. \"When I said they were for anything, I meant it. I'll just fill this one out like so... and I can guarantee you muscles.\"\n\n\"I... what?\" Tanner said, shaking his head in confusion. \"Did you just say muscles?\"\n\n\"I did,\" Jake said, offering him the contract with a smile. \"I can offer you muscular arms, fit legs, and a chest with ripped abs, instead of the beer belly you've currently got.\"\n\n\"How is that even possible? I mean, that's... forgive me for being skeptical, but I just don't believe you.\"\n\n\"Hey, I can't blame you. I was too. But that just means you have nothing to lose, right? Nothing to lose, and everything to gain if it works. We just ask that you put your heart and soul into the company.\"\n\nTanner rolled his eyes. \"Okay, yeah, that does sound like the hokey sort of crap that shows up in an employee appreciation gesture. What the hell, I'll sign it.\"\n\nHe no more than lifted up his pen before he let out a painful gasp- all of his muscles were twitching and spasming as his body quickly became a prime example of physical fitness. \"Holy crap... this... this is awesome! Best part time job ever!\" Tanner said, walking back to his desk with a huge grin on his face. It hadn't even occurred to him that he'd just sold his soul to the devil.\n\nJake took a look at the contract. Tanner's soul was ranked at 25 purity, minus 15 for the cost of sculpting his body, for a net profit of 10 feathers. \"Well, crap,\" Jake muttered. \"That's not even half. I need to do better with the next soul.\"", "action_results": [{"action": "Make a deal with Alice next.", "result": "\"Alice, you could stop by my desk when you have a moment?\" Jake said, calling out over the row of cubicles.\n\n\"Is... is something wrong?\" she stuttered, approaching his desk a few minutes later. \"Is this about my productivity scores, or...?\"\n\n\"No, no, nothing like that,\" Jake said, with a friendly smile and a dismissive wave. \"You're not in trouble. Think of this as... an offer. Or an opportunity, if you will. There's no easy way for me to ask this, but... how would you like to be beautiful?\"\n\n\"Sir...?\"\n\n\"I know, I know, but hear me out. See this contract? Lucas provided these to me. It's... a sort of employee appreciation campaign. All you have to do is sign it, and we can give you a complete makeover.\"\n\n\"And it's... free?\" Alice asked, nervously wringing her hands.\n\n\"Well, we'll be collecting something from you later... but the reward comes first. Here, take a look.\" Jake placed the contract in front of her, which she examined with a puzzled stare.\n\n\"All I have to do is... give you my soul? What... Jake, what does that even mean?\"\n\n\"Oh, don't sweat it,\" Jake said, lying through his teeth. \"I signed one of these too. The idea is that you pour your heart and soul into the company. The specifics to be determined later, of course, but mostly we're just looking for a long term promise from you.\"\n\n\"Well, that's...\" Alice paused, looking at it nervously. \"And if I leave the company, I can pay that back in a different way?\"\n\n\"Of course you can,\" Jake said, with a warm smile. \"I understand you're just in high school right now, with no idea of where you're going to go in the world. Don't work about it. We can work out something else if need be.\"\n\n\"Then... then I'll do it,\" she said, taking a deep breath as she signed the contract. Alice gasped in shock as her body slowly adjusted itself. Her freckles vanished, her breasts expanded, and her modest clothing adjusted itself to better frame her now impressive figure. She wandered back to her desk in shock, letting the changes to her body sink in.\n\n\"And probably also the feeling of no longer having a soul,\" Jake said to himself. He took a look at the contract. Purity value of 30 feathers... minus 18 for the cost of beautification? \"Well, shit,\" he muttered to himself. \"So close.\"\n\nCombined with Tanner's contract, he was up to 22 feathers- just one shy of the 23 he needed to keep his soul. \"Well, it's not over yet. If I can pick up Kevin's soul for cheap, maybe I can...\"\n\n\"...run out of time, I believe you were about to say.\" Jake looked up to find Lucas standing over him. \"You lost. Follow me, please.\"", "action_results": [null]}, {"action": "Make a deal with Kevin next.", "result": "Kevin, can you come see me at my desk when you get a chance?\"\n\n\"Ah, come on man, I'm working, ain't I? Get off my back, I'm not slacking.\"\n\n\"That's... you're not in trouble, Kevin, I just want to talk to you.\"\n\n\"Oh, well, I guess that's fine, then,\" he said, walking over. \"So whaddya want?\"\n\n\"I just want to make you an offer,\" Jake said, gesturing to the pile of contract paper. \"Lucas gave these to me. Think of it as a sort of employee appreciation gesture.\"\n\n\"You're shitting me,\" Kevin said, raising an eyebrow. \"I'm just a part-time cog in the system. A pretty bad one, too, at that. There's no way in hell a company like this appreciates me.\"\n\n\"Nevertheless,\" Jake said, holding back his tongue. \"I'm prepared to offer you $5,000, and all you have to do is sign here.\"\n\n\"Is that all? Done!\" he said, grabbing the pen and signing.\n\n\"You... are not going to read the terms?\" Jake asked, slightly surprised.\n\n\"Pssh, why bother?\" he asked. \"My life is hell, anyway. Whatever longterm effects will come of this, I'll deal with 'em then. I've got bills to pay off, man. And games to buy. And I need new speakers for my car, maybe some sweet rims. I figure, whatever thing of value you think you can take from me, you're welcome to it. Because, frankly, I don't have anything of value.\" Kevin grabbed the stack of bills that had appeared on Jake's desk, either not noticing or not caring that they had appeared out of nowhere.\n\n\"Apparently you don't,\" Jake muttered to himself, looking at the contract as Kevin walked back to his desk. The cost of the deal had only cost him 1 feather, but Kevin's soul had only been worth 8 feathers in the first place.\n\nCombined with Tanner's contract, he was up to 17 feathers- still a fair ways to go. \"Dammit. I was hoping to be done by now, but if I can get Alice's soul for a good price, I'll...\"\n\n\"...fall a bit short, I believe you were about to say.\" Jake looked up to find Lucas standing over him. \"You're out of time. Follow me, please.\"", "action_results": [null]}]}, {"action": "Start with Kevin.", "result": "\"Kevin, can you come see me at my desk when you get a chance?\"\n\n\"Ah, come on man, I'm working, ain't I? Get off my back, I'm not slacking.\"\n\n\"That's... you're not in trouble, Kevin, I just want to talk to you.\"\n\n\"Oh, well, I guess that's fine, then,\" he said, walking over. \"So whaddya want?\"\n\n\"I just want to make you an offer,\" Jake said, gesturing to the pile of contract paper. \"Lucas gave these to me. Think of it as a sort of employee appreciation gesture.\"\n\n\"You're shitting me,\" Kevin said, raising an eyebrow. \"I'm just a part-time cog in the system. A pretty bad one, too, at that. There's no way in hell a company like this appreciates me.\"\n\n\"Nevertheless,\" Jake said, holding back his tongue. \"I'm prepared to offer you $5,000, and all you have to do is sign here.\"\n\n\"Is that all? Done!\" he said, grabbing the pen and signing.\n\n\"You... are not going to read the terms?\" Jake asked, slightly surprised.\n\n\"Pssh, why bother?\" he asked. \"My life is hell, anyway. Whatever longterm effects will come of this, I'll deal with 'em then. I've got bills to pay off, man. And games to buy. And I need new speakers for my car, maybe some sweet rims. I figure, whatever thing of value you think you can take from me, you're welcome to it. Because, frankly, I don't have anything of value.\" Kevin grabbed the stack of bills that had appeared on Jake's desk, either not noticing or not caring that they had appeared out of nowhere.\n\n\"Apparently you don't,\" Jake muttered to himself, looking at the contract as Kevin walked back to his desk. The cost of the deal had only cost him 1 feather, but Kevin's soul had only been worth 8 feathers in the first place.\n\n\"I'm going to have to do way better than this,\" he muttered. \"I still need... God, I still need 16 feathers worth.\"\n\n\"Hey, Jake, can I ask you something?\" said a voice from the other side of the cubicle wall.\n\n\"Sure, what is it, Nate?\" he asked.\n\n\"Why did you just give Kevin a stack of money, and how do I get in on that?\"\n\nJake paused. He hadn't even considered the thought of tempting Nate; he was new enough that Jake couldn't think of anything to tempt him with. And then there was the fact that he was one of those intellectual types who probably wouldn't be stupid enough to sign away his soul.\n\n\"Well, I have to go in order, Nate,\" said Jake, thinking quickly. \"Kevin was first on the list.\"", "action_results": [{"action": "\"And Alice is next.\"", "result": "\"Alice, you could stop by my desk when you have a moment?\" Jake said, calling out over the row of cubicles.\n\n\"Is... is something wrong?\" she stuttered, approaching his desk a few minutes later. \"Is this about my productivity scores, or...?\"\n\n\"No, no, nothing like that,\" Jake said, with a friendly smile and a dismissive wave. \"You're not in trouble. Think of this as... an offer. Or an opportunity, if you will. There's no easy way for me to ask this, but... how would you like to be beautiful?\"\n\n\"Sir...?\"\n\n\"I know, I know, but hear me out. See this contract? Lucas provided these to me. It's... a sort of employee appreciation campaign. All you have to do is sign it, and we can give you a complete makeover.\"\n\n\"And it's... free?\" Alice asked, nervously wringing her hands.\n\n\"Well, we'll be collecting something from you later... but the reward comes first. Here, take a look.\" Jake placed the contract in front of her, which she examined with a puzzled stare.\n\n\"All I have to do is... give you my soul? What... Jake, what does that even mean?\"\n\n\"Oh, don't sweat it,\" Jake said, lying through his teeth. \"I signed one of these too. The idea is that you pour your heart and soul into the company. The specifics to be determined later, of course, but mostly we're just looking for a long term promise from you.\"\n\n\"Well, that's...\" Alice paused, looking at it nervously. \"And if I leave the company, I can pay that back in a different way?\"\n\n\"Of course you can,\" Jake said, with a warm smile. \"I understand you're just in high school right now, with no idea of where you're going to go in the world. Don't work about it. We can work out something else if need be.\"\n\n\"Then... then I'll do it,\" she said, taking a deep breath as she signed the contract. Alice gasped in shock as her body slowly adjusted itself. Her freckles vanished, her breasts expanded, and her modest clothing adjusted itself to better frame her now impressive figure. She wandered back to her desk in shock, letting the changes to her body sink in.\n\n\"And probably also the feeling of no longer having a soul,\" Jake said to himself. He took a look at the contract. Purity value of 30 feathers... minus 18 for the cost of beautification? \"Well, shit,\" he muttered to himself.\n\nCombined with Kevin's contract, he was up to 19 feathers- four feathers short of the mark. \"Dammit. I was hoping to be done by now, but if I can get Tanner's soul for a good price, maybe I'll...\"\n\n\"...fall a bit short, I believe you were about to say.\" Jake looked up to find Lucas standing over him. \"You're out of time. Follow me, please.\"", "action_results": [null]}, {"action": "\"And Tanner is next.\"", "result": "\"Tanner, would you come and see me when you're free?\" Jake said, yelling down the row of desks.\n\n\"Yeah, sure,\" he said, setting his trail mix aside and walking over to Jake's desk. \"What's up, boss?\"\n\n\"Oh, just... an offer. An opportunity, if you will. Lucas gave me a stack of contracts, and I was going to see if you wanted to accept one.\"\n\n\"A contract for what?\" he asked, raising an eyebrow.\n\n\"Well, anything,\" Jake said, with a shrug. \"They're... think of them as employee appreciate contracts.\"\n\n\"Really? And you're offering them to a part time worker like me? What are they for? Extra vacation time or something?\"\n\n\"Well, that's just it,\" Jake said. \"When I said they were for anything, I meant it. I'll just fill this one out like so... and I can guarantee you muscles.\"\n\n\"I... what?\" Tanner said, shaking his head in confusion. \"Did you just say muscles?\"\n\n\"I did,\" Jake said, offering him the contract with a smile. \"I can offer you muscular arms, fit legs, and a chest with ripped abs, instead of the beer belly you've currently got.\"\n\n\"How is that even possible? I mean, that's... forgive me for being skeptical, but I just don't believe you.\"\n\n\"Hey, I can't blame you. I was too. But that just means you have nothing to lose, right? Nothing to lose, and everything to gain if it works. We just ask that you put your heart and soul into the company.\"\n\nTanner rolled his eyes. \"Okay, yeah, that does sound like the hokey sort of crap that shows up in an employee appreciation gesture. What the hell, I'll sign it.\"\n\nHe no more than lifted up his pen before he let out a painful gasp- all of his muscles were twitching and spasming as his body quickly became a prime example of physical fitness. \"Holy crap... this... this is awesome! Best part time job ever!\" Tanner said, walking back to his desk with a huge grin on his face. It hadn't even occurred to him that he'd just sold his soul to the devil.\n\nJake took a look at the contract. Tanner's soul was ranked at 25 purity, minus 15 for the cost of sculpting his body, for a net profit of 10 feathers. \"Well, crap,\" Jake muttered.\n\nCombined with Kevin's contract, he was up to 17 feathers- still a fair ways to go. \"Dammit. I was hoping to be done by now, but if I can get Alice's soul for a good price, I'll...\"\n\n\"...fall a bit short, I believe you were about to say.\" Jake looked up to find Lucas standing over him. \"You're out of time. Follow me, please.\"", "action_results": [null]}, {"action": "\"And... well, actually, you're next.\"", "result": "\"And... well, actually, you're next,\" Jake said, deciding to try and see if he could tempt Nate. \"Go ahead and come over here- I hate talking through cubical walls, and anyway, I'll need you to sign something.\" Not knowing where to begin, Jake just created another contract like Kevin's- $5,000 in easy money.\n\n\"Well, I don't know how much you overheard, but Lucas- that's Mr. Flint, he gave me this stack of contracts here. Think of them as a sort of employee appreciation bonus. All you need to do is sign here, and the money is yours.\"\n\n\"And... just what am I agreeing to sign, exactly?\" Nate asked, raising an eyebrow.\n\n\"Well, basically it's a statement saying that you're going to invest your entire heart and soul into the company,\" Jake said, his spirits sinking. Nate had caught onto the gimmick rather quickly. Perhaps this had been a bad idea? \"It's... it's a loyalty thing,\" Jake said, scratching the back of his neck.\n\n\"I... guess,\" Nate said, grabbing the contract and looking it over. \"But what it actually says is that I'm forfeiting my soul. You... realize that, right? I mean, I don't care, but I would imagine that a lot of people here would. Christ, can you imagine how someone like Connor would react to a statement like that?\"\n\n\"That's... a good point,\" Jake said, with a laugh. Apparently Nate also didn't believe in the supernatural, which was going to make things a lot easier. \"I'm actually surprised that you don't care, though, honestly. I can't believe such a bone-headed error made it onto the contract. We'll have to throw these others out. But... did you want to sign one of these, or wait for a corrected one? I can't give you anything until we've got your signature.\"\n\n\"Eh, I'll just sign this one,\" Nate said, picking up a nearby pen. \"The mistake doesn't bother me. I'm an athiest. I don't believe in souls.\"\n\n\"Well, perhaps you should,\" Jake replied with a smirk. He looked at the contract- 20 feathers, minus one for the money... success! \"If you'll excuse me, I need to meet with Lucas before the end of the day.\"\n\n\"Did... did that money just appear out of nowhere?\" Nate asked, nervously staring at the pile of cash which had appeared the moment he had signed the contract. \"You... you were kidding, right? I mean, souls don't exist. The idea is utterly ridiculous. And if they did, it wouldn't be that easy for me to sign mine away, right? Right?\"", "action_results": [{"action": "Jake didn't bother with a reply.", "result": "Lucas looked up from his desk as Jake strolled proudly inside. \"Ahh... Jake, I was just about to come and find you. How did you fare?\"\n\n\"Between Kevin and Nate, I've got 26 feathers of purity. Or however you measure that crap. The point is, I got more than the 23 that I needed, so I get my soul back.\"\n\n\"So you did,\" Lucas said, with a smile. \"I have to admit, I'm quite surprised. But, a deal is a deal. Your soul is now your own once more. Of course, there is the slight complication of your employment as a repo-demon...\"\n\nJake could feel the enthusiasm and hope draining from his body.\n\n\"You see, Jake... repo-demons are not mortal, and therefore do not have souls. So, even though you now own your soul in a jar, you can't really do anything with it. Restoring you to your mortality was never a part of the deal. And since I know you're going to ask... no, you cannot simply stop being a repo-demon.\n\n\"You now have two options available to you. One, you continue to serve me as a repo-demon, collecting souls and earning the privledge of continued existance. Why, in a few eons, you might even get a promotion! Or, you could try and defy me. Then I decide that I no longer need your services, and you simply cease to exist.\"\n\nJake looked frantically back and forth between Lucas and his soul. \"But... you never... I didn't.... that's not...\"\n\n\"Is that not fair?\" Lucas taunted, finishing Jake's words. \"Since when was Hell ever known for being fair? I was more than willing to give you that information. You just never asked. In fact, the whole situation is rather like what you just did to Nate back there, is it not? Using omission of the truth against him, to get what you want? Only in my case, I'm just twisting the knife further into the wound of the already damned. You, however, just damned an otherwise completely innocent teenager to the fires of Hell. Given what you've just done to Nate and Kevin, I can't imagine why you would even want your mortality back. As if you could ever be forgiven. You may as throw your lot in with us, Jake. We're all you deserve.\"\n\n\"I...\" Jake let out a deep sigh. Lucas had won. Better to give in now, than to try and make some further bargain and ruin things further. \"I exist to serve,\" he said, kneeling down before him.", "action_results": []}]}]}]}]}, {"action": "Say nothing.", "result": "\"Suit yourself,\" Lucas said, with a shrug. \"If you think I'm going to be impressed by your stoic silence, you are sadly mistaken.\n\n\"Honestly, I was hoping you would plead for your soul. It makes my job so much more enjoyable. Not to mention you idiot mortals usually give me all sorts of contractual loop holes I can exploit to obtain even more souls... but, no matter. You'll be a soulless husk soon enough, and I can certainly use that to my advantage. A second puppet to use in my schemes will be very helpful here... why, with enough planning, I might even be able to obtain Connor's soul!\n\n\"But I digress,\" he said, cutting his monologue short. \"It's not like any of this is relevant to you. Your brief span of life on this planet is about to end.\" Jake felt a shortness of breath and a sinking, hollow feeling in his stomach when Lucas pulled the jar away.\n\n\"Say goodbye to your last moments of consciousness, Jacob,\" he said, his grin growing ever wider. Lucas pressed his fingers against Jake's forehead, and he felt his body go completely limp out from under him. The world had faded to black before he had even hit the ground.", "action_results": []}]}]}