{"tree_id": "https://infinite-story.com/story/room.php?id=200154", "context": "", "first_story_block": "Today everything is as I imaged just when I was 8 years old exactly in 1970.", "action_results": [{"action": "To watch the news", "result": "I'm sitting and watching TV the news of Apolo 13 returning to Earth appears.", "action_results": [{"action": "They think about it.", "result": "And I think that every day the world becomes different... I suppose that's the idea of humans.", "action_results": [{"action": "Be careful.", "result": "The world changes it becomes more dangerous, change the tranquility and happiness of the humans.", "action_results": [{"action": "The city becomes gothic.", "result": "In everywhere there are problems, there are die, there is dangerous, the people is rude and bad, the sky looks grey, the buildings are moderns but them looks darker, nothing is like before the city looks gothic.", "action_results": [{"action": "Remember when...", "result": "I still remember the day I was at the concert's Gloria Gaynor, everything was so fantastic, singing at full volume feeling the music in my veins, but now ... people only worry about recording and taking photos all the time.", "action_results": [{"action": "The problem was, is and will be.", "result": "I don't blame to world, the problem was, is and will be our because, we don't know the meaning of the life, its importance and value.", "action_results": [{"action": "We will have nothing.", "result": "The world has offered us its wonders and we only end them, we always want more, we are never satisfied with anything, we destroy everything and in the end we will have nothing.", "action_results": [{"action": "Right now.", "result": "Right now, I m 59 years old and I feel that I am in other word, I miss like everything was in the past.", "action_results": [{"action": "In the present.", "result": "At present there is something that took over the world and people, called technology, everything go around it and did all so strange", "action_results": [{"action": "Children's lives.", "result": "Flat screens, smartphones, computers, robots, too many things. The children no longer go out to play in the park, the romantics dates are watching netflix, speak by social networks.In addition, Now you can work on the computer, we can do something called video calls, endless things.", "action_results": [{"action": "Start and end.", "result": "The day start and end in a second, everything is extremely fast. Your life pass in pair of seconds at present. Before of this everybody enjoyed the time, the life, of our different world", "action_results": [{"action": "Youth of today.", "result": "I have looked closely at the youth of today, they grow up as different as I did, they grow up with parents who work all day and they are not so familiar. In addition, the food is weird because chemical toxicity in consumer products was much lower compared to today. In the 70s there were no things without gluten, without sugar, without fat, without lactose however everything looks make damage.", "action_results": [{"action": "Infinite things.", "result": "They are infinite things...\nBecause, everybody live their own world however it seems that everyone lives the lives of others.", "action_results": [{"action": "Social networks.", "result": "A clear example, social networks.\nThe social environment, is one of the things that I still do not understand. Photos are published, people comment with offensive words, comment on the lives of others, judge between themselves without knowing the truth, demand so much respect and do not look at them first.", "action_results": [{"action": "That is crazy.", "result": "That is crazy, I never imagen that something like that could pass. Actually, that hurt the people and make of this world something worst.\nNevertheless, I have to live this life", "action_results": []}, {"action": "There are types of love.", "result": "Now, there are different types of love, hybrids, polyamory, Swingers and flexisexuals, all of them to love more than one person. I do not want to judge, I just do not think freely like them, in my concept, love is a feeling that only takes with a person to his deathbed.\n\nLike me with Olivia, the love of my life.", "action_results": []}]}, {"action": "Bad luck.", "result": "Is a pity, that these people don't know the real love, the love that make you smile from ear to ear and feel you as light as a feather.", "action_results": [null, null]}]}, {"action": "People tell me.", "result": "Many people tell me to get someone else, but they do not understand, love is not something forced, love is born from an affectionate look, a stolen kiss. My beautiful Olivia captivated my heart with her beautiful laugh, patience and delicacy.", "action_results": [null, null]}]}, {"action": "I miss her.", "result": "I miss her, like the moon miss to the stars. She was everything for me, her departure have given me an empty, but I know maybe I need help but the world is so cruel and it hurts me more.", "action_results": [null, null]}]}, {"action": "My dates with her.", "result": "I remeber when I had my third date with my darling Olivia, we walked in the forest and saw a nice duck, it was the first time I heard his beautiful laugh. We ate a dessert called Duraznos Melba, it was a beautiful evening and finally I took her home.", "action_results": [null, null]}]}, {"action": "People speaking or chatting?", "result": "I have been in many modern restaurants but its not so nice, everybody is in their cell phone or in a call, and nobody is talking with their couple or enjoy in them.", "action_results": [null, null]}]}, {"action": "Shocking thoughts.", "result": "As I grew older I had many shocking thoughts with future of society. They are less traditional, now they are freer. At present the priority is not to marry and haven't children, it is to have a good job and money.", "action_results": [null, null]}]}]}, {"action": "I miss darling.", "result": "I still remember how I fell in love with my sweet Olivia, how much I had to do to show her my love. The beautiful poems that I created about her perfect face, the different types of flowers that she liked, her favorite chocolate. Now just I can live of her memory.", "action_results": [null]}]}, {"action": "It hurts in my heart.", "result": "However, there is something that hurt in my heart... the change of people that fall in love, now fall in love is so different , the letters disapear, the chocolates, the flowers and the romantic day in the park too, that small things that made all so special...", "action_results": [null, null]}]}, {"action": "My life in the 70s.", "result": "Life in the 70s is very different from today. I am not prepared, the excessive use of the internet is annoying people depend on this technology, the world sounrrounded of strangers things and there is no way to avoid it.", "action_results": [null, null]}]}, {"action": "I'm scared.", "result": "Right now, I am scared because I am sure the world becomes wild.", "action_results": [null, null]}]}, {"action": "Nobody cooks.", "result": "When I was a kid my mom cooks me my favorite food, a delicious meat with fries potatoes and salad, she knew that it was very special to me. But now, people prefer fast foods, hardly anyone cooks anymore. They don't know how special it is that someone cooks for you.", "action_results": [null, null]}]}, {"action": "I liked.", "result": "Before my favorite hobby was play with my toys and my neighbors, but now my life changed, my friends changed, everything changed...", "action_results": [null, null]}]}, {"action": "Remember when I was a child", "result": "When I was a child the life was not a problem for me, but now I grew up and everything is different.", "action_results": [null, null]}]}